[
    {
        "title": "Kingdom Drag King Showcase",
        "date_time": "Friday, May 2 · 8 - 10pm EDT",
        "location": "The Foundry 101 Rogers Street Cambridge, MA 02142 Show map",
        "about": "Welcome to the Kingdom Drag King Showcase! The legacy of the Kingdom lives on as class #10 makes their stage debuts! Whether you're  new to drag kings or beloved family, be prepared to be wowed with sexiness and utter creativity.  Alongside  these 10 new drag kings, the cast will also joined by Slick O'Connell, Cyrus K. Stratton, Flash Flood (a Class 6 graduate), and Daddy Jamison.  18+ show",
        "event_link": "https://www.eventbrite.com/e/kingdom-drag-king-showcase-tickets-1301379805029?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#drag",
            "#event",
            "#showcase",
            "#king",
            "#kingdom"
        ]
    },
    {
        "title": "Hush Harbor: Ifé Franklin and DZIDZOR",
        "date_time": "Sunday, April 27 · 4 - 6pm EDT",
        "location": "St. Augustine's African Orthodox Church 137 Allston Street Cambridge, MA 02139 Show map",
        "about": "Hush harbors were secret meeting places where in enslaved African-Americans would gather to worship, socialize, and maintain Cultural traditions outside of the ever watchful eyes of white society. Ifé Franklin and Dzidzor with support from community members will activate the sanctuary of Saint Augustine African Orthodox Church, creating a space for folks to gather, sing, shout, moan and move and share joy! We need these safe space more than ever for our collective healing, hope and liberation. Participants are welcome to bring an instrument, your voice, to move, dance, or sit in space together. This special event is tailored specially for a participatory audience of Black, Indigenous and people of color (BIPOC) only, as BHAC creates a safe harbor in a challenging time. Our following events are open to all. This event will be followed by a social time including refreshments.",
        "event_link": "https://www.eventbrite.com/e/hush-harbor-ife-franklin-and-dzidzor-tickets-1317752405919?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#event",
            "#performance",
            "#bipoc",
            "#dzidzor",
            "#hush_harbor",
            "#ife_franklin"
        ]
    },
    {
        "title": "Концерт памяти Ю. Визбора в Бостоне.",
        "date_time": "Starts on Thursday, May 1 · 8pm EDT",
        "location": "John Hancock Hall 180 Berkeley Street Boston, MA 02116 Show map",
        "about": "На сцене будут выступать Вениамин Смехов, Сергей Никитин, Алексей и Мария Иващенко, Дмитрий Богданов, Тимур Шаов, Галина и Алексей Хомчики, Артем Лысков и музыканты джазового трио Stellar! Билеты без комиссии так же можно заказать по телефону 617-232-8820. «Разрешите вам напомнить о себе» – так мы назвали добрую беседу с близкими людьми, которые соберутся в этот вечер вместе на сцене и в зале. Мы будем рассказывать друг другу истории, написанные Юрием Визбором, как он рассказывал их сам. Под гитару, но не только. Визбор не был бунтарем, как Высоцкий, или философом, как Окуджава. Скорее как Синатра, певец обычного человеческого существования, наполненного дружбой, добротой и романтикой. Прошлым летом ему исполнилось 90. А в 50 он ушел в лыжной куртке и шапке с помпоном к своим далеким вершинам, оставив нам песни, чтобы не забывали. Мы и не забываем, поем. Заходите вечером в гости, берите с собой друзей и родных. Давайте проведем эти три часа вместе, споем его песни, поговорим, отметим его юбилей. Искренне ваши, Вениамин Смехов, Сергей Никитин, Алексей и Мария Иващенко, Дмитрий Богданов, Тимур Шаов, Галина и Алексей Хомчики, Артем Лысков и музыканты джазового трио Stellar.",
        "event_link": "https://www.eventbrite.com/e/1261646772459?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#concert",
            "#boston",
            "#event",
            "#memory",
            "#y_vizbor"
        ]
    },
    {
        "title": "FFF Spring Drag Show - Catwalking on Sunshine",
        "date_time": "Thursday, May 8 · 7 - 10pm EDT",
        "location": "Venu Nightclub 100 Warrenton Street Boston, MA 02116 Show map",
        "about": "FLAG Flag Football invites you to our Annual Spring Drag Show on Thursday, May 8th at Venu Nightclub. This even is a fundraiser for Gay Bowl 2025 in sunny San Diego and this year's theme is Catwalking on Sunshine! If you're interested in Performing or Pit Crew, sign up: forms.gle/33Qkkgp8BW7Cq1re9 This event is 21+ but aside from the age restriction, all are welcome! Please note there is a set capacity in the space so ticket prices may increase in the days/weeks leading up to the show and we are expecting to sell out. The venue is located on the second floor with a flight of stairs to enter the space from ground level, there unfortunately is not an elevator onsite. During the event there will be loud music and moving lights. Any questions, please contact events@flagflagfootball.com We look forward to seeing you there!",
        "event_link": "https://www.eventbrite.com/e/fff-spring-drag-show-catwalking-on-sunshine-tickets-1271778607049?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#music",
            "#party",
            "#entertainment",
            "#drag",
            "#football",
            "#gay",
            "#lgbtq",
            "#fundraiser",
            "#performance",
            "#dragshow"
        ]
    },
    {
        "title": "Keila Wakao Plays Barber",
        "date_time": "Sunday, April 27 · 3:30 - 5:30pm EDT",
        "location": "First Church in Cambridge 11 Garden Street Cambridge, MA 02138 Show map",
        "about": "First prize winner of both the Menuhin International Violin Competition and the Stulburg International String Competition, Keila Wakao is a Boston native currently attending the New England Conservatory of Music. She has performed concertos with orchestras across the United States including the Boston Symphony Orchestra, the Chattanooga Symphony Orchestra, the Eugene Symphony, the Richmond Symphony, the Kalamazoo Symphony Orchestra, the Lexington Symphony, the Baltimore Chamber Orchestra, and many more. She returns to the Apollo Ensemble to perform Barber's Violin Concerto on a program that also features the world premiere of Gala Flagello's Droughts and Downpours for string orchestra and Brahms' 3rd Symphony. The Apollo Ensemble of Boston Elias Miller, Music Director Program: Gala Flagello – Droughts and Downpours (*World Premiere*) Brahms – Symphony No. 3 in F major ~Intermission~ Barber – Violin Concerto (Keila Wakao, Violin) Where: First Church Cambridge 11 Garden Street, Cambridge, Massachusetts 02138 When: April 27th, 2025 at 3:30PM",
        "event_link": "https://www.eventbrite.com/e/keila-wakao-plays-barber-tickets-1049785746427?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#performance",
            "#orchestra",
            "#symphony",
            "#concerto",
            "#livemusic",
            "#musician",
            "#brahms",
            "#classicalmusic",
            "#free_event",
            "#classical_music"
        ]
    },
    {
        "title": "Drag Me To Brunch 8th Anniversary Show - May 4th, 2025",
        "date_time": "Sunday, May 4 · 12 - 2pm EDT",
        "location": "Carrie Nation Cocktail Club 11 Beacon Street Boston, MA 02108 Show map",
        "about": "The event is going to be a vibrant extravaganza, showcasing the best of drag culture and entertainment. From jaw-dropping performances to fabulous costumes, the show is a feast for the senses. Attendees will be treated to a whirlwind of performances by some of Boston’s most talented drag queens in the business. Each act is filled with energy, humor, and impeccable lip-syncing, captivating the audience from start to finish. From classic diva numbers to contemporary pop hits to group numbers, there is something for everyone to enjoy. But Drag Me to Brunch is more than just a showcase of talent; it's a celebration of diversity, self-expression, and acceptance. The atmosphere is electric, filled with love, support, and a sense of community. It's a place where people can come together to celebrate their differences and revel in the joy of being themselves. And let's not forget about the brunch itself! Attendees are welcome to a delicious breakfast buffet (and new omelet bar) and refreshing drinks, adding to the festive atmosphere of the event. Whether you're a seasoned drag aficionado or new to the scene, Drag Me To Brunch is an experience like no other—a fabulous celebration of all things drag, where fun knows no bounds. IMPORTANT: After ALL tickets for your group have been purchased, please email with the requested information below to reserve a table to ensure your group is seated together via tim@ectgboston.com (Please note this is a family style seating show) STEP 1: Purchase tickets online (Tickets are for reserved seating/general admission) STEP 2: (One person from you party after all tickets are purchased) Email to reserve a table to ensure your group is seated together ( tim@ectgboston.com ) Please include the following information: 1. How many tickets do you have purchased and for which date? 2. What is a name for the reservation? 3. What is a contact number for the reservation? 4. What time did you want to come in? A few reminders: We open our doors at 11am and brunch is served from 11am-12:30pm; which is an additional $25 per person that is added to your tables tab the day of. Show starts at 12pm We will be sitting family style for this show. All seats subject to having a obstructed view. We cannot take more than two credit cards per party and can only split checks into two. No outside food or desserts can be served. Absolutely no decorations of any kind (i.e. balloons or party favors). We have a strict 48-hour refund policy for tickets. (Tickets cannot be transferred to different dates) Tipping the performers is customary; we have plenty of small bills for change. Our show is very interactive. If you do not wish to be included in the show (talked to, pulled on stage, or touched) ask for a glow necklace at check in. We are strictly 21+ Hosted by: Destiny Boston & Dee Dee de Ray",
        "event_link": "https://www.eventbrite.com/e/drag-me-to-brunch-8th-anniversary-show-may-4th-2025-tickets-1296292709389?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#drag",
            "#dragqueen",
            "#dragbrunch",
            "#dragqueens"
        ]
    },
    {
        "title": "6 ANNUAL MOTHER'S DAY GALA",
        "date_time": "Sunday, May 11 · 5:30 - 11:59pm EDT",
        "location": "Longwood Venue Destination 60 State Street 33 Floor Boston, MA 02109 Show map",
        "about": "**A NIGHT OF EXTRAORDINARY GLAMOUR: QUABIZION FOUNDATION’S MOTHER’S DAY GALA RETURNS TO TRANSFORM GILLETTE STADIUM INTO A BREATHTAKING SANCTUARY** In a notable celebration that has become the crown jewel of Boston’s social calendar, Quabizion Foundation announces its highly anticipated 6th Annual Mother’s Day Gala. On May 11th, the iconic Longwood 33rd floor  offering stunning views of downtown Boston's city lights and harbor will be transformed into a breathtaking sanctuary of elegance, where the nation’s most extraordinary tribute to motherhood will unfold. This distinguished black-tie affair has earned its reputation as a premier Mother’s Day celebration. Where luminaries, visionaries, and cherished members of society gather to honor the very essence of human compassion – our mothers. Each year, this remarkable event surpasses the one before it and 2025 promises an evening that will be etched in the memories of all who attend. Join us for an evening of unparalleled sophistication where gentlemen in refined tuxedos and ladies in sweeping floor-length gowns will grace the red carpet at 5:30 PM. This celebration of maternal love unfolds with exquisite hors d’oeuvres, captivating performances by KLASS, Rutshelle and an exclusive half-show of Heritage by Yole Derose, culminating in a masterfully crafted three-course dinner- all enhanced by the timeless elegance of our crystal-lit grand ballroom. This is more than a gala – it is a profound testament to the unwavering love, sacrifice, and grace of mothers who shape our world. Come indulge in an evening of distinguished elegance, heartfelt tributes, and the kind of magical moments that define generations. Where the World Unites to Honor Mothers – Because Some Celebrations Transcend Ordinary Grace For inquiries about this prestigious gathering, contact: Pelege Marcellin 774-688-5599",
        "event_link": "https://www.eventbrite.com/e/6-annual-mothers-day-gala-registration-1257174134679?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Galas",
            "Boston Arts Galas",
            "#boston",
            "#newengland",
            "#klass",
            "#foxboro",
            "#mothersday",
            "#gala_dinner",
            "#gala_event",
            "#rutshelle",
            "#mothersdaygala",
            "#yolederose"
        ]
    },
    {
        "title": "Hairy Butthole",
        "date_time": "Thursday, May 1 · 7 - 8:30pm EDT.Doors at 6:15pm",
        "location": "The Rockwell 255 Elm Street Somerville, MA 02144 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/hairy-butthole-tickets-1330266184969?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Performances",
            "Somerville Arts Performances",
            "#boston",
            "#comedy",
            "#drama",
            "#korean",
            "#night",
            "#somerville",
            "#memoir",
            "#soloshow"
        ]
    },
    {
        "title": "Drag Brunch @ Cunard Tavern",
        "date_time": "Saturday, May 10 · 10:30am - 2pm EDT.Doors at 5:30am",
        "location": "Cunard Tavern 24 Orleans Street Boston, MA 02128 Show map",
        "about": "Get Ready, East Boston—The Ultimate Drag Brunch is Coming May 10! 🎉🍳 Mark your calendars and bring your brunch besties because an amazing Drag Brunch is taking over Cunard Tavern on Saturday,May 10 —and you don’t want to miss it! This isn’t just brunch—it’s a dazzling, high-energy celebration packed with fierce drag performances, delicious food, and Absolut cocktails that’ll have you living your best life. 🍸✨ Doors open at 10:30 AM , so come early to sip on mimosas, enjoy Absolut drink specials, and snag the best seats in the house. Then, get ready for jaw-dropping performances and non-stop entertainment as the show kicks off at 11:30 AM ! 📍 Cunard Tavern | East Boston 🗓 Saturday, May 10! ⏰ Doors: 10:30 AM | Show: 11:30 AM Hosted by the fabulous Rocky , with show-stopping performances from Rose Quartz , Candace Persuasion , and Lakia Mondale ! Whether you’re here to slay, sip, or just soak up the vibes, this is the Drag Brunch event of the season. Tickets are flying, so grab yours now and get ready for a brunch experience that’s nothing short of legendary! 🥂✨",
        "event_link": "https://www.eventbrite.com/e/drag-brunch-cunard-tavern-tickets-1278625265589?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Arts Parties",
            "#brunch",
            "#drag",
            "#event",
            "#dragbrunch",
            "#cunard"
        ]
    },
    {
        "title": "The Magic Lab: Boston's Open Mic Magic Show",
        "date_time": "Starts on Thursday, May 1 · 7:30pm EDT",
        "location": "The Rozzie Square Theater 5 Basile Street #2501 Boston, MA 02131 Show map",
        "about": "The Magic Lab is a monthly magic show at the Rozzie Square Theater. Every month features five different incredible performers, experimenting with brand new magic! Be the first to see local acts, as well as guest stars from near and far.",
        "event_link": "https://www.eventbrite.com/e/the-magic-lab-bostons-open-mic-magic-show-tickets-1024988106017?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#boston",
            "#open_mic",
            "#magic_show",
            "#boston_magic_lab",
            "#boston_entertainment",
            "#boston_magic_show",
            "#the_magic_lab"
        ]
    },
    {
        "title": "Edie Tang Solo Art Show",
        "date_time": "Tuesday, May 6 · 6 - 8:30pm EDT",
        "location": "215 Charles St 215 Charles Street Boston, MA 02114 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/edie-tang-solo-art-show-tickets-1317677872989?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Arts Networking",
            "#art",
            "#creative",
            "#painting",
            "#artist",
            "#modernart",
            "#solo_artist",
            "#networking_event",
            "#art_show",
            "#gallery_exhibit",
            "#edie_tang"
        ]
    },
    {
        "title": "Punchlines in Paradise Standup Comedy Show",
        "date_time": "Sunday, April 27 · 5:30 - 7pm EDT.Doors at 4:30pm",
        "location": "Margaritaville - Boston 399 Faneuil Hall Square Boston, MA 02109 Show map",
        "about": "Punchlines in Paradise Standup Comedy Show Get ready to laugh until your sides hurt at our standup comedy show ! Join us for a night of non-stop laughs and good vibes in a laid-back island setting. Our lineup features some of the funniest comedians around, guaranteed to keep you entertained all night long. So grab your friends and get ready for a hilarious evening at Punchlines in Paradise! No item minimum, but please support the venue with a purchase! Date: Sunday April 27th Time: 5:30pm - 7pm Location: Margaritaville - Boston, 2nd Floor, 400 Faneuil Hall Marketplace, Boston, MA 02109 Don't miss out on the chance to have a great time and enjoy some comedy. See you there!",
        "event_link": "https://www.eventbrite.com/e/punchlines-in-paradise-standup-comedy-show-tickets-1300018232529?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#comedy",
            "#standup",
            "#show",
            "#laughing",
            "#comic",
            "#margaritaville",
            "#standupcomedyshow"
        ]
    },
    {
        "title": "BosTones Spring Concert",
        "date_time": "Sunday, April 27 · 6 - 8pm EDT",
        "location": "24 Cummington Mall 24 Cummington Mall Boston, MA 02215 Show map",
        "about": "Welcome to the BosTones Spring Concert ! Join us for a night of music and fun at 24 Cummington Mall . Get ready to groove to some amazing tunes and enjoy the talent of our talented performers. This is an in-person event, so make sure to mark your calendars and invite your friends for a memorable evening. Don't miss out on this opportunity to experience live music in a vibrant atmosphere. See you there!",
        "event_link": "https://www.eventbrite.com/e/bostones-spring-concert-tickets-1330437507399?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#concert",
            "#music",
            "#spring",
            "#harmony",
            "#bostonessingers"
        ]
    },
    {
        "title": "Drag Bingo @ The Comedy Studio Cambridge  (21+) • 5/4/25",
        "date_time": "Sunday, May 4 · 4 - 6pm EDT.Doors at 3pm",
        "location": "The Comedy Studio 5 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "ONE NIGHT ONLY! Limited seats! Hurry! SEATING BEGINS AT 3PM, AND ENDS AT 3:50PM. SHOWTIME 4-6PM No refunds unless cancelled due to weather or city-mandated curfew change. Arrive early, you - MUST - be seated 30 minutes prior to showtime. What to know before you go : * Ticket purchase is for comedy show admission. \"Bingo\" games are optional and FREE to play. To participate in bingo, request a card from your server. No cash prizes. No monetary value. No gambling. Play along, or just enjoy the comedy show! ** This event is 21+ only. *** Late arrivals (after the show has begun) will be turned away. **** Arrive early to find parking. You must be INSIDE and SEATED 30 minutes prior to showtime. ***** Tickets not redeemed by 10 minutes prior to show start will be sold to standby line. ****** If you become intoxicated or unruly, or refuse to abide by the guidelines, you will be asked to leave immediately. Absolutely no exceptions. Food & Drink : Enjoy a large variety of beer, cocktails, mocktails, wine, and small bites from The Comedy Studio. Important Information : READ CAREFULLY : When planning your arrival please account for travel time, finding parking either on-street or in localized lots, and checking in. The show must start on time – therefore YOU must arrive on time! Arriving late is an inconvenience to other guests who arrived on time, and the entertainer.",
        "event_link": "https://www.eventbrite.com/e/drag-bingo-the-comedy-studio-cambridge-21-5425-tickets-1302641920049?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#entertainment",
            "#boston",
            "#comedy",
            "#bingo",
            "#dragqueen",
            "#comedyshow",
            "#dragshow",
            "#bingonight",
            "#dragqueenshow",
            "#dragbingo"
        ]
    },
    {
        "title": "Side Quest Book Club: Swordheart",
        "date_time": "Tuesday, April 29 · 7 - 8:30pm EDT",
        "location": "Side Quest Books & Games 1 Bow Market Way Suite 32 Somerville, MA 02143 Show map",
        "about": "The delightful charm of The Princess Bride meets the delicious bodyguard romance of From Blood and Ash in this cozy fantasy romance from New York Times bestselling author T. Kingfisher . Halla has unexpectedly inherited the estate of a wealthy uncle. Unfortunately, she is also saddled with money-hungry relatives full of devious plans for how to wrest the inheritance away from her. While locked in her bedroom, Halla inspects the ancient sword that's been collecting dust on the wall since before she moved in. Out of desperation, she unsheathes it—and suddenly a man appears. His name is Sarkis, he tells her, and he is an immortal warrior trapped in a prison of enchanted steel. Sarkis is sworn to protect whoever wields the sword, and for Halla—a most unusual wielder—he finds himself fending off not grand armies and deadly assassins but instead everything from kindly-seeming bandits to roving inquisitors to her own in-laws. But as Halla and Sarkis grow closer, they overlook the biggest threat of all—the sword itself. ---------------- Tickets for this event are $5, which can be used as $5 credit towards a purchase at SQBG on the day. Side Quest Books & Games is located on the Bow Market balcony, in the back left corner. There is an elevator for accessibility in the lobby of Bow Market, to the right of the driveway when you first arrive. Masks are optional, but please let us know and stay home if you are ill. Outside food and drink are welcome.",
        "event_link": "https://www.eventbrite.com/e/side-quest-book-club-swordheart-tickets-1286469066609?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Parties",
            "Somerville Arts Parties",
            "#fantasy",
            "#bookclub",
            "#fantasybooks",
            "#sidequest"
        ]
    },
    {
        "title": "Art Battle Boston - May 16, 2025",
        "date_time": "Friday, May 16 · 7 - 10pm EDT",
        "location": "Lamplighter Brewing Co. - CX 110 North First Street Cambridge, MA 02141 Show map",
        "about": "Join us for an unforgettable evening of creativity and craft beer at Art Battle Boston! Hosted at Lamplighter CX , this vibrant venue is just a 2-minute walk from the Lechmere Green Line stop, making it easily accessible by public transit. Situated right off the community bike path and offering nearby parking options, it’s a convenient spot for everyone. With a spacious, modern setting and a capacity for 150 people, this event, brought to you by Art Battle, is your perfect midweek escape to enjoy local craft beer while witnessing incredible live art in action. This is a 21+ event. *Follow us on Instagram @ArtBattleBoston!",
        "event_link": "https://www.eventbrite.com/e/art-battle-boston-may-16-2025-tickets-1291853190669?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#art",
            "#culture",
            "#nightlife",
            "#live_art",
            "#live_painting",
            "#dj_music",
            "#art_battle"
        ]
    },
    {
        "title": "Comedy at The MIX",
        "date_time": "Tuesday, May 6 · 8 - 11:59pm EDT",
        "location": "555 Talbot Ave 555 Talbot Avenue Boston, MA 02124 Show map",
        "about": "Your cheeks 'bout to hurt from laughing too hard. We're turning Tuesday into the funniest night in Boston! Stand-up killers Good drinks Big laughs ZERO chill Bring your loudest laugh and your wildest friends — it's gonna be straight-up chaos (in the best way). Doors open at 6:30 PM Snag your spot before it's a wrap! Show starts at 8 PM RSVP now at levi@mixboston.com. First 50 guests get in FREE. Don't say we didn't warn you!",
        "event_link": "https://www.eventbrite.com/e/comedy-at-the-mix-tickets-1331413225799?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#comedy",
            "#funny",
            "#laughter",
            "#mix",
            "#stand_up"
        ]
    },
    {
        "title": "OPEN REHEARSAL | The RISE Tour",
        "date_time": "Tuesday, May 13 · 12:30 - 2:30pm EDT",
        "location": "Mass Motion Dance Boston 100 Holton Street Boston, MA 02135 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/open-rehearsal-the-rise-tour-tickets-1301291972319?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#music",
            "#performance",
            "#exclusive",
            "#open_rehearsal",
            "#the_rise_tour"
        ]
    },
    {
        "title": "It's A Queer Date - Boston's Hottest Comedy Dating Show at Club Cafe",
        "date_time": "Monday, May 12 · 7:30 - 9pm EDT.Doors at 6:30pm",
        "location": "Club Café 209 Columbus Avenue Boston, MA 02116 Show map",
        "about": "\"It's A Queer Date\" is New England's hottest comedy dating show where four singles take the stage blindfolded and let their charms do the seducing, while the audience throws in deep and spicy questions. Get ready for a night where laughter, mystery, and unexpected sparks collide. Here's how the show works: Before the show kicks off, attendees are invited to a quick mingle session, perfect for meeting new people or enjoying some laughs before the main event. Once the show begins, four singles, who apply ahead of time at the link HERE , take the stage blindfolded for a hilarious and unpredictable blind date, relying on smooth talk and quick wit to spark a connection. The audience fuels the heat by asking bold and flirty questions that nudge the four contestants to reveal their true selves. At the end of the night, the crowd votes to pick out one perfect match couple, who will win a second date outside of the show, planned and paid for by \"It's A Queer Date\" . Whether it’s steamy, hilarious, awkward or unexpectedly wholesome, \"It's A Queer Date\" guarantees a night of entertainment where romance and laughter ignite. Anything can happen—and who knows, love just might be in the air. LEGAL DISCLOSURE *By agreeing to purchase a ticket and/or attend the show, you hereby agree to It’s A Date, LLC’s (“It’s A Date”) appearance release and participation agreement. You will be granting It's A Date and all its subsidiaries permission to take motion and still pictures, record your voice and any sound made by you and to use the footage and materials in the development, production, distribution, advertising, and promotions of the show without any monetary compensation to you in perpetuity.",
        "event_link": "https://www.eventbrite.com/e/its-a-queer-date-bostons-hottest-comedy-dating-show-at-club-cafe-tickets-1303518381569?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Arts Parties",
            "#boston",
            "#comedy",
            "#lgbtq",
            "#queer",
            "#lgbtqia",
            "#datenight",
            "#comedynight",
            "#things_to_do",
            "#comedy_show"
        ]
    },
    {
        "title": "\"I HOPE THIS EMAIL FINDS YOU WELL\" Boston Comedy Showcase feat. Joe Fenti",
        "date_time": "Wednesday, April 30 · 8 - 11pm EDT",
        "location": "Trillium - Fort Point 50 Thomson Place Boston, MA 02210 Show map",
        "about": "Join us for a drink and a night of local standup comedy at Trillium Brewing in Seaport featuring some of Boston's finest standup comedians. Joe Fenti will be joined by Isabel Thurston and Garrett Finn for I HOPE THIS EMAIL FINDS YOU WELL , a comedy showcase with a 9-to-5 twist... Joe Fenti is a Boston-based stand-up comedian and content creator. He's also the founder and executive producer of Comedy Coop Standup—a pop-up standup comedy company. You can always find him on social media lampooning corporate nonsense and buzzwords. The party starts at 8pm Eastern and the show starts at 9pm. Grab your tickets today and we'll see you at Trillium. Powered by Dwight & Co., OSARO, IPR Robotics, and Manufacturing Happy Hour.",
        "event_link": "https://www.eventbrite.com/e/i-hope-this-email-finds-you-well-boston-comedy-showcase-feat-joe-fenti-tickets-1323670346639?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#email",
            "#hope",
            "#well",
            "#joe_fenti",
            "#boston_comedy_showcase"
        ]
    },
    {
        "title": "Kingdom Drag King Showcase",
        "date_time": "Friday, May 2 · 8 - 10pm EDT",
        "location": "The Foundry 101 Rogers Street Cambridge, MA 02142 Show map",
        "about": "Welcome to the Kingdom Drag King Showcase! The legacy of the Kingdom lives on as class #10 makes their stage debuts! Whether you're  new to drag kings or beloved family, be prepared to be wowed with sexiness and utter creativity.  Alongside  these 10 new drag kings, the cast will also joined by Slick O'Connell, Cyrus K. Stratton, Flash Flood (a Class 6 graduate), and Daddy Jamison.  18+ show",
        "event_link": "https://www.eventbrite.com/e/kingdom-drag-king-showcase-tickets-1301379805029",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#drag",
            "#event",
            "#showcase",
            "#king",
            "#kingdom"
        ]
    },
    {
        "title": "Концерт памяти Ю. Визбора в Бостоне.",
        "date_time": "Starts on Thursday, May 1 · 8pm EDT",
        "location": "John Hancock Hall 180 Berkeley Street Boston, MA 02116 Show map",
        "about": "На сцене будут выступать Вениамин Смехов, Сергей Никитин, Алексей и Мария Иващенко, Дмитрий Богданов, Тимур Шаов, Галина и Алексей Хомчики, Артем Лысков и музыканты джазового трио Stellar! Билеты без комиссии так же можно заказать по телефону 617-232-8820. «Разрешите вам напомнить о себе» – так мы назвали добрую беседу с близкими людьми, которые соберутся в этот вечер вместе на сцене и в зале. Мы будем рассказывать друг другу истории, написанные Юрием Визбором, как он рассказывал их сам. Под гитару, но не только. Визбор не был бунтарем, как Высоцкий, или философом, как Окуджава. Скорее как Синатра, певец обычного человеческого существования, наполненного дружбой, добротой и романтикой. Прошлым летом ему исполнилось 90. А в 50 он ушел в лыжной куртке и шапке с помпоном к своим далеким вершинам, оставив нам песни, чтобы не забывали. Мы и не забываем, поем. Заходите вечером в гости, берите с собой друзей и родных. Давайте проведем эти три часа вместе, споем его песни, поговорим, отметим его юбилей. Искренне ваши, Вениамин Смехов, Сергей Никитин, Алексей и Мария Иващенко, Дмитрий Богданов, Тимур Шаов, Галина и Алексей Хомчики, Артем Лысков и музыканты джазового трио Stellar.",
        "event_link": "https://www.eventbrite.com/e/1261646772459",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#concert",
            "#boston",
            "#event",
            "#memory",
            "#y_vizbor"
        ]
    },
    {
        "title": "FFF Spring Drag Show - Catwalking on Sunshine",
        "date_time": "Thursday, May 8 · 7 - 10pm EDT",
        "location": "Venu Nightclub 100 Warrenton Street Boston, MA 02116 Show map",
        "about": "FLAG Flag Football invites you to our Annual Spring Drag Show on Thursday, May 8th at Venu Nightclub. This even is a fundraiser for Gay Bowl 2025 in sunny San Diego and this year's theme is Catwalking on Sunshine! If you're interested in Performing or Pit Crew, sign up: forms.gle/33Qkkgp8BW7Cq1re9 This event is 21+ but aside from the age restriction, all are welcome! Please note there is a set capacity in the space so ticket prices may increase in the days/weeks leading up to the show and we are expecting to sell out. The venue is located on the second floor with a flight of stairs to enter the space from ground level, there unfortunately is not an elevator onsite. During the event there will be loud music and moving lights. Any questions, please contact events@flagflagfootball.com We look forward to seeing you there!",
        "event_link": "https://www.eventbrite.com/e/fff-spring-drag-show-catwalking-on-sunshine-tickets-1271778607049",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#music",
            "#party",
            "#entertainment",
            "#drag",
            "#football",
            "#gay",
            "#lgbtq",
            "#fundraiser",
            "#performance",
            "#dragshow"
        ]
    },
    {
        "title": "Drag Me To Brunch 8th Anniversary Show - May 4th, 2025",
        "date_time": "Sunday, May 4 · 12 - 2pm EDT",
        "location": "Carrie Nation Cocktail Club 11 Beacon Street Boston, MA 02108 Show map",
        "about": "The event is going to be a vibrant extravaganza, showcasing the best of drag culture and entertainment. From jaw-dropping performances to fabulous costumes, the show is a feast for the senses. Attendees will be treated to a whirlwind of performances by some of Boston’s most talented drag queens in the business. Each act is filled with energy, humor, and impeccable lip-syncing, captivating the audience from start to finish. From classic diva numbers to contemporary pop hits to group numbers, there is something for everyone to enjoy. But Drag Me to Brunch is more than just a showcase of talent; it's a celebration of diversity, self-expression, and acceptance. The atmosphere is electric, filled with love, support, and a sense of community. It's a place where people can come together to celebrate their differences and revel in the joy of being themselves. And let's not forget about the brunch itself! Attendees are welcome to a delicious breakfast buffet (and new omelet bar) and refreshing drinks, adding to the festive atmosphere of the event. Whether you're a seasoned drag aficionado or new to the scene, Drag Me To Brunch is an experience like no other—a fabulous celebration of all things drag, where fun knows no bounds. IMPORTANT: After ALL tickets for your group have been purchased, please email with the requested information below to reserve a table to ensure your group is seated together via tim@ectgboston.com (Please note this is a family style seating show) STEP 1: Purchase tickets online (Tickets are for reserved seating/general admission) STEP 2: (One person from you party after all tickets are purchased) Email to reserve a table to ensure your group is seated together ( tim@ectgboston.com ) Please include the following information: 1. How many tickets do you have purchased and for which date? 2. What is a name for the reservation? 3. What is a contact number for the reservation? 4. What time did you want to come in? A few reminders: We open our doors at 11am and brunch is served from 11am-12:30pm; which is an additional $25 per person that is added to your tables tab the day of. Show starts at 12pm We will be sitting family style for this show. All seats subject to having a obstructed view. We cannot take more than two credit cards per party and can only split checks into two. No outside food or desserts can be served. Absolutely no decorations of any kind (i.e. balloons or party favors). We have a strict 48-hour refund policy for tickets. (Tickets cannot be transferred to different dates) Tipping the performers is customary; we have plenty of small bills for change. Our show is very interactive. If you do not wish to be included in the show (talked to, pulled on stage, or touched) ask for a glow necklace at check in. We are strictly 21+ Hosted by: Destiny Boston & Dee Dee de Ray",
        "event_link": "https://www.eventbrite.com/e/drag-me-to-brunch-8th-anniversary-show-may-4th-2025-tickets-1296292709389",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#drag",
            "#dragqueen",
            "#dragbrunch",
            "#dragqueens"
        ]
    },
    {
        "title": "Keila Wakao Plays Barber",
        "date_time": "Sunday, April 27 · 3:30 - 5:30pm EDT",
        "location": "First Church in Cambridge 11 Garden Street Cambridge, MA 02138 Show map",
        "about": "First prize winner of both the Menuhin International Violin Competition and the Stulburg International String Competition, Keila Wakao is a Boston native currently attending the New England Conservatory of Music. She has performed concertos with orchestras across the United States including the Boston Symphony Orchestra, the Chattanooga Symphony Orchestra, the Eugene Symphony, the Richmond Symphony, the Kalamazoo Symphony Orchestra, the Lexington Symphony, the Baltimore Chamber Orchestra, and many more. She returns to the Apollo Ensemble to perform Barber's Violin Concerto on a program that also features the world premiere of Gala Flagello's Droughts and Downpours for string orchestra and Brahms' 3rd Symphony. The Apollo Ensemble of Boston Elias Miller, Music Director Program: Gala Flagello – Droughts and Downpours (*World Premiere*) Brahms – Symphony No. 3 in F major ~Intermission~ Barber – Violin Concerto (Keila Wakao, Violin) Where: First Church Cambridge 11 Garden Street, Cambridge, Massachusetts 02138 When: April 27th, 2025 at 3:30PM",
        "event_link": "https://www.eventbrite.com/e/keila-wakao-plays-barber-tickets-1049785746427",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#performance",
            "#orchestra",
            "#symphony",
            "#concerto",
            "#livemusic",
            "#musician",
            "#brahms",
            "#classicalmusic",
            "#free_event",
            "#classical_music"
        ]
    },
    {
        "title": "Hush Harbor: Ifé Franklin and DZIDZOR",
        "date_time": "Sunday, April 27 · 4 - 6pm EDT",
        "location": "St. Augustine's African Orthodox Church 137 Allston Street Cambridge, MA 02139 Show map",
        "about": "Hush harbors were secret meeting places where in enslaved African-Americans would gather to worship, socialize, and maintain Cultural traditions outside of the ever watchful eyes of white society. Ifé Franklin and Dzidzor with support from community members will activate the sanctuary of Saint Augustine African Orthodox Church, creating a space for folks to gather, sing, shout, moan and move and share joy! We need these safe space more than ever for our collective healing, hope and liberation. Participants are welcome to bring an instrument, your voice, to move, dance, or sit in space together. This special event is tailored specially for a participatory audience of Black, Indigenous and people of color (BIPOC) only, as BHAC creates a safe harbor in a challenging time. Our following events are open to all. This event will be followed by a social time including refreshments.",
        "event_link": "https://www.eventbrite.com/e/hush-harbor-ife-franklin-and-dzidzor-tickets-1317752405919",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#event",
            "#performance",
            "#bipoc",
            "#dzidzor",
            "#hush_harbor",
            "#ife_franklin"
        ]
    },
    {
        "title": "Punchlines in Paradise Standup Comedy Show",
        "date_time": "Sunday, April 27 · 5:30 - 7pm EDT.Doors at 4:30pm",
        "location": "Margaritaville - Boston 399 Faneuil Hall Square Boston, MA 02109 Show map",
        "about": "Punchlines in Paradise Standup Comedy Show Get ready to laugh until your sides hurt at our standup comedy show ! Join us for a night of non-stop laughs and good vibes in a laid-back island setting. Our lineup features some of the funniest comedians around, guaranteed to keep you entertained all night long. So grab your friends and get ready for a hilarious evening at Punchlines in Paradise! No item minimum, but please support the venue with a purchase! Date: Sunday April 27th Time: 5:30pm - 7pm Location: Margaritaville - Boston, 2nd Floor, 400 Faneuil Hall Marketplace, Boston, MA 02109 Don't miss out on the chance to have a great time and enjoy some comedy. See you there!",
        "event_link": "https://www.eventbrite.com/e/punchlines-in-paradise-standup-comedy-show-tickets-1300018232529",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#comedy",
            "#standup",
            "#show",
            "#laughing",
            "#comic",
            "#margaritaville",
            "#standupcomedyshow"
        ]
    },
    {
        "title": "BosTones Spring Concert",
        "date_time": "Sunday, April 27 · 6 - 8pm EDT",
        "location": "24 Cummington Mall 24 Cummington Mall Boston, MA 02215 Show map",
        "about": "Welcome to the BosTones Spring Concert ! Join us for a night of music and fun at 24 Cummington Mall . Get ready to groove to some amazing tunes and enjoy the talent of our talented performers. This is an in-person event, so make sure to mark your calendars and invite your friends for a memorable evening. Don't miss out on this opportunity to experience live music in a vibrant atmosphere. See you there!",
        "event_link": "https://www.eventbrite.com/e/bostones-spring-concert-tickets-1330437507399",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#concert",
            "#music",
            "#spring",
            "#harmony",
            "#bostonessingers"
        ]
    },
    {
        "title": "NEPATHYA LIVE IN BOSTON",
        "date_time": "Wednesday, June 11 · 7 - 11pm EDT",
        "location": "Royale 279 Tremont Street Boston, MA 02116 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/nepathya-live-in-boston-tickets-1301924273549?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#concert",
            "#music",
            "#boston",
            "#live_performance",
            "#nepathya_live"
        ]
    },
    {
        "title": "NightinGALA: Renaissance Reimagined",
        "date_time": "Saturday, May 3 · 7 - 9:30pm EDT",
        "location": "Old South Church in Boston 645 Boylston Street Boston, MA 02116 Show map",
        "about": "RENAISSANCE REIMAGINED May 3rd, 7pm - Old South Church, Gordon Chapel, Boston Have you ever wondered what it would be like if Nightingale had existed 400 years ago? Come and find out by joining us for this year’s NightinGALA: Renaissance Reimagined, a performance of new compositions based on early sources paired directly with the pieces that informed them. Inspired by Roderick Williams’ Ave Verum Corpus (Reimagined), an inventive reworking of the Byrd classic, the concert will feature premieres by Nightingale composers Nathan Halbur, Kelvyn Koning, and Ben Perry, as well as contemporary compositions by Kerensa Briggs, Caroline Shaw, and local composer Richard J Clark all showcased alongside works of the Renaissance greats. Join us for food, drink, a silent auction, and a concert you won’t soon forget! Project Produced by Elijah Botkin and Bobbie Hill.",
        "event_link": "https://www.eventbrite.com/e/nightingala-renaissance-reimagined-tickets-991498447547?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Galas",
            "Boston Arts Galas",
            "#food",
            "#concert",
            "#boston",
            "#gala",
            "#classical",
            "#renaissance",
            "#polyphony",
            "#reimagined",
            "#historical_tour",
            "#nightingala"
        ]
    },
    {
        "title": "JOEY VOICES LIVE WITH  COMEDIANS MIKEY V., SEAN O'BRIEN JR. & JODY SLOANE!",
        "date_time": "Saturday, May 3 · 7 - 10pm EDT.Doors at 6:30pm",
        "location": "Regent Theatre 7 Medford Street Arlington, MA 02474 Show map",
        "about": "BACK BY POPULAR DEMAND… IT’S JOEY VOICES LIVE! The ONE and ONLY MASTER IMPRESSIONIST COMEDIAN on the East Coast is bringing the laughter, the music, and the iconic voices straight to you! Get ready for a comedy experience like no other as Joey Voices channels legends like Sinatra , Elvis , Cher , Tony Bennett , Tom Jones , and more in a show packed with laughs, sing-along-tunes, and wild moments! 🎤🔥 THIS IS NOT YOUR TYPICAL COMEDY NIGHT! Prepare for a rollercoaster of spot-on impressions and unexpected hilarity as Joey brings your favorite stars back to life—You won’t believe your ears! Hosted by the hilarious MIKEY V —and with special comedian guests JODY SLOANE and SEAN O’BRIEN JR. —this night is packed with comedy gold, surprises, and a non-stop laugh-fest. It’s like a comedy concert! THE BOSTON COMEDY SHOW is proud to present JOEY VOICES LIVE! for ONE NIGHT ONLY at The Regent Theatre —and trust us, it’s going to be a comedy extravaganza! Don’t wait get your tickets now—be part of the action, grab your tickets before they’re gone!",
        "event_link": "https://www.eventbrite.com/e/joey-voices-live-with-comedians-mikey-v-sean-obrien-jr-jody-sloane-tickets-1248649938579?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Arlington, MA",
            "Arlington Performances",
            "Arlington Arts Performances",
            "#event",
            "#joeyvoiceslive",
            "#mijeyv",
            "#seanobrienjr",
            "#jodysloane"
        ]
    },
    {
        "title": "Meet Me at the Ballpit: A Tumblr-themed Drag Show",
        "date_time": "Sunday, May 4 · 2 - 4pm EDT.Doors at 1pm",
        "location": "Jacques' Cabaret 79 Broadway Street Boston, MA 02116 Show map",
        "about": "From the incredibly brainrotted team that brought you Anislay: An Anime Themed Drag Show comes a (somehow) even more terminally online creation to bring you back to your blue-background glory days, and ask the really important questions: Who’s your real OTP? Do you know the color of the sky? Who’s the real Tumblr sexyman: The Onceler, or Nagito Komaeda? Where did you get your shoelaces? How long can naughty children survive in The Pear Wiggler? Whatever happened to Jorie’s three weed smoking girlfriends? We’re hosting two whole hours of the greatest cringe-overload throwback drag & burlesque content we could possibly dig up that still complies with the content guidelines (no female-presenting nipples!) at the Jacques’ Cabaret main stage on Sunday, May the Fourth (be with you!) from 2-4pm .",
        "event_link": "https://www.eventbrite.com/e/meet-me-at-the-ballpit-a-tumblr-themed-drag-show-tickets-1307521214149?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#boston",
            "#burlesque",
            "#millennial",
            "#nerdy",
            "#cringe",
            "#tumblr",
            "#ballpit",
            "#drag_show"
        ]
    },
    {
        "title": "Lizard Lounge Poetry Jam Slam Team Final",
        "date_time": "Sunday, April 27 · 7 - 11pm EDT",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "This is the culmination of our yearly “slam-off” to select the 2025 Lizard Lounge Poetry Jam Slam Team. The eight finalists (the top four finishers from each of our two previous semi-final slams) competing in tonight’s slam are Art Collins, Christopher Johnson, Daniel Letona, Finn Flood, Mike Savadian, Silent E, Warrior, and Will C. The slam team will represent Lizard Lounge at local and regional events throughout the year. Not to be missed, this event featuring the best of the best, often sells out—reserve your tickets now! Lizard Lounge Poetry Jam",
        "event_link": "https://www.eventbrite.com/e/lizard-lounge-poetry-jam-slam-team-final-tickets-1280754092969?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#poetry",
            "#spokenword",
            "#poetryslam",
            "#cambridgeevents",
            "#harvardsquare",
            "#poetry_jam",
            "#lizardlounge",
            "#cambridgemass",
            "#lizardloungepoetryjam"
        ]
    },
    {
        "title": "Queer Comedy Night @ Satellite",
        "date_time": "Wednesday, April 30 · 8:30 - 9:30pm EDT.Doors at 7:30pm",
        "location": "Remnant Satellite - Cafe 877 Cambridge Street Cambridge, MA 02141 Show map",
        "about": "LGBTQ+ cuties do it better. Featuring Boston's hottest and most hilarious talent, Queer Comedy Night combines community-favorites, incredible food , and craft beer. You'll see stand-up, musical comedy, and performances that leave your stomach hurting from laughing; only for $10. The Remnant Brewing Satellite will be pouring beers , serving sandwiches , and stirring cocktails all night long! Brought to you by Hannah McEachern and Fool's Freedom , we're ready to give you an unforgettable night. Queer Comedy Night is short walk from the Green Line and street parking is widely available on Cambridge Street.",
        "event_link": "https://www.eventbrite.com/e/queer-comedy-night-satellite-tickets-1306066041689?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#food",
            "#lgbtq",
            "#queer",
            "#craftbeer",
            "#local",
            "#satellite",
            "#girlsnightout",
            "#stand_up",
            "#queer_comedy_night"
        ]
    },
    {
        "title": "It's A Date -  Boston’s Hottest Comedy Dating Show at Aeronaut Brewing",
        "date_time": "Monday, April 28 · 7 - 9pm EDT.Doors at 2pm",
        "location": "Aeronaut Brewing Company 14 Tyler Street Somerville, MA 02143 Show map",
        "about": "DOOR: 7PM SHOW: 7:30PM - 9PM \"It's A Date\" is New England's hottest comedy dating show where four singles take the stage blindfolded and let their charms do the seducing, while the audience throws in deep and spicy questions. Get ready for a night where laughter, mystery, and unexpected sparks collide. Here's how it works: Before the show kicks off, attendees are invited to a quick mingle session, perfect for meeting new people or enjoying some laughs before the main event. Once the show begins, four singles, who apply ahead of time at the link HERE , take the stage blindfolded for a hilarious and unpredictable blind date, relying on smooth talk and quick wit to spark a connection. The audience fuels the heat by asking bold and flirty questions that nudge the four contestants to reveal their true selves. At the end of the night, the crowd votes to pick out one perfect match couple, who will win a second date outside of the show, planned and paid for by \"It's A Date\" . Whether it’s steamy, hilarious, awkward or unexpectedly wholesome, \"It's A Date\" guarantees a night of entertainment where romance and laughter ignite. Anything can happen—and who knows, love just might be in the air. LEGAL DISCLOSURE *By agreeing to purchase a ticket and/or attend the show, you hereby agree to It’s A Date, LLC’s (“It’s A Date”) appearance release and participation agreement. You will be granting It's A Date and all its subsidiaries permission to take motion and still pictures, record your voice and any sound made by you and to use the footage and materials in the development, production, distribution, advertising, and promotions of the show without any monetary compensation to you in perpetuity.",
        "event_link": "https://www.eventbrite.com/e/its-a-date-bostons-hottest-comedy-dating-show-at-aeronaut-brewing-tickets-1318852847369?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Performances",
            "Somerville Arts Performances",
            "#boston",
            "#comedy",
            "#cambridge",
            "#activity",
            "#thingstodo",
            "#datenight",
            "#somerville",
            "#comedyshow",
            "#things_to_do"
        ]
    },
    {
        "title": "Comedy Night! Rami Abushhab: Let's Talk About it",
        "date_time": "Saturday, May 10 · 8 - 10pm EDT",
        "location": "Boston Liberation Center 194 Blue Hill Avenue Boston, MA 02119 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/comedy-night-rami-abushhab-lets-talk-about-it-tickets-1330164290199?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#comedy",
            "#event",
            "#funny",
            "#arabic",
            "#palestine",
            "#arab",
            "#comedy_show",
            "#comedy_night",
            "#lets_talk_about_it",
            "#rami_abushhab"
        ]
    },
    {
        "title": "aMaSSiT Pitch Session Showings",
        "date_time": "Sunday, May 4 · 7 - 8:30pm EDT.Doors at 6:30pm",
        "location": "The Dance Complex 536 Massachusetts Avenue Cambridge, MA 02139 Show map",
        "about": "About the Pitch Sessions: aMaSSiT presents works in progress by local choreographers through pitch sessions designed to propel them further towards realizing their ambitious dance creations. The pitch session allows the artist to give more information about their aspirations for the project, and outline what they might need to bring their creation into its next phase. Participating artists: Lindsay Gibbons Katherine Marotta Bridget Nicolo Anugraha Raman Alexis Tsiramanes One of the central questions connecting this year's aMaSSiT cohort is \" how do I create dance projects that allow me to integrate my whole self? \". Consequently, these artists are developing creative pitches at the intersection of science, health, and their embodied realities. Join us to see what they have been up to, and through your feedback help some form the future of these works. About the aMaSSiT program: aMaSSiT (a M ake it S hare it, S how it lab) is an artist's next deep step in identifying and articulating their unique choreographic voice. The Dance Complex’s aMaSSiT Choreography Lab has evolved to an in-depth curriculum focusing on choreographic tool building and best artistic business practices. This unique program, open to creators in all dance genres, is structured to both foster those early in their careers and to deeply challenge more experienced artists. The 2025 season of aMaSSiT, a collaboration between The Dance Complex and Monkeyhouse , develops tools for building momentum to transform an idea into a larger project. --- The ground level lobby and second floor performance space are ADA compliant. There is a motorized lift that can bring one person at a time from the ground floor to the second floor should a guest wish to use it. There is no elevator. Gender-neutral accessible bathrooms are located on both the ground and second-floor levels of the building.",
        "event_link": "https://www.eventbrite.com/e/amassit-pitch-session-showings-tickets-1325346159039?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#dance",
            "#cambridge",
            "#choreography",
            "#pitchevent",
            "#newworks"
        ]
    },
    {
        "title": "The 'Bury Funny Stand-Up Comedy Fundraiser 2025",
        "date_time": "Friday, May 9 · 8 - 10:30pm EDT",
        "location": "Hibernian Hall 184 Dudley Street #200 Boston, MA 02119 Show map",
        "about": "The ' Bury Funny Stand-Up Comedy Fundraiser 2025 ' brings hilarious comedians to Boston for a great cause. Get ready to LOL! Join us for a night of laughter and hilarity at Bury Funny Stand-Up Comedy Fundraiser 2025! 🤣🎤 📅 Date: May 9, 2025 🕢 Time: 8:00 PM 📍 Location: Hibernian Hall Featuring a stellar lineup of comedians guaranteed to tickle your funny bone: TBA This event is not to be missed! 😆 Grab your tickets now at: https://buryfunny2025.eventbrite.com Tag your friends and let them know - it's going to be a side-splitting evening of comedy! 🤣👏 #BuryFunny2024 #ComedyNight #StandUpComedy #LaughsGuaranteed #Boston #Roxbury #dudleysquare SPONSORS/ SUPPORTERS: Contact us to learn how you can become a sponsor or support. ROXBURY MAIN STREETS BOARD OF DIRECTORS ● Haris Hardaway - President ● Richard Taylor - Vice President ● Norvia Peña - Secretary ● Carlos Castillo - Treasurer --- Ronnette Taylor Brian Keith Solmon Chowdhury William Watkins Ted Lewis Monica Dean Kamran Zahedi Toy Burton Ella Howard Misha Thomas Kai Phillip Angela Yard Danielle English Jimmeeka Harris Brandon Ransom",
        "event_link": "https://www.eventbrite.com/e/the-bury-funny-stand-up-comedy-fundraiser-2025-tickets-1259967670219?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances"
        ]
    },
    {
        "title": "Paint Nite w/ Lydia Jane",
        "date_time": "Saturday, May 3 · 2 - 4pm EDT",
        "location": "Fenway Community Center 1282 Boylston Street #123 Boston, MA 02215 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/paint-nite-w-lydia-jane-tickets-1334593307509?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Arts Classes",
            "#paint_nite",
            "#sip_and_paint",
            "#creative_fun",
            "#artistic_experience",
            "#lydia_jane"
        ]
    },
    {
        "title": "Spring into Comedy! A show dedicated to women and femmes",
        "date_time": "Friday, May 16 · 8:30 - 10:30pm EDT",
        "location": "Somerville Music Spaces 1060 Broadway #C101B Somerville, MA 02144 Show map",
        "about": "This will be a night you won't want to miss! There'll be improv, sketch, stand up, and a jam all brought to you by your favorite women and femme comedians in the Boston area! Grab your ticket while you can!",
        "event_link": "https://www.eventbrite.com/e/spring-into-comedy-a-show-dedicated-to-women-and-femmes-tickets-1296128558409?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Performances",
            "Somerville Arts Performances",
            "#event",
            "#show",
            "#dedicated",
            "#women_and_femmes",
            "#spring_into_comedy"
        ]
    },
    {
        "title": "Zoe Ho and Co “One Night Only”",
        "date_time": "Monday, May 5 · 8 - 9:30pm EDT.Doors at 7pm",
        "location": "Jacques' Cabaret 79 Broadway Street Boston, MA 02116 Show map",
        "about": "Zoe Ho and Co “One Night Only” Come join us for a night of unforgettable performances by Zoe Ho and her talented crew at Jacques' Cabaret ! Get ready to be wowed by their amazing acts and incredible energy. This in-person event is a rare opportunity to witness their magic up close. Don't miss out on this one-of-a-kind experience!",
        "event_link": "https://www.eventbrite.com/e/zoe-ho-and-co-one-night-only-tickets-1264669493499?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#night",
            "#one",
            "#zoe",
            "#only",
            "#ho"
        ]
    },
    {
        "title": "AYĖL | Christos Metaxas | LEAH",
        "date_time": "May 3 · 10pm - May 4 · 1am EDT",
        "location": "The Lilypad 1353 Cambridge Street Cambridge, MA 02139 Show map",
        "about": "AYĖL | Christos Metaxas | LEAH Join us for an electrifying night of music at The Lilypad ! Experience the soulful sounds of AYĖL, the mesmerizing vocals of Christos Metaxas, and the captivating performance by LEAH. This in-person event promises to be a night to remember, filled with incredible talent and unforgettable melodies. Don't miss out on this unique opportunity to enjoy live music in a cozy and intimate setting. Grab your tickets now and get ready for a magical evening!",
        "event_link": "https://www.eventbrite.com/e/ayel-christos-metaxas-leah-tickets-1326053725389?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Appearances",
            "Cambridge Arts Appearances",
            "#music",
            "#summer",
            "#event",
            "#singer",
            "#livemusic",
            "#eventbrite",
            "#live_performance",
            "#music_event"
        ]
    },
    {
        "title": "Speak Easy Drag Brunch",
        "date_time": "Sunday, April 27 · 1 - 3pm EDT",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "Doors 12 Show 1 What do wigs, eggs benedict, pop mixes & mimosas have in common? They'll all be in the Lizard Lounge the last Sunday of every month! We're hosting our very own Drag Brunch, an iconic afternoon of performances from some of our favorite local drag queens scrumptious brunch favorites & fun cocktails! 21+ Doors lock once show starts General Admission $20, with bar stools first come first serve Tables for $45, comfortably seats 2 guests",
        "event_link": "https://www.eventbrite.com/e/speak-easy-drag-brunch-tickets-1313176649709?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Arts Parties",
            "#drag",
            "#dragbrunch",
            "#dragqueens",
            "#cambridgeevents",
            "#drag_brunch",
            "#harvardsquare",
            "#fun_times",
            "#lizardlounge",
            "#cambridgemass"
        ]
    },
    {
        "title": "Star Whores Episode II: They/Thempire Claps Back",
        "date_time": "Sunday, May 4 · 6:30 - 9pm EDT",
        "location": "Jacques' Cabaret 79 Broadway Street Boston, MA 02116 Show map",
        "about": "Star Whores Episode II: They/Thempire Claps Back Hosted by Chito Experience the spiciest Star Wars drag show on Sunday, May the Fourth. Come watch some of your favorite characters in an exciting and sultry spectacle this year with an incredible ensemble of creatures from all corners of the galaxy. Join us in the historic town of Bostooine at Mos Jacques Cantina and nerd out with us! Featuring: BRAE THE FALLEN CECE KNIGHT JONES DULCE DE LEATHER LINDA MARIPOSSA PATTY BOURRÉE RUSTY HAMMER VON VOID Showtime Details: Doors 6:30pm Show 7:00pm Located at Jacque's Cabret cash bar||21+ ATM on-site",
        "event_link": "https://www.eventbrite.com/e/star-whores-episode-ii-theythempire-claps-back-tickets-1312782380439?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#drag",
            "#event",
            "#performance",
            "#dragshow",
            "#starwars",
            "#starwhores"
        ]
    },
    {
        "title": "Artisan’s Asylum Speaker Series: Chris Fitch",
        "date_time": "Tuesday, May 13 · 7 - 8:30pm EDT",
        "location": "Artisan's Asylum 96 Holton Street Boston, MA 02135 Show map",
        "about": "What is “elegance” in mechanical design? As a subjective concept, is it relevant to a field normally focused on technical matters? And if so, how is it embodied in a kinetic object? In this talk, Chris attempts to answer what constitutes an “elegant” design solution to a mechanical problem and why it’s important (to him, anyway). Chris Fitch is a sculptor, engineer and inventor. His prize-winning mechanical sculptures, installations and performance-based artwork have been presented internationally. His puppets and state-of-the art miniature theaters have appeared with major symphony productions in Berlin, London, New York and Los Angeles. His credits for work in animation include Sesame Street, Motorola, Disneyland, and Samsung. Further projects have included the design of a toy factory, independent invention, a tree house bed and breakfast inn in the Philippines, and the development of workshops about kinematics, motion as medium, and foam latex stop motion puppetry. These days he designs industrial robots. More information can be found at www.chrisfitchsculpture.com .",
        "event_link": "https://www.eventbrite.com/e/artisans-asylum-speaker-series-chris-fitch-tickets-1307391897359?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Arts Networking",
            "#makers",
            "#artists",
            "#makerspace",
            "#speaker",
            "#artisttalk",
            "#speakerseries",
            "#artist_talk",
            "#speakers_networking"
        ]
    },
    {
        "title": "Broadway Supper Club",
        "date_time": "Friday, May 9 · 7 - 9pm EDT.Doors at 5pm",
        "location": "Premiere on Broadway 517 Broadway Somerville, MA 02145 Show map",
        "about": "Enjoy live performances of your favorite Broadway show tunes, from timeless classics to contemporary hits featuring a cast of seasoned performers who, combined, have appeared in numerous Broadway National Touring productions, and featured in theaters across New England and around the country.  “Broadway Supper Club” is the perfect show for an entertaining night that celebrates the magic of Broadway. The cast includes Morgan Billings Smith, Marissa Miller, Peter Romagna, and special guest Meryl Galaid. We’re thrilled to welcome New England favorite Meryl Galaid to the show! An accomplished performer with a career spanning over 35 years, Meryl has graced stages all across New England, bringing her sharp comic timing and powerful vocals to audiences far and wide. A proud mom and grandmother, Meryl brings warmth, wit, and a lifetime of performance experience to our special performance of Broadway Supper Club. A seasoned cabaret artist, Meryl offers a heartfelt connection to every performance, drawing audiences in with her charm and unwavering talent.",
        "event_link": "https://www.eventbrite.com/e/broadway-supper-club-tickets-1209068639849?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Performances",
            "Somerville Arts Performances",
            "#theater",
            "#concert",
            "#cabaret",
            "#singing",
            "#theatre",
            "#broadway"
        ]
    },
    {
        "title": "Draft Picks Stand-Up Comedy",
        "date_time": "Tuesday, May 13 · 7:30 - 9:30pm EDT.Doors at 7pm",
        "location": "Winter Hill Brewing Company 328 Broadway Somerville, MA 02145 Show map",
        "about": "The all-star lineup includes Janet McNamara, Gary James, Alan Moreau, Amma Marfo, and Sky Nockels. Hosted by Kaitlin Buckley. Catch some top prospects from New England’s comedy scene before they’re traded to NY or LA!",
        "event_link": "https://www.eventbrite.com/e/draft-picks-stand-up-comedy-tickets-1304368755059?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Performances",
            "Somerville Arts Performances",
            "#comedy",
            "#datenight",
            "#standupcomedy",
            "#livecomedy",
            "#bostoncomedy",
            "#stand_up_comedy",
            "#comedy_show",
            "#boston_events",
            "#beer_events"
        ]
    },
    {
        "title": "Summer Kickoff (your boots) Workshop and Competition",
        "date_time": "Saturday, May 31 · 2 - 11pm EDT.Doors at 1:50pm",
        "location": "Rumba Y Timbal Dance Company 7 Temple Street Cambridge, MA 02139 Show map",
        "about": "Summer Kickoff (Your Boots) Country Swing & Line Dance Competition | Workshop + Social Dance Kick off the summer with a full day of dancing, learning, and friendly competition. Blackout Country Dancing presents Summer Kickoff (Your Boots)—a one-day event featuring workshops, competitions, and a social dance designed to bring the community together and set the tone for the season. Start the day with a workshop focused on standing out in your dance. Whether new to the dance floor or looking to sharpen your skills, you'll walk away with tools to elevate your dancing. Our line dance and country swing competitions offer an opportunity to challenge yourself, showcase your style, and connect with other dancers. The evening will close with a social dance open to all, where you can unwind, dance with new friends, and enjoy the start of summer. Please note: A full day pass or evening pass is required in order to compete. Competition entries are sold separately and can be added on during checkout. Our guest instructor, judges, and line dance competition details will be announced on Instagram and updated here on Eventbrite. Follow @blackoutcountrydancing on Instagram for the most up-to-date event information.",
        "event_link": "https://www.eventbrite.com/e/summer-kickoff-your-boots-workshop-and-competition-tickets-1318193946579?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Arts Classes",
            "#workshop",
            "#event",
            "#competition",
            "#summer_kickoff",
            "#boots_workshop"
        ]
    },
    {
        "title": "NEPATHYA LIVE IN BOSTON",
        "date_time": "Wednesday, June 11 · 7 - 11pm EDT",
        "location": "Royale 279 Tremont Street Boston, MA 02116 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/nepathya-live-in-boston-tickets-1301924273549",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#concert",
            "#music",
            "#boston",
            "#live_performance",
            "#nepathya_live"
        ]
    },
    {
        "title": "NightinGALA: Renaissance Reimagined",
        "date_time": "Saturday, May 3 · 7 - 9:30pm EDT",
        "location": "Old South Church in Boston 645 Boylston Street Boston, MA 02116 Show map",
        "about": "RENAISSANCE REIMAGINED May 3rd, 7pm - Old South Church, Gordon Chapel, Boston Have you ever wondered what it would be like if Nightingale had existed 400 years ago? Come and find out by joining us for this year’s NightinGALA: Renaissance Reimagined, a performance of new compositions based on early sources paired directly with the pieces that informed them. Inspired by Roderick Williams’ Ave Verum Corpus (Reimagined), an inventive reworking of the Byrd classic, the concert will feature premieres by Nightingale composers Nathan Halbur, Kelvyn Koning, and Ben Perry, as well as contemporary compositions by Kerensa Briggs, Caroline Shaw, and local composer Richard J Clark all showcased alongside works of the Renaissance greats. Join us for food, drink, a silent auction, and a concert you won’t soon forget! Project Produced by Elijah Botkin and Bobbie Hill.",
        "event_link": "https://www.eventbrite.com/e/nightingala-renaissance-reimagined-tickets-991498447547",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Galas",
            "Boston Arts Galas",
            "#food",
            "#concert",
            "#boston",
            "#gala",
            "#classical",
            "#renaissance",
            "#polyphony",
            "#reimagined",
            "#historical_tour",
            "#nightingala"
        ]
    },
    {
        "title": "JOEY VOICES LIVE WITH  COMEDIANS MIKEY V., SEAN O'BRIEN JR. & JODY SLOANE!",
        "date_time": "Saturday, May 3 · 7 - 10pm EDT.Doors at 6:30pm",
        "location": "Regent Theatre 7 Medford Street Arlington, MA 02474 Show map",
        "about": "BACK BY POPULAR DEMAND… IT’S JOEY VOICES LIVE! The ONE and ONLY MASTER IMPRESSIONIST COMEDIAN on the East Coast is bringing the laughter, the music, and the iconic voices straight to you! Get ready for a comedy experience like no other as Joey Voices channels legends like Sinatra , Elvis , Cher , Tony Bennett , Tom Jones , and more in a show packed with laughs, sing-along-tunes, and wild moments! 🎤🔥 THIS IS NOT YOUR TYPICAL COMEDY NIGHT! Prepare for a rollercoaster of spot-on impressions and unexpected hilarity as Joey brings your favorite stars back to life—You won’t believe your ears! Hosted by the hilarious MIKEY V —and with special comedian guests JODY SLOANE and SEAN O’BRIEN JR. —this night is packed with comedy gold, surprises, and a non-stop laugh-fest. It’s like a comedy concert! THE BOSTON COMEDY SHOW is proud to present JOEY VOICES LIVE! for ONE NIGHT ONLY at The Regent Theatre —and trust us, it’s going to be a comedy extravaganza! Don’t wait get your tickets now—be part of the action, grab your tickets before they’re gone!",
        "event_link": "https://www.eventbrite.com/e/joey-voices-live-with-comedians-mikey-v-sean-obrien-jr-jody-sloane-tickets-1248649938579",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Arlington, MA",
            "Arlington Performances",
            "Arlington Arts Performances",
            "#event",
            "#joeyvoiceslive",
            "#mijeyv",
            "#seanobrienjr",
            "#jodysloane"
        ]
    },
    {
        "title": "Meet Me at the Ballpit: A Tumblr-themed Drag Show",
        "date_time": "Sunday, May 4 · 2 - 4pm EDT.Doors at 1pm",
        "location": "Jacques' Cabaret 79 Broadway Street Boston, MA 02116 Show map",
        "about": "From the incredibly brainrotted team that brought you Anislay: An Anime Themed Drag Show comes a (somehow) even more terminally online creation to bring you back to your blue-background glory days, and ask the really important questions: Who’s your real OTP? Do you know the color of the sky? Who’s the real Tumblr sexyman: The Onceler, or Nagito Komaeda? Where did you get your shoelaces? How long can naughty children survive in The Pear Wiggler? Whatever happened to Jorie’s three weed smoking girlfriends? We’re hosting two whole hours of the greatest cringe-overload throwback drag & burlesque content we could possibly dig up that still complies with the content guidelines (no female-presenting nipples!) at the Jacques’ Cabaret main stage on Sunday, May the Fourth (be with you!) from 2-4pm .",
        "event_link": "https://www.eventbrite.com/e/meet-me-at-the-ballpit-a-tumblr-themed-drag-show-tickets-1307521214149",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#boston",
            "#burlesque",
            "#millennial",
            "#nerdy",
            "#cringe",
            "#tumblr",
            "#ballpit",
            "#drag_show"
        ]
    },
    {
        "title": "Speak Easy Drag Brunch",
        "date_time": "Sunday, April 27 · 1 - 3pm EDT",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "Doors 12 Show 1 What do wigs, eggs benedict, pop mixes & mimosas have in common? They'll all be in the Lizard Lounge the last Sunday of every month! We're hosting our very own Drag Brunch, an iconic afternoon of performances from some of our favorite local drag queens scrumptious brunch favorites & fun cocktails! 21+ Doors lock once show starts General Admission $20, with bar stools first come first serve Tables for $45, comfortably seats 2 guests",
        "event_link": "https://www.eventbrite.com/e/speak-easy-drag-brunch-tickets-1313176649709",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Arts Parties",
            "#drag",
            "#dragbrunch",
            "#dragqueens",
            "#cambridgeevents",
            "#drag_brunch",
            "#harvardsquare",
            "#fun_times",
            "#lizardlounge",
            "#cambridgemass"
        ]
    },
    {
        "title": "Lizard Lounge Poetry Jam Slam Team Final",
        "date_time": "Sunday, April 27 · 7 - 11pm EDT",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "This is the culmination of our yearly “slam-off” to select the 2025 Lizard Lounge Poetry Jam Slam Team. The eight finalists (the top four finishers from each of our two previous semi-final slams) competing in tonight’s slam are Art Collins, Christopher Johnson, Daniel Letona, Finn Flood, Mike Savadian, Silent E, Warrior, and Will C. The slam team will represent Lizard Lounge at local and regional events throughout the year. Not to be missed, this event featuring the best of the best, often sells out—reserve your tickets now! Lizard Lounge Poetry Jam",
        "event_link": "https://www.eventbrite.com/e/lizard-lounge-poetry-jam-slam-team-final-tickets-1280754092969",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#poetry",
            "#spokenword",
            "#poetryslam",
            "#cambridgeevents",
            "#harvardsquare",
            "#poetry_jam",
            "#lizardlounge",
            "#cambridgemass",
            "#lizardloungepoetryjam"
        ]
    },
    {
        "title": "It's A Date -  Boston’s Hottest Comedy Dating Show at Aeronaut Brewing",
        "date_time": "Monday, April 28 · 7 - 9pm EDT.Doors at 2pm",
        "location": "Aeronaut Brewing Company 14 Tyler Street Somerville, MA 02143 Show map",
        "about": "DOOR: 7PM SHOW: 7:30PM - 9PM \"It's A Date\" is New England's hottest comedy dating show where four singles take the stage blindfolded and let their charms do the seducing, while the audience throws in deep and spicy questions. Get ready for a night where laughter, mystery, and unexpected sparks collide. Here's how it works: Before the show kicks off, attendees are invited to a quick mingle session, perfect for meeting new people or enjoying some laughs before the main event. Once the show begins, four singles, who apply ahead of time at the link HERE , take the stage blindfolded for a hilarious and unpredictable blind date, relying on smooth talk and quick wit to spark a connection. The audience fuels the heat by asking bold and flirty questions that nudge the four contestants to reveal their true selves. At the end of the night, the crowd votes to pick out one perfect match couple, who will win a second date outside of the show, planned and paid for by \"It's A Date\" . Whether it’s steamy, hilarious, awkward or unexpectedly wholesome, \"It's A Date\" guarantees a night of entertainment where romance and laughter ignite. Anything can happen—and who knows, love just might be in the air. LEGAL DISCLOSURE *By agreeing to purchase a ticket and/or attend the show, you hereby agree to It’s A Date, LLC’s (“It’s A Date”) appearance release and participation agreement. You will be granting It's A Date and all its subsidiaries permission to take motion and still pictures, record your voice and any sound made by you and to use the footage and materials in the development, production, distribution, advertising, and promotions of the show without any monetary compensation to you in perpetuity.",
        "event_link": "https://www.eventbrite.com/e/its-a-date-bostons-hottest-comedy-dating-show-at-aeronaut-brewing-tickets-1318852847369",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Performances",
            "Somerville Arts Performances",
            "#boston",
            "#comedy",
            "#cambridge",
            "#activity",
            "#thingstodo",
            "#datenight",
            "#somerville",
            "#comedyshow",
            "#things_to_do"
        ]
    },
    {
        "title": "Queer Comedy Night @ Satellite",
        "date_time": "Wednesday, April 30 · 8:30 - 9:30pm EDT.Doors at 7:30pm",
        "location": "Remnant Satellite - Cafe 877 Cambridge Street Cambridge, MA 02141 Show map",
        "about": "LGBTQ+ cuties do it better. Featuring Boston's hottest and most hilarious talent, Queer Comedy Night combines community-favorites, incredible food , and craft beer. You'll see stand-up, musical comedy, and performances that leave your stomach hurting from laughing; only for $10. The Remnant Brewing Satellite will be pouring beers , serving sandwiches , and stirring cocktails all night long! Brought to you by Hannah McEachern and Fool's Freedom , we're ready to give you an unforgettable night. Queer Comedy Night is short walk from the Green Line and street parking is widely available on Cambridge Street.",
        "event_link": "https://www.eventbrite.com/e/queer-comedy-night-satellite-tickets-1306066041689",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#food",
            "#lgbtq",
            "#queer",
            "#craftbeer",
            "#local",
            "#satellite",
            "#girlsnightout",
            "#stand_up",
            "#queer_comedy_night"
        ]
    },
    {
        "title": "Musical Improv Crash Course with Michael Yang",
        "date_time": "Sunday, April 27 · 3 - 5pm EDT",
        "location": "The Foundry 101 Rogers Street Cambridge, MA 02142 Show map",
        "about": "Ever wonder how some performers can make up entire songs on the spot? Now you can learn how! This workshop is a beginner-friendly introduction to musical improv. In this workshop, you will learn the fundamentals of musical improv, such as song structure and improvising lyrics, and also build comfort with incorporating musical elements into their scene work. This course is best suited to students with at least a foundation of prior improv training, but no prior music/singing background is necessary! About the Instructor Michael is an improviser, music director, and songwriter. He's been active in the greater Boston improv scene for 7 years, having played on stage and on keys with ComedySportz, Dirty Disney, Uncomposed, Nova, and more! He also ran the Somerville Musical Improv jam, where people of all different skill levels came together to play musical improv games and sing songs. In his spare time, he releases indie comedy songs under the name LJY and plays in many D&D games. About the Location This workshop will take place at The Cambridge Foundry in Kendall Square. This workshop will be in the RED MULTIROOM - take a right as soon as you head in the front doors, and you'll see us! If you need help finding your way, The Foundry staff is amazing , and located right inside at the front desk! About The Nova Comedy Collective The Nova Comedy Collective, is a new theater group committed to creating new spaces and shows for the Boston comedy community to flourish. Rising from the ashes of spaces lost to the pandemic, this new collective of comedians and creators is embracing radical hope, limitless fun, and uncompromising inclusivity. Comedy is for everyone. Our mission is to create live shows and other adventures in creativity that are unique, daring, and authentic. We promote belonging and community, encourage collaboration and continuous learning, and celebrate imagination, honesty, and risk-taking. At The Nova Comedy Collective, we’re always laughing with you.",
        "event_link": "https://www.eventbrite.com/e/musical-improv-crash-course-with-michael-yang-tickets-1308635627389?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Arts Classes",
            "#workshop",
            "#creative",
            "#comedy",
            "#improv",
            "#musicaltheatre",
            "#musicalcomedy",
            "#musical_theater",
            "#crash_course",
            "#musical_improv",
            "#musicalimprov"
        ]
    },
    {
        "title": "Inman Eats & Crafts 2025",
        "date_time": "Sunday, May 18 · 12 - 4pm EDT",
        "location": "Inman Square 1310 Cambridge Street Cambridge, MA 02139 Show map",
        "about": "The East Cambridge Business Association (ECBA) is proud to present Inman Eats & Crafts 2025 , on Sunday May 18, 2025 from 12:00 noon – 4:00pm . Inman Eats & Crafts will take place on Cambridge Street in Inman Square, between Springfield Street and Prospect Street. Inman Eats & Crafts is a celebration of everything Inman Square. It’s a street fair featuring our eclectic retailers, fabulous makers, our casual eats, and culinary treats. Inman Eats & Crafts hopes to deliver a full Inman Square experience to new visitors and residents alike. Inman Square shops and restaurants will be open for business as usual, but to experience The EATS you will need to purchase Inman Bucks . Inman Bucks are your ticket to try the samplings being offered by restaurant vendors taking part in the event. Inman Bucks can be purchased in advance through Eventbrite or www.EastCambridgeBA.com and are on sale beginning April 21 . Inman Bucks are limited, so advanced purchase is recommended. Inman Bucks will be for sale the day of the event based on availability. Thanks to gather here stitch lounge, East Cambridge Savings Bank , and Industry Labs , Inman Eats & Crafts will be hosting over 45 local makers at our Handmade Marketplace located in the East Cambridge Savings Bank and Industry Lab parking lots. Inman Eats & Crafts is open to all ages and pets. Come listen to local bands, visit our makers, try some local beer, and enjoy tasty food from the best restaurants in town! Live music programmed by The Lilypad, featuring some of your favorite local acts, including The Boston Cowboy Balladeers and more. Enjoy neighborhood brews from Lamplighter Brewing Co., Portico Brewing , and Remnant Brewing at our beer garden. There will also be live T-shirt screen printing with QRST’s and crafts with Alex Makes Art. Many of your favorite local restaurants will be participating. The growing list includes 1369 Coffee House, Christina's Ice Cream, Chomp! Chomp! Smash Burgers, Formaggio Kitchen Kendall, Mamaleh's Delicatessen , New Republick, Oak Bistro , Ole , Puritan Oyster Bar, S&S Delicatessen, and Turing Tavern . Inman Eats & Crafts is a perfect opportunity to get a taste of the local fare in and near East Cambridge and Inman Square. We are proud to partner with our sponsors, Alexandria Real Estate Equities, New England Development, Fairlane Properties, East Cambridge Savings Bank, Naveo Credit Union, Rock & Roll Daycare, Cambridge Savings Bank, Inman Wine and Spirits, and the City of Cambridge, as well as gather here stitch lounge to bring you this event!",
        "event_link": "https://www.eventbrite.com/e/inman-eats-crafts-2025-tickets-1291512311089?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Festivals",
            "Cambridge Arts Festivals"
        ]
    },
    {
        "title": "NEMPAC’s Springtime Cabaret – A Variety Concert Featuring NEMPAC Faculty",
        "date_time": "Saturday, May 17 · 7:30 - 9pm EDT.Doors at 6:30pm",
        "location": "Charlestown Working Theater 442 Bunker Hill Street Boston, MA 02129 Show map",
        "about": "Welcome to NEMPAC’s Springtime Cabaret ! Join us at the Charlestown Working Theater for a night of musical magic with our talented NEMPAC Faculty . Get ready for a variety concert that will showcase the incredible skills of our instructors. From soulful ballads to toe-tapping tunes, this event promises to entertain and delight. Don't miss out on this special evening of music and merriment! There will be 4 VIP tables available for 3 people each.   Each VIP ticketholder receives 2 drink tickets (6 drink tickest per table). The rest of the tickets are individually sold and are for open seating.  General admission tickets receive 1 drink ticket.",
        "event_link": "https://www.eventbrite.com/e/nempacs-springtime-cabaret-a-variety-concert-featuring-nempac-faculty-tickets-1307130605829?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#cabaret",
            "#variety",
            "#faculty",
            "#springtime",
            "#nempac"
        ]
    },
    {
        "title": "Art Classes@The Brewery: Henna for Beginners  With Karyn Alzayer",
        "date_time": "Tuesday, April 29 · 6:30 - 8:30pm EDT",
        "location": "Idle Hands Craft Ales 89 Commercial Street Malden, MA 02148 89 Commercial Street Malden, MA 02148 Show map",
        "about": "Artist Karyn Alzayer will guide participants through learning about the history, traditions, and application techniques of henna body art. Materials will be provided for each participant to learn and dabble with henna, including a handout and a henna cone. Each participant will also receive a demonstration design from the instructor as well. (Limited to 15 participants.)  No prior experience necessary. All materials included.",
        "event_link": "https://www.eventbrite.com/e/art-classesthe-brewery-henna-for-beginners-with-karyn-alzayer-tickets-1259928131959?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Malden, MA",
            "Malden Classes",
            "Malden Arts Classes",
            "#artclass",
            "#henna",
            "#artclasses",
            "#artclassesforadults",
            "#henna_art_workshops",
            "#hennaclass",
            "#henna_tattoo",
            "#localclasses",
            "#hennaclasses"
        ]
    },
    {
        "title": "The Art of Flamenco Guitar with Grisha Goryachev",
        "date_time": "Thursday, June 12 · 7:30 - 9pm EDT.Doors at 7pm",
        "location": "Multicultural Arts Center 41 Second Street Cambridge, MA 02141 Show map",
        "about": "Get ready for an unforgettable musical experience at the next Boston GuitarFest, where flamenco guitar virtuoso Grisha Goryachev will take the stage in a rare, not-to-be-missed performance. Renowned for his extraordinary technical mastery and deep emotional expression, Goryachev is one of the most celebrated flamenco guitarists of his generation. With a career spanning multiple continents and accolades, including top honors at international guitar competitions, Goryachev has earned a reputation for pushing the boundaries of flamenco while honoring its rich traditions. Known for his dynamic stage presence and captivating performances, Goryachev's artistry blends virtuosic technique with the soul-stirring intensity of flamenco’s most complex rhythms and melodies. His impeccable command of the guitarra flamenca has earned him rave reviews from critics and audiences alike, with performances at prestigious venues such as the Carnegie Hall , Café de Chinitas in Madrid, and the Santiago de Compostela International Guitar Festival . Whether you're a seasoned flamenco aficionado or a newcomer to the genre, this concert is an unparalleled opportunity to witness one of the world’s leading flamenco guitarists in his element. Don't miss the chance to see Grisha Goryachev bring his unique artistry to the stage at the Boston GuitarFest — an evening of passion, rhythm, and virtuosity that will leave you breathless.",
        "event_link": "https://www.eventbrite.com/e/the-art-of-flamenco-guitar-with-grisha-goryachev-tickets-1124785667209?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#live_performance",
            "#music_event",
            "#spanish_music",
            "#flamenco_guitar",
            "#grisha_goryachev"
        ]
    },
    {
        "title": "Overtime Comedy @ The Substation",
        "date_time": "Friday, May 2 · 8 - 9:30pm EDT.Doors at 7:30pm",
        "location": "The Substation 4228 Washington Street Boston, MA 02131 Show map",
        "about": "DOORS 7:45 SHOW 8:00 About your headliner Kathe Farris is a Boston-based stay-at-home mom, stand-up comedian, and snack cake enthusiast. She hit the comedy scene a little late in life with a different point of view and killer material. After becoming a Comic-in-Residence at The Comedy Studio and a finalist in the Boston Comedy Festival, she recently released her national debut with a Dry Bar Comedy Special as well as her album “Have you seen this woman” available anywhere you get your music, comedy and podcasts. About our show Had a long week at work? Well get ready to relax as we turn the office into a cool comedy club to start the weekend right. For over 5 years, we've been keeping local comedy fun, affordable, and—most importantly—funny, and The Substation is one of our favorite places to party. Come see fresh lineups featuring comics from HBO, Sirius XM, and Late Night performing alongside local up-and-comers in an office turned comedy club and bar. About The Substation The Substation powers a dynamic and warm community space by uniquely combining coworking, innovative activations, and a collaborative approach to programming.",
        "event_link": "https://www.eventbrite.com/e/overtime-comedy-the-substation-tickets-1304109991089?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#live",
            "#boston",
            "#comedy",
            "#standup",
            "#local",
            "#laughter",
            "#standupcomedy",
            "#roslindale",
            "#comedy_overtime",
            "#the_substation"
        ]
    },
    {
        "title": "Watercolor Painting with Eli!",
        "date_time": "Tuesday, April 29 · 5 - 7pm EDT",
        "location": "Fenway Community Center 1282 Boylston Street #123 Boston, MA 02215 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/watercolor-painting-with-eli-tickets-1300128241569?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Arts Classes",
            "#free",
            "#community",
            "#art",
            "#creative",
            "#boston",
            "#art_class",
            "#eli",
            "#painting_workshop",
            "#watercolor_painting",
            "#creative_session"
        ]
    },
    {
        "title": "Comedy Coop Presents: FREE Standup Comedy @ Fort Point Arts Community",
        "date_time": "Thursday, May 15 · 7:30 - 9pm EDT.Doors at 7pm",
        "location": "70a Sleeper St 70a Sleeper Street Boston, MA 02210 Show map",
        "about": "Comedy Coop Presents: Stand Up Comedy @ Fort Point Arts Community Come join the Comedy Coop for a night of laughter at Fort Point Arts Community ! We'll be turning their art gallery into a comedy club for the night! Get ready for hilarious stand-up comedy performances from the best comedians from Boston & beyond. Doo rs : 7:00PM Show Starts: 7:30PM",
        "event_link": "https://www.eventbrite.com/e/comedy-coop-presents-free-standup-comedy-fort-point-arts-community-tickets-1224185564979?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#comedy",
            "#jokes",
            "#standup",
            "#underground",
            "#standupcomedy",
            "#joke",
            "#underground_comedy"
        ]
    },
    {
        "title": "Tough as a Mother: Mother's Day Drag Brunch with Kiera's Cabaret",
        "date_time": "Sunday, May 11 · 12 - 2pm EDT",
        "location": "Idle Hands Craft Ales 89 Commercial Street Malden, MA 02148 Show map",
        "about": "Join us this Mother's Day for a fabulous Drag Brunch celebration, featuring an unforgettable lineup of stunning queens and charismatic kings! Enjoy delicious brunch bites, beermosas, and spectacular performances that’ll leave you laughing, cheering, and feeling the love. Treat yourself (and Mom) to a fun, fierce, and fabulous day you won’t forget! 🌸👑✨ Remember folks: be respectful, tip generously (please try to get your tipping bills in advance of visiting Idle Hands!), and don't touch the performers without permission. We're here for a good time, not a rude one. Get ready to werk!",
        "event_link": "https://www.eventbrite.com/e/tough-as-a-mother-mothers-day-drag-brunch-with-kieras-cabaret-tickets-1248743809349?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Malden, MA",
            "Malden Performances",
            "Malden Arts Performances",
            "#craftbeer",
            "#dragbrunch",
            "#dragshow"
        ]
    },
    {
        "title": "MIT Chamber Chorus: Songs from the Stage",
        "date_time": "Thursday, May 8 · 8 - 10pm EDT",
        "location": "Thomas Tull Concert Hall 201 Amherst St. Cambridge, MA 02139 Show map",
        "about": "Join the MIT Chamber Chorus for their first concert of the season: \"Songs from the Stage\" Solo and Ensemble works from Broadway to the Met to Mass Ave! Featuring selections from: The Color Purple Candide Merrily We Roll Along Sunday in the Park with George La Clemenza di Tito About the MIT Chamber Chorus The MIT Chamber Chorus, led by Ryan Turner, is a small student group that performs two concerts each year. Designed for the more vocally and musically advanced singer, this select ensemble is challenged with a wide variety of repertoire including music for a cappella chorus as well as choral works accompanied by small ensembles, or piano. Chamber Chorus has collaborated with the MIT Symphony, the MIT Wind Ensemble and with Theater faculty mounting chamber opera productions and opera scene programs.",
        "event_link": "https://www.eventbrite.com/e/mit-chamber-chorus-songs-from-the-stage-tickets-1292682731849?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#music",
            "#performance",
            "#harmony",
            "#mit_chamber_chorus",
            "#songs_from_the_stage"
        ]
    },
    {
        "title": "Classical Music is a DRAG",
        "date_time": "Tuesday, May 13 · 8 - 10:30pm EDT.Doors at 7:30pm",
        "location": "Jacques' Cabaret 79 Broadway Street Boston, MA 02116 Show map",
        "about": "Come join us for a night of drag and musical \"excellence\" as these performers show you those \"skills\" that got them through college! From opera to live instruments, we will finally answer those age old questions: \" ...is the bassoon the gayest instrument ?\" \" ...can you play trombone with lipstick?\" \" ...can opera be funny?\" So whether you love classical music, or hate it, or if you love drag, or hate yourself, there is something for everyone! Starring Donatella Fermata The Homophonics Tilda Watersclear Featuring additional performances by Al Naturale Aseena Dal Auntie Nyah Bunny Chance Christmas Carol Geya Jenda Shellie Schmaltz",
        "event_link": "https://www.eventbrite.com/e/classical-music-is-a-drag-tickets-1248866887479?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#boston",
            "#drag",
            "#event",
            "#performance",
            "#musicians",
            "#dragqueens",
            "#classical_music",
            "#jacquescabaret",
            "#dragqueenshows"
        ]
    },
    {
        "title": "Side Quest Book Club: Road to Ruin",
        "date_time": "Tuesday, May 27 · 7 - 8:30pm EDT",
        "location": "Side Quest Books & Games 1 Bow Market Way Suite 32 Somerville, MA 02143 Show map",
        "about": "An electrifying, gritty fantasy from debut author Hana Lee that takes a royal messenger on a high-speed chase across a climate-ravaged wasteland, featuring motorcycles, monsters, and magic. Jin-Lu has the most dangerous job in the wasteland. She’s a magebike courier, one of the few who venture outside the domed cities on motorcycles powered by magic. Every day, she braves the wasteland’s dangers—deadly storms, roving marauders, and territorial beasts—to deliver her wares. Her most valuable cargo? A prince’s love letters addressed to Yi-Nereen, a princess desperate to escape the clutches of her abusive family and soon-to-be husband. Jin, desperately in love with both her and the prince, can’t refuse Yi-Nereen’s plea for help. The two of them flee across the wastes, pursued by Yi-Nereen’s furious father, her scheming betrothed, and a bounty hunter with mysterious powers. A storm to end all storms is brewing and dark secrets about the heritability of magic are coming to light. Jin’s heart has led her into peril before, but this time she may not find her way back. ---------------- Tickets for this event are $5, which can be used as $5 credit towards a purchase at SQBG on the day. Side Quest Books & Games is located on the Bow Market balcony, in the back left corner. There is an elevator for accessibility in the lobby of Bow Market, to the right of the driveway when you first arrive. Masks are optional, but please let us know and stay home if you are ill. Outside food and drink are welcome.",
        "event_link": "https://www.eventbrite.com/e/side-quest-book-club-road-to-ruin-tickets-1323267331209?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Parties",
            "Somerville Arts Parties",
            "#fantasy",
            "#bookclub",
            "#fantasybooks",
            "#sidequest"
        ]
    },
    {
        "title": "Boston City Singers 30th Anniversary Celebration",
        "date_time": "Saturday, May 31 · 4 - 5:30pm EDT",
        "location": "Brooke High School 200 American Legion Highway Boston, MA 02124 Show map",
        "about": "Boston City Singers 30th Anniversary Celebration Come join us for a special evening of music and memories at our 30th Anniversary Celebration ! The event will be held at Brooke High School ,a special combined performance honoring three decades of music, community, and joy! 🎟️ Tickets are free, but donations are suggested of $10/person 📅 Date: Saturday, May 31st 🕓 Time: 4:00 PM 📍 Location: Brooke High School 200 American Legion Highway, Mattapan, MA 02124",
        "event_link": "https://www.eventbrite.com/e/boston-city-singers-30th-anniversary-celebration-tickets-1284147984189?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#anniversary",
            "#celebration",
            "#event",
            "#30th",
            "#bostoncitysingers"
        ]
    },
    {
        "title": "THE BIG DUMB STUPID CLOWN WORKSHOP AGAIN!!",
        "date_time": "Tuesday, May 20 · 6 - 8pm EDT",
        "location": "The Foundry 101 Rogers Street Cambridge, MA 02142 Show map",
        "about": "About the Class Let your brain go all soft and your heart swell up big and juicy! Realign with the light, agile, very good, genius clown within! We’ll explore exercises inspired by the teachings of Chris Bayes (The Pandemonium Studio in NYC) and Philippe Gaulier (École Philippe Gaulier in Étampes) to rediscover how to be— Sensitive! Open! Not normal! YOU! Follow your stupidity. Follow your madness. Follow your GPS to The Foundry on May 20th at 6PM. Come wearing clothes you can move in! Can’t wait to see you :) Kylie About the Instructor Kylie is a writer/performer with an MFA in Writing for Film & Television from Emerson College and an MA in Performance Studies from NYU. She studied clown at Brooklyn Comedy Collective and The Pandemonium Studio in New York and École Philippe Gaulier in Étampes, France. Her daily spiritual practices include tai chi and scream-laughing directly into the sun. About the Class Level At The Nova Comedy Collective, we call this an ORBIT CLASS - meaning it's perfect for participants who have a foundation of the basics, and are ready to build out your improv toolkit! About the Location This class is located at The Cambridge Foundry, in the BIG THEATER! It's called the STEAM Set. If you head in through the front of the Foundry, it will be straight in front of you, at the back of the lobby! And if you need help, you can ask at the front table - The Foundry staff is the very best. About The Nova Comedy Collective The Nova Comedy Collective, is a brand new theater group committed to creating new spaces and shows for the Boston comedy community to flourish. Rising from the ashes of spaces lost to the pandemic, this new collective of comedians and creators is embracing radical hope, limitless fun, and uncompromising inclusivity. Comedy is for everyone. Our mission is to create live shows and other adventures in creativity that are unique, daring, and authentic. We promote belonging and community, encourage collaboration and continuous learning, and celebrate imagination, honesty, and risk-taking. At The Nova Comedy Collective, we’re always laughing with you.",
        "event_link": "https://www.eventbrite.com/e/the-big-dumb-stupid-clown-workshop-again-tickets-1320182474319?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Arts Classes",
            "#theater",
            "#comedy",
            "#fun",
            "#acting",
            "#theatre",
            "#circus",
            "#classroom",
            "#clown",
            "#clowning",
            "#performance_training"
        ]
    },
    {
        "title": "Side Quest Book Club: The Butcher of the Forest",
        "date_time": "Tuesday, May 20 · 7 - 8:30pm EDT",
        "location": "Side Quest Books & Games 1 Bow Market Way Suite 32 Somerville, MA 02143 Show map",
        "about": "A world-weary woman races against the clock to rescue the children of a wrathful tyrant from a dangerous, otherworldly forest. At the northern edge of a land ruled by a monstrous, foreign tyrant lies the wild forest known as the Elmever. The villagers know better than to let their children go near—once someone goes in, they never come back out. No one knows the strange and terrifying traps of the Elmever better than Veris Thorn, the only person to ever rescue a child from the forest many years ago. When the Tyrant’s two young children go missing, Veris is commanded to enter the forest once more and bring them home safe. If Veris fails, the Tyrant will kill her; if she remains in the forest for longer than a day, she will be trapped forevermore. So Veris will travel deep into the Elmever to face traps, riddles, and monsters at the behest of another monster. One misstep will cost everything. ---------------- Tickets for this event are $5, which can be used as $5 credit towards a purchase at SQBG on the day. Side Quest Books & Games is located on the Bow Market balcony, in the back left corner. There is an elevator for accessibility in the lobby of Bow Market, to the right of the driveway when you first arrive. Masks are optional, but please let us know and stay home if you are ill. Outside food and drink are welcome.",
        "event_link": "https://www.eventbrite.com/e/side-quest-book-club-the-butcher-of-the-forest-tickets-1323267973129?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Parties",
            "Somerville Arts Parties",
            "#fantasy",
            "#bookclub",
            "#fantasybooks",
            "#sidequest"
        ]
    },
    {
        "title": "Hideout Comedy Presents Rob Haze!",
        "date_time": "Friday, May 9 · 7:30 - 9pm EDT.Doors at 6:30pm",
        "location": "The White Bull Tavern Comedy Club Boston 1 Union Street Boston, MA 02108 Show map",
        "about": "Located right in the heart of historic downtown Boston, come get a taste of the absolute BEST stand-up comics working today. These comedians are all pros, many having had their comedy featured places like Comedy Central, Funny or Die, Netflix, and more! Past performers include Michael Che, Gary Gulman, Myq Kaplan, Rich Vos, Corinne Fisher, Alonzo Bodden, Liza Treyger, Jeff Ross, Josh Gondelman, and Mark Normand. You never know who will drop in. SHOWS ARE 21+ SHOWS ARE 21+ Doors open at 6:30pm | Show starts at 7:30pm Rob Haze is a comedian from Atlanta, Georgia. He is a writer/ performer on Sherman’s Showcase on IFC. He was on the Sneaker Sketch  show Sneak This on B/R Kicks. Rob has a stand up album called Haze-o-pedia. Rob’s standup has been featured on The Tonight Show starring Jimmy Fallon, The Late Late Show, Comedy Central, and Viceland. Rob has a podcast called The Inconsistent Podcast with Rob Haze available everywhere. SHOWS ARE 21+ Like us on Facebook! www.facebook.com/hideoutcomedy/ IG: @hideoutcomedy",
        "event_link": "https://www.eventbrite.com/e/hideout-comedy-presents-rob-haze-tickets-1302277068769?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#comedy",
            "#standupcomedy",
            "#bostoncomedy"
        ]
    },
    {
        "title": "Comedy Coop Presents: Stand Up Comedy @ Bully Boy Distillers",
        "date_time": "Friday, May 9 · 7:30 - 9pm EDT.Doors at 7pm",
        "location": "44 Cedric St 44 Cedric Street Boston, MA 02119 Show map",
        "about": "Comedy Coop Presents: Stand Up Comedy @ Bully Boy Distillers Come join the Comedy Coop for a night of laughter at Bully Boy Distillers ! Get ready for hilarious stand-up comedy performances from the best comedians from Boston & beyond. Doo rs : 7:00PM Show Starts: 7:30PM",
        "event_link": "https://www.eventbrite.com/e/comedy-coop-presents-stand-up-comedy-bully-boy-distillers-tickets-1325242238209?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#boston",
            "#comedy",
            "#jokes",
            "#standup",
            "#underground",
            "#massachusetts",
            "#dorchester",
            "#mass",
            "#standupcomedy",
            "#underground_comedy"
        ]
    },
    {
        "title": "Workshop: Video Installation and Projection Mapping",
        "date_time": "Saturday, May 17 · 11am - 4pm EDT",
        "location": "Artisan's Asylum 96 Holton Street Boston, MA 02135 Show map",
        "about": "This workshop is for people who want to learn how to integrate video projection mapping with 2D works, sculpture, installation, performance, and public art practices. The workshop will go over projector properties and terms, computer to projector setups, ways of working within the Adobe suite and a basic introduction to MadMapper. Students will work in a hands-on manner live mapping/masking their video content onto items that they bring. If possible, students should bring their own laptops, projectors, and accessories (see full list below), but if you don't have these items, please contact us before enrolling and we can see if we are able to provide things for you. Prerequisites Participants should have a base knowledge of editing in Adobe Premiere or After Effects and have video files to bring to the workshop. What to bring to the workshop: Physical items - Bring 5 or more 3D objects / artworks / materials / substances / etc. to test projections on. Tip/FYI: Transparent surfaces (glass, plastic, etc) will NOT hold projection, something needs to be translucent (like tracing paper) to opaque. Very shiny and mirrors will bounce projection. - Something for note taking (hardcopy or digital) Digital Files - Bring moving image files to test/practice with (raw footage or past work) on a laptop Optional but recommended: Gather/create moving image content that could add meaning to the objects you are going to bring. Not sure? Collect a wide variety of footage (different content, colors, pacing, framing, etc.) - Optional: still images with shapes/images that might be a shape you'd like to project within Equipment Laptop - with display port or other video outs; adaptors as needed to connect your computer to the projector's video cables* - with Adobe Premiere or After Effects loaded. You can get a 7-day free Adobe Premiere trial here. - with MadMapper demo version (limited version with watermarks, free download ) Projector with it's appropriate *video cables (HDMI or other) that can connect to your computer Power - Extension cord - Power strip Optional / Bring if you have it: - Projector stand (with vertical rotation options; tip: bring bungee cords if needed to secure projector at odd angles) or if your projector has a tripod mount: bring a tripod that can support it - Speakers (bluetooth or wired, bring appropriate cables/adaptors) - Various projector shims: pieces of wood, cardboard - Gaffers tape - Cinefoil - Some suggested readings may be sent out before the class to help participants have more conceptual references.",
        "event_link": "https://www.eventbrite.com/e/workshop-video-installation-and-projection-mapping-tickets-1319498588799?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Arts Classes",
            "#gallery",
            "#video",
            "#videography",
            "#video_editing",
            "#video_production",
            "#projection_cine"
        ]
    },
    {
        "title": "May Outdoor Queer Dance Workshop with Michael Winward",
        "date_time": "Saturday, May 17 · 2 - 4pm EDT",
        "location": "Granada Park Granada Park Boston, MA Show map",
        "about": "Queer Dance Workshops are a chance for queer folks of all identities and experiences to connect through dance. Featuring a rotating roster of teachers and dance styles, these workshops are a time to simply dance around joyfully with other queer people. These special workshops will be held outside near Egleston Square in Jamaica Plain. Our May workshop will feature partner dancing with Michael Winward! J Michael Winward (he/they) is an interdisciplinary artist: dancer, storyteller, organizer: working at the intersection of movement, memoir, memory, and care. Michael is the director of Steps in Time®: an organization that brings social partner dance programs to assisted living & mind care communities. He is a lead coordinator of Dancing Queerly: a platform for LGBTQ+ dance & performance artist support. Michael has a B.A. in Liberal Arts from Bennington College, and an MFA in Interdisciplinary Art from Goddard College. Michael is currently a first year PhD student in the Theatre, Dance & Performance Studies program at Tufts University. Exact location details will be sent to registrants. We have strong ties with the neighborhood community and the workshop neighbors value our safety. Some parking is available. It is about a 10 minute walk from Stony Brook on the Orange Line and near bus stops for busses 42, 22, 44, and 29. There is a question about access needs in registration. In particular, if you need ASL interpretation please note it in your rsvp or email me at jotrolldance@gmail.com as it is often easier to get interpretation with a confirmed need. Unfortunately, I will need at least a week's notice to ensure interpretation. Workshops are free, but please consider donating (no more than $20) to help pay our wonderful teachers.",
        "event_link": "https://www.eventbrite.com/e/may-outdoor-queer-dance-workshop-with-michael-winward-tickets-1132609358079?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Arts Classes",
            "#queer",
            "#lgbt",
            "#bostonevents",
            "#lgbtevent",
            "#queerevents",
            "#outdoor_event",
            "#queer_events",
            "#queerdance",
            "#queerdanceclass"
        ]
    },
    {
        "title": "Sea Stories: Chapter 1 - Storytelling Event",
        "date_time": "Thursday, May 22 · 7 - 9pm EDT",
        "location": "Break Rock Brewing 534 Victory Road Quincy, MA 02171 Show map",
        "about": "Join us on Thursday, May 22nd from 7-9 PM at Break Rock Brewing for an evening of thrilling tales and ocean adventures where real people share their true, unscripted stories about life on (or near) the water. Join our eclectic mix of storytellers with incredible tales of maritime misadventures, near misses, strange encounters, and laugh-out-loud moments on the open water, or share your own! You never know what you'll get, from ghost ships to daring rescues or hilarious miscommunications on deck. Whether you're taking the mic or just along for the ride, grab a drink, settle in, and let the stories sweep you away. Each ticket includes a beverage. We have a large assortment of craft beer, seltzer, cocktail seltzers, cider, wine, cocktails, gourmet soda, soda water, kombucha, and more!",
        "event_link": "https://www.eventbrite.com/e/sea-stories-chapter-1-storytelling-event-tickets-1300075945149?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Quincy, MA",
            "Quincy Parties",
            "Quincy Arts Parties",
            "#comedy",
            "#event",
            "#storytelling",
            "#beergarden",
            "#openmicevent",
            "#comedy_event",
            "#brewery_event",
            "#storytelling_event",
            "#breweryevent",
            "#sea_stories"
        ]
    },
    {
        "title": "Inman Eats & Crafts 2025",
        "date_time": "Sunday, May 18 · 12 - 4pm EDT",
        "location": "Inman Square 1310 Cambridge Street Cambridge, MA 02139 Show map",
        "about": "The East Cambridge Business Association (ECBA) is proud to present Inman Eats & Crafts 2025 , on Sunday May 18, 2025 from 12:00 noon – 4:00pm . Inman Eats & Crafts will take place on Cambridge Street in Inman Square, between Springfield Street and Prospect Street. Inman Eats & Crafts is a celebration of everything Inman Square. It’s a street fair featuring our eclectic retailers, fabulous makers, our casual eats, and culinary treats. Inman Eats & Crafts hopes to deliver a full Inman Square experience to new visitors and residents alike. Inman Square shops and restaurants will be open for business as usual, but to experience The EATS you will need to purchase Inman Bucks . Inman Bucks are your ticket to try the samplings being offered by restaurant vendors taking part in the event. Inman Bucks can be purchased in advance through Eventbrite or www.EastCambridgeBA.com and are on sale beginning April 21 . Inman Bucks are limited, so advanced purchase is recommended. Inman Bucks will be for sale the day of the event based on availability. Thanks to gather here stitch lounge, East Cambridge Savings Bank , and Industry Labs , Inman Eats & Crafts will be hosting over 45 local makers at our Handmade Marketplace located in the East Cambridge Savings Bank and Industry Lab parking lots. Inman Eats & Crafts is open to all ages and pets. Come listen to local bands, visit our makers, try some local beer, and enjoy tasty food from the best restaurants in town! Live music programmed by The Lilypad, featuring some of your favorite local acts, including The Boston Cowboy Balladeers and more. Enjoy neighborhood brews from Lamplighter Brewing Co., Portico Brewing , and Remnant Brewing at our beer garden. There will also be live T-shirt screen printing with QRST’s and crafts with Alex Makes Art. Many of your favorite local restaurants will be participating. The growing list includes 1369 Coffee House, Christina's Ice Cream, Chomp! Chomp! Smash Burgers, Formaggio Kitchen Kendall, Mamaleh's Delicatessen , New Republick, Oak Bistro , Ole , Puritan Oyster Bar, S&S Delicatessen, and Turing Tavern . Inman Eats & Crafts is a perfect opportunity to get a taste of the local fare in and near East Cambridge and Inman Square. We are proud to partner with our sponsors, Alexandria Real Estate Equities, New England Development, Fairlane Properties, East Cambridge Savings Bank, Naveo Credit Union, Rock & Roll Daycare, Cambridge Savings Bank, Inman Wine and Spirits, and the City of Cambridge, as well as gather here stitch lounge to bring you this event!",
        "event_link": "https://www.eventbrite.com/e/inman-eats-crafts-2025-tickets-1291512311089",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Festivals",
            "Cambridge Arts Festivals"
        ]
    },
    {
        "title": "NEMPAC’s Springtime Cabaret – A Variety Concert Featuring NEMPAC Faculty",
        "date_time": "Saturday, May 17 · 7:30 - 9pm EDT.Doors at 6:30pm",
        "location": "Charlestown Working Theater 442 Bunker Hill Street Boston, MA 02129 Show map",
        "about": "Welcome to NEMPAC’s Springtime Cabaret ! Join us at the Charlestown Working Theater for a night of musical magic with our talented NEMPAC Faculty . Get ready for a variety concert that will showcase the incredible skills of our instructors. From soulful ballads to toe-tapping tunes, this event promises to entertain and delight. Don't miss out on this special evening of music and merriment! There will be 4 VIP tables available for 3 people each.   Each VIP ticketholder receives 2 drink tickets (6 drink tickest per table). The rest of the tickets are individually sold and are for open seating.  General admission tickets receive 1 drink ticket.",
        "event_link": "https://www.eventbrite.com/e/nempacs-springtime-cabaret-a-variety-concert-featuring-nempac-faculty-tickets-1307130605829",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#cabaret",
            "#variety",
            "#faculty",
            "#springtime",
            "#nempac"
        ]
    },
    {
        "title": "The Art of Flamenco Guitar with Grisha Goryachev",
        "date_time": "Thursday, June 12 · 7:30 - 9pm EDT.Doors at 7pm",
        "location": "Multicultural Arts Center 41 Second Street Cambridge, MA 02141 Show map",
        "about": "Get ready for an unforgettable musical experience at the next Boston GuitarFest, where flamenco guitar virtuoso Grisha Goryachev will take the stage in a rare, not-to-be-missed performance. Renowned for his extraordinary technical mastery and deep emotional expression, Goryachev is one of the most celebrated flamenco guitarists of his generation. With a career spanning multiple continents and accolades, including top honors at international guitar competitions, Goryachev has earned a reputation for pushing the boundaries of flamenco while honoring its rich traditions. Known for his dynamic stage presence and captivating performances, Goryachev's artistry blends virtuosic technique with the soul-stirring intensity of flamenco’s most complex rhythms and melodies. His impeccable command of the guitarra flamenca has earned him rave reviews from critics and audiences alike, with performances at prestigious venues such as the Carnegie Hall , Café de Chinitas in Madrid, and the Santiago de Compostela International Guitar Festival . Whether you're a seasoned flamenco aficionado or a newcomer to the genre, this concert is an unparalleled opportunity to witness one of the world’s leading flamenco guitarists in his element. Don't miss the chance to see Grisha Goryachev bring his unique artistry to the stage at the Boston GuitarFest — an evening of passion, rhythm, and virtuosity that will leave you breathless.",
        "event_link": "https://www.eventbrite.com/e/the-art-of-flamenco-guitar-with-grisha-goryachev-tickets-1124785667209",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Arts Performances",
            "#live_performance",
            "#music_event",
            "#spanish_music",
            "#flamenco_guitar",
            "#grisha_goryachev"
        ]
    },
    {
        "title": "Comedy Coop Presents: FREE Standup Comedy @ Fort Point Arts Community",
        "date_time": "Thursday, May 15 · 7:30 - 9pm EDT.Doors at 7pm",
        "location": "70a Sleeper St 70a Sleeper Street Boston, MA 02210 Show map",
        "about": "Comedy Coop Presents: Stand Up Comedy @ Fort Point Arts Community Come join the Comedy Coop for a night of laughter at Fort Point Arts Community ! We'll be turning their art gallery into a comedy club for the night! Get ready for hilarious stand-up comedy performances from the best comedians from Boston & beyond. Doo rs : 7:00PM Show Starts: 7:30PM",
        "event_link": "https://www.eventbrite.com/e/comedy-coop-presents-free-standup-comedy-fort-point-arts-community-tickets-1224185564979",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#comedy",
            "#jokes",
            "#standup",
            "#underground",
            "#standupcomedy",
            "#joke",
            "#underground_comedy"
        ]
    },
    {
        "title": "Musical Improv Crash Course with Michael Yang",
        "date_time": "Sunday, April 27 · 3 - 5pm EDT",
        "location": "The Foundry 101 Rogers Street Cambridge, MA 02142 Show map",
        "about": "Ever wonder how some performers can make up entire songs on the spot? Now you can learn how! This workshop is a beginner-friendly introduction to musical improv. In this workshop, you will learn the fundamentals of musical improv, such as song structure and improvising lyrics, and also build comfort with incorporating musical elements into their scene work. This course is best suited to students with at least a foundation of prior improv training, but no prior music/singing background is necessary! About the Instructor Michael is an improviser, music director, and songwriter. He's been active in the greater Boston improv scene for 7 years, having played on stage and on keys with ComedySportz, Dirty Disney, Uncomposed, Nova, and more! He also ran the Somerville Musical Improv jam, where people of all different skill levels came together to play musical improv games and sing songs. In his spare time, he releases indie comedy songs under the name LJY and plays in many D&D games. About the Location This workshop will take place at The Cambridge Foundry in Kendall Square. This workshop will be in the RED MULTIROOM - take a right as soon as you head in the front doors, and you'll see us! If you need help finding your way, The Foundry staff is amazing , and located right inside at the front desk! About The Nova Comedy Collective The Nova Comedy Collective, is a new theater group committed to creating new spaces and shows for the Boston comedy community to flourish. Rising from the ashes of spaces lost to the pandemic, this new collective of comedians and creators is embracing radical hope, limitless fun, and uncompromising inclusivity. Comedy is for everyone. Our mission is to create live shows and other adventures in creativity that are unique, daring, and authentic. We promote belonging and community, encourage collaboration and continuous learning, and celebrate imagination, honesty, and risk-taking. At The Nova Comedy Collective, we’re always laughing with you.",
        "event_link": "https://www.eventbrite.com/e/musical-improv-crash-course-with-michael-yang-tickets-1308635627389",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Arts Classes",
            "#workshop",
            "#creative",
            "#comedy",
            "#improv",
            "#musicaltheatre",
            "#musicalcomedy",
            "#musical_theater",
            "#crash_course",
            "#musical_improv",
            "#musicalimprov"
        ]
    },
    {
        "title": "Watercolor Painting with Eli!",
        "date_time": "Tuesday, April 29 · 5 - 7pm EDT",
        "location": "Fenway Community Center 1282 Boylston Street #123 Boston, MA 02215 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/watercolor-painting-with-eli-tickets-1300128241569",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Arts Classes",
            "#free",
            "#community",
            "#art",
            "#creative",
            "#boston",
            "#art_class",
            "#eli",
            "#painting_workshop",
            "#watercolor_painting",
            "#creative_session"
        ]
    },
    {
        "title": "Art Classes@The Brewery: Henna for Beginners  With Karyn Alzayer",
        "date_time": "Tuesday, April 29 · 6:30 - 8:30pm EDT",
        "location": "Idle Hands Craft Ales 89 Commercial Street Malden, MA 02148 89 Commercial Street Malden, MA 02148 Show map",
        "about": "Artist Karyn Alzayer will guide participants through learning about the history, traditions, and application techniques of henna body art. Materials will be provided for each participant to learn and dabble with henna, including a handout and a henna cone. Each participant will also receive a demonstration design from the instructor as well. (Limited to 15 participants.)  No prior experience necessary. All materials included.",
        "event_link": "https://www.eventbrite.com/e/art-classesthe-brewery-henna-for-beginners-with-karyn-alzayer-tickets-1259928131959",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Malden, MA",
            "Malden Classes",
            "Malden Arts Classes",
            "#artclass",
            "#henna",
            "#artclasses",
            "#artclassesforadults",
            "#henna_art_workshops",
            "#hennaclass",
            "#henna_tattoo",
            "#localclasses",
            "#hennaclasses"
        ]
    },
    {
        "title": "Overtime Comedy @ The Substation",
        "date_time": "Friday, May 2 · 8 - 9:30pm EDT.Doors at 7:30pm",
        "location": "The Substation 4228 Washington Street Boston, MA 02131 Show map",
        "about": "DOORS 7:45 SHOW 8:00 About your headliner Kathe Farris is a Boston-based stay-at-home mom, stand-up comedian, and snack cake enthusiast. She hit the comedy scene a little late in life with a different point of view and killer material. After becoming a Comic-in-Residence at The Comedy Studio and a finalist in the Boston Comedy Festival, she recently released her national debut with a Dry Bar Comedy Special as well as her album “Have you seen this woman” available anywhere you get your music, comedy and podcasts. About our show Had a long week at work? Well get ready to relax as we turn the office into a cool comedy club to start the weekend right. For over 5 years, we've been keeping local comedy fun, affordable, and—most importantly—funny, and The Substation is one of our favorite places to party. Come see fresh lineups featuring comics from HBO, Sirius XM, and Late Night performing alongside local up-and-comers in an office turned comedy club and bar. About The Substation The Substation powers a dynamic and warm community space by uniquely combining coworking, innovative activations, and a collaborative approach to programming.",
        "event_link": "https://www.eventbrite.com/e/overtime-comedy-the-substation-tickets-1304109991089",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Arts Performances",
            "#live",
            "#boston",
            "#comedy",
            "#standup",
            "#local",
            "#laughter",
            "#standupcomedy",
            "#roslindale",
            "#comedy_overtime",
            "#the_substation"
        ]
    }
]