[
    {
        "title": "EdVestors' Annual Showcase",
        "date_time": "Wednesday, May 21 · 4 - 6:30pm EDT",
        "location": "Boston University Center for Computing and Data Sciences (CDS) 665 Commonwealth Avenue Boston, MA 02215 Show map",
        "about": "As policies evolve and traditional measures of educational success are reconsidered in Massachusetts and beyond, we have an opportunity to reimagine how we use data to measure and drive improvement. At this year’s Education Showcase, we’ll feature educators, community partners, researchers, and students to explore how data, especially community-defined and community-informed data, can be a catalyst for improvement. Panelists include: Nicole Agois , Ed.M., Managing Director, Open Door Arts Apryl Clarkson , Senior Executive Director of the Office of Data and Accountability, Boston Public Schools Ariel Tichnor-Wagner , Ph.D., Program Director, MA in Educational Policy Studies & Lecturer, Boston University Wheelock College of Education and Human Development Please join us on Wednesday, May 21st at Boston University's CDS Conference Center ! EdVestors is committed to providing accessibility accommodations for all of our events. Please request disability or language accommodations in your registration at least two weeks prior to the event, or we may not be able to fulfill them. For accessibility resquests or any other questions, please contact Alexia Hernandez at hernandez@edvestors.org . Habrá traducción al español disponible. Al registrarse, por favor háganos saber con al menos dos semanas de anticipación si requiere interpretación al español o contactando a Alexia Hernandez at hernandez@edvestors.org .",
        "event_link": "https://www.eventbrite.com/e/edvestors-annual-showcase-tickets-1295030915329?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Family & Education Other"
        ]
    },
    {
        "title": "Not Your Mother's Mother's Day: A Conversation and Gathering",
        "date_time": "Tuesday, May 13 · 7 - 8:30pm EDT",
        "location": "Hummingbird Books 55 Boylston Street #Suite 5510 Newton, MA 02467 Show map",
        "about": "Join us for an evening of wine, cheese, and conversation with authors Ruthie Ackerman, Amanda Hess, Nicole Graev Lipson, Nancy Reddy, and Domenica Ruta. Through intimate storytelling and candid discussion of their recent releases, they'll challenge worn-out narratives of motherhood, offering fresh perspectives on what it means to mother in the 21st century, both on and off the page. Tickets: $30 (Includes a book; use the add-ons feature to indicate which book you would like with your ticket) $10 (Admission Only) About Hummingbird Books: An independent, local female-owned and operated store, Hummingbird Books is a community destination for an extensive collection of adult and children’s books and showcases a mix of local and widely beloved authors. Hummingbird Books is a magical place where children discover a love of reading. At Hummingbird Books, we believe reading connects us to others as we search for ideas, wisdom, and sometimes just provides a much-needed break from reality. In addition to its book selection, Hummingbird Books offers a variety of games, gift items, candy, and stationery, as well as in-store programming including story times, and book signings.",
        "event_link": "https://www.eventbrite.com/e/not-your-mothers-mothers-day-a-conversation-and-gathering-tickets-1310946549419?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Newton, MA",
            "Newton Festivals",
            "Newton Family & Education Festivals",
            "#celebration",
            "#event",
            "#motherhood",
            "#unique",
            "#mothers_day"
        ]
    },
    {
        "title": "Daddy Daughter Dance",
        "date_time": "Saturday, May 10 · 5 - 8pm EDT",
        "location": "Cambridge Friends School 5 Cadbury Rd Cambridge, MA 02140 Show map",
        "about": "Welcome to the Daddy Daughter Dance! Presented by The Next Dad Up Foundation Get ready for a magical night filled with fun, laughter, and dancing alongside your little princess! This unforgettable evening is the perfect opportunity for dads and daughters to share smiles, create lasting memories, and enjoy each other’s company in a joyful, heartwarming setting. Come dressed to impress in your best attire and get ready to hit the dance floor—because the night belongs to you and your daughter. From sweet tunes and silly moves to heartfelt moments and cherished photos, this will be a night to remember. We’re so glad you’re here. Let the celebration begin!",
        "event_link": "https://www.eventbrite.com/e/daddy-daughter-dance-tickets-1319549862159?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Family & Education Parties",
            "#dance",
            "#love",
            "#event",
            "#daughter",
            "#daddy"
        ]
    },
    {
        "title": "HONOR THY MOTHER Appreciation Luncheon",
        "date_time": "Sunday, May 18 · 2 - 4pm EDT.Doors at 1:50pm",
        "location": "Hibernian Hall 184 Dudley Street #200 Boston, MA 02119 Show map",
        "about": "Welcome to the Honor Thy Mother Appreciation Luncheon! Come join us at Hibernian Hall for a special event dedicated to showing love and gratitude to all the amazing mothers out there. This in-person luncheon will be a heartwarming gathering filled with delicious food, and heartfelt moments. Let's celebrate and appreciate the incredible women who have shaped our lives and nurtured us with their unconditional love. It's a time to honor, cherish, and thank the mothers in our lives for everything they do. Don't miss this opportunity to show your gratitude and make those in your life feel extra special. Join us at the Honor Thy Mother Appreciation Luncheon for a memorable and meaningful experience!",
        "event_link": "https://www.eventbrite.com/e/honor-thy-mother-appreciation-luncheon-tickets-1289546912529?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Galas",
            "Boston Family & Education Galas",
            "#community",
            "#event",
            "#mother",
            "#luncheon",
            "#appreciation",
            "#honor",
            "#community_event",
            "#mothersday2025"
        ]
    },
    {
        "title": "Fenway Playgroup",
        "date_time": "Friday, May 2 · 10:30 - 11:30am EDT",
        "location": "Fenway Community Center 1282 Boylston Street #123 Boston, MA 02215 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/fenway-playgroup-tickets-1301300036439?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Family & Education Networking",
            "#parents",
            "#community",
            "#toddlers",
            "#playtime",
            "#fenway_playgroup"
        ]
    },
    {
        "title": "Class of 2000 25th Reunion",
        "date_time": "Friday, June 6 · 6 - 10pm EDT",
        "location": "555 Talbot Ave 555 Talbot Avenue Boston, MA 02124 Show map",
        "about": "Welcome to the Class of 2000 25th Reunion! Come join us for a night of nostalgia, laughter, and catching up with old friends. The event will take place on Fri Jun 06 2025 at 6 :00 at 555 Talbot Ave. Get ready to reminisce about the good old days, share stories, and create new memories with your fellow classmates. It's going to be a night to remember! Don't miss out on this opportunity to reconnect with your classmates and celebrate this special milestone together. We can't wait to see you there!",
        "event_link": "https://www.eventbrite.com/e/class-of-2000-25th-reunion-tickets-1306927598629?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Family & Education Parties",
            "#celebration",
            "#memories",
            "#nostalgia",
            "#25th_reunion",
            "#class_of_2000"
        ]
    },
    {
        "title": "BABY DISCO PARTY",
        "date_time": "Saturday, May 17 · 10am - 12pm EDT",
        "location": "Premiere on Broadway 517 Broadway Somerville, MA 02145 Show map",
        "about": "Kids of every age will love the high-energy excitement of Big Baby Disco! 🎶✨ Step into a dazzling world of flashing lights, disco beats, and non-stop fun! A live DJ will spin classic hits while Girl Glitter teaches legendary dance moves. Adults can join in the fun or sit back and enjoy the show while the little ones light up the dance floor. Plus, plenty of photo-worthy moments and delicious food and drinks available to keep the party going!",
        "event_link": "https://www.eventbrite.com/e/baby-disco-party-tickets-1303271834139?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Parties",
            "Somerville Family & Education Parties",
            "#dance",
            "#children",
            "#family",
            "#free",
            "#music",
            "#fun",
            "#celebration",
            "#baby",
            "#toddlers",
            "#baby_disco_party"
        ]
    },
    {
        "title": "Kids' Art Brunch at the Ford Tavern, Medford",
        "date_time": "Sunday, June 1 · 11:30am - 1pm EDT",
        "location": "The Ford Tavern 61 Locust Street Medford, MA 02155 Show map",
        "about": "Please welcome back, our Kids Art Brunch!! This event sells out every time so grab your tickets now! Join us for a delicious brunch at the Ford Tavern on Sunday, June 1st, 2025. Enjoy a great meal with your family and then drink your coffee hot (or your mimosas cold!) while your kids head to another corner of the restaurant to engage in a teacher-facilitated process art experience. Aimed toward kids of ALL abilities, between the ages of 4-10, the art activity will be facilitated by the amazing Sabrina Huether, M. Ed. Sabrina's incredible experience includes overseeing a Reggio-inspired art studio for children, as well as teaching special education in Medford Public Schools. Sabrina’s objective for this art experience is for children to have a fun-filled opportunity to explore art materials, be creative, immerse in the sensory aspect of art, and enjoy the process. Kids with special needs are always welcomed with open arms. Please be sure children are wearing appropriate clothing for messy art! Tickets are $15 per child, which includes a kid's brunch meal, juice, dessert, and the art project. (Adults and those that are not participating in the art activity do not need to pay in advance.)",
        "event_link": "https://www.eventbrite.com/e/kids-art-brunch-at-the-ford-tavern-medford-tickets-1316895532989?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Medford, MA",
            "Medford Classes",
            "Medford Family & Education Classes",
            "#brunch",
            "#art",
            "#kids",
            "#kidsevents",
            "#medford",
            "#kidsartclasses",
            "#art_class",
            "#kids_activities",
            "#fordtavern"
        ]
    },
    {
        "title": "BLS CPR Classes  & AED Training Boston-CPRClassesBoston.com",
        "date_time": "Wednesday, April 30 · 6:30 - 9:30pm EDT",
        "location": "CPR Certification Boston 1452 Dorchester Avenue #4th fl Boston, MA 02122 Show map",
        "about": "Let’s Book Your CPR Training CPR Certification Boston, MA teaches AHA BLS CPR Classes and First Aid Training in Boston, Massachusetts. Our American Heart Association Basic Life Support CPR Class is hands-on in person and Covers Adult, Child, and Infant CPR and AED machines. Get a Same Day BLS CPR Certification Card with an accredited Boston instructor. On-site Group and Corporate CPR Training is available, or come to one of our classes at our offices. CPR Certification Boston 1452 Dorchester Ave 4th fl, Dorchester, MA 02122, United States (857) 376-4646 www.CPRClassesBoston.com",
        "event_link": "https://www.eventbrite.com/e/bls-cpr-classes-aed-training-boston-cprclassesbostoncom-tickets-1316573549929?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes",
            "#training",
            "#cpr",
            "#healthcare",
            "#certification",
            "#cprclass",
            "#cprtraining",
            "#cpr_class",
            "#cpr_aed",
            "#cprcertification"
        ]
    },
    {
        "title": "Music for Tots!",
        "date_time": "Sunday, May 4 · 4 - 6pm EDT",
        "location": "The Boston Synagogue 55 Martha Road Boston, MA 02114 Show map",
        "about": "Mingle with other parents in our downtown neighborhood, while your tots dance, play instruments & have fun! Highlights: 🎵 Musical activities tailored for kiddos, led by local professional musicians! 🍹 Drinks for adults, as well as plenty of snacks 🤗 Welcoming and family-friendly atmosphere Whether you're a parent, grandparent, or caregiver, this is the perfect opportunity to connect with your child through music and meet other Jewish families in the community! Free. Suggested donation of $5 appreciated!",
        "event_link": "https://www.eventbrite.com/e/music-for-tots-tickets-1130799474669?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Family & Education Performances",
            "#children",
            "#music",
            "#fun",
            "#learning",
            "#tots"
        ]
    },
    {
        "title": "First-Time Homebuyer Workshop-English (Virtual)",
        "date_time": "May 17 · 8:30am - May 18 · 1pm EDT",
        "location": "Online Event Zoom Link will be Emailed 1 day before class Boston, MA 02111 Show map",
        "about": "ACDC's Home Buying Program assists individuals who are seeking, financing, maintaining, renting, or owning a home. Complete our 2-day HUD-certified first-time home buyer workshop to receive a certificate to become eligible for discounted mortgage products. ACDC is a certified member of the MA Home Ownership Collaborative (CHAPA), HUD Local Housing Counseling Agencies, and NCAPACD's Housing Counseling Network; and adheres to the National Industry Home Ownership Education Standards. Workshop fees are non-refundable. Location - Virtual workshop - Zoom Zoom ID and password will be sent via email before workshop. Please note: you must attend both Saturday and Sunday sessions in order to receive your certificate. Schedule: Saturday - 8:30am to 1:00pm Sunday - 8:30am to 1:00pm NOTE: Please use your legal name to sign up for the class. FAQs Is my registration transferrable? The name on your first-time homebuyer certificate will be the same name as your ID. You must attend the full class on Saturday and Sunday in order to receive your certificate. When will I receive my certificate? You will receive your certificate within 10 business days after you attend the 2-day class and sign the required documents. What will the certificate do? The certificate is good for three years. It enables you to apply for special first time homebuyer mortgages, down payment assistance and housing lotteries in Massachusetts.",
        "event_link": "https://www.eventbrite.com/e/first-time-homebuyer-workshop-english-virtual-tickets-1080199117639?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes",
            "#homebuying",
            "#homebuyerseminar",
            "#homebuyer_education",
            "#united_states_events",
            "#massachusetts_events",
            "#boston_classes",
            "#things_to_do_in_boston_ma",
            "#boston_other_classes"
        ]
    },
    {
        "title": "New Englang Boston Aquarium  Senior Adult  Ticket - Bible Tour not included",
        "date_time": "Saturday, May 31 · 10:30am - 1pm EDT",
        "location": "New England Aquarium 1 Central Wharf Boston, MA 02110 Show map",
        "about": "How stunning and complex life on this planet is. The unique creatures in our beautiful oceans are far from simple. They are teaming with complex designs, carefully planned structures, such as the rough shark’s skin, the sea horse’s tail, octopus’ arms, jellyfish, sea turtles, schooling teams, organized navigation, and so much more cool stuff! We take an exciting adventure beneath the earths most mysterious waters, our oceans!!! These tours are designed for Jehovah's Witnesses and interested students of the Bible. Opened on the Boston waterfront in 1969, the New England Aquarium is one of the world's first modern aquariums. Visitors can explore the oceans and visit thousands of marine animals in four levels of world-class exhibits. The species exhibited include harbor and northern fur seals, California sea lions, African and southern rockhopper penguins, giant Pacific octopuses, weedy sea dragons, and thousands of saltwater and freshwater fishes. Refunds can only be given till a specific time since I need to purchase tickets before the event. Group discount tickets are: For Adults $35 – Seniors $33 – Children 3-11 $26 and children under 3 are free This link is for the Adult ticket $35. Other links are available for Seniors and Children. Once tour is over feel free to stay longer and enjoy! These tours are designed for Jehovah's Witnesses and interested students of the Bible. Opened on the Boston waterfront in 1969, the New England Aquarium is one of the world's first modern aquariums. Visitors can explore the oceans and visit thousands of marine animals in four levels of world-class exhibits. The species exhibited include harbor and northern fur seals, California sea lions, African and southern rockhopper penguins, giant Pacific octopuses, weedy seadragons, and thousands of saltwater and freshwater fishes. Refunds can only be given till May 30th since I need to purchase tickets before the event.",
        "event_link": "https://www.eventbrite.com/e/new-englang-boston-aquarium-senior-adult-ticket-bible-tour-not-included-tickets-1333238776069?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Family & Education Tours",
            "#aquarium",
            "#fish"
        ]
    },
    {
        "title": "New Englang Boston Aquarium Adult Group Ticket - Bible Tour not included",
        "date_time": "Saturday, June 14 · 10:20am - 1pm EDT",
        "location": "New England Aquarium 1 Central Wharf Boston, MA 02110 Show map",
        "about": "Opened on the Boston waterfront in 1969, the New England Aquarium is one of the world's first modern aquariums. Visitors can explore the oceans and visit thousands of marine animals in four levels of world-class exhibits. The species exhibited include harbor and northern fur seals, California sea lions, African and southern rockhopper penguins, giant Pacific octopuses, weedy seadragons, and thousands of saltwater and freshwater fishes.  Refunds can only be given till a specific time since I need to purchase tickets before the event.",
        "event_link": "https://www.eventbrite.com/e/new-englang-boston-aquarium-adult-group-ticket-bible-tour-not-included-tickets-1333218585679?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Family & Education Tours",
            "#aquarium",
            "#fish"
        ]
    },
    {
        "title": "Girls in Business Camp Boston 2025",
        "date_time": "Saturday, November 8 · 8am - 12pm EST.Doors at 7:50am",
        "location": "225 Albany St 225 Albany Street Boston, MA 02118 Show map",
        "about": "The Girls in Business Camp Boston 2025 introduces girls to basic business principles including the forms and types of businesses, business strategy, marketing and finance. Each student will be guided through creating her own business and completing the activities below. Name her business Create a mission statement Create a logo Create a slogan or tagline Design a business card Create a marketing plan Create a finance plan including a budget Create a pitch for investors After students create their businesses, each student CEO will pitch a group of mock investors (fellow students) for the funding to launch her start-up. Participating Girl Scouts and Girl Guides meet the qualification to earn a business owner, business plan badge or an entrepreneur badge. Badges are not provided. Ticketing options for ages 9-11 and ages 12-17. For additional information contact us at +1 866-277-2123 extension 2, via email at info@girlsinbusinessinitiative.com or visit our website at www.girlsinbusinessinitiative.com. Please no solicitation emails or calls. We do not book speakers, book vendors or recruit volunteers for events. Frequently Asked Questions Is this event a drop-off? All camps are drop-off unless parent participation is indicated. Parents may wait at the venue for the duration of the camp in any of the lounge or seating area throughout the hotel. The meeting room space capacity can only accommodate students and staff. Is the registration fee refundable? The registration fee is non-refundable unless the organizer cancels the session. If a participant is unable to attend a session a credit will be placed on file that may be used at any time for a future program. The credit does not expire. Is financial assistance available? Due to rising costs associated with hosting events, there is no financial assistance available for this event and there is no promo code for this event. All instructors and support staff undergo background screening. All instructors and support staff are also in compliance with any local ordinances or state/provincial regulations applicable to those working with children. Our Lead Instructors are women that currently or have previously worked in business/executive management.",
        "event_link": "https://www.eventbrite.com/e/girls-in-business-camp-boston-2025-tickets-1299471336749?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Retreats",
            "Boston Family & Education Retreats",
            "#children",
            "#business",
            "#boston",
            "#maine",
            "#entrepreneurship",
            "#entrepreneur",
            "#massachusetts",
            "#bostonevents",
            "#rhodeisland",
            "#massachusettsevents"
        ]
    },
    {
        "title": "Camp Congress for Girls Boston 2025",
        "date_time": "Saturday, November 8 · 8am - 12pm EST.Doors at 7:50am",
        "location": "225 Albany St 225 Albany Street Boston, MA 02118 Show map",
        "about": "Camp Congress for Girls Boston 2025 is a leadership program that introduces girls to United States politics. Camp begins with a lesson on the structure of our political system. Each girl will choose to run for a seat in the US House of Representatives, the US Senate or for the presidency. She will create her own campaign with a platform, campaign finance plan, and film a political ad. All campers will register to vote and then vote in an election. Once elected to Congress and sworn in, the newly installed members of Congress will learn how to introduce a bill, debate the merits of the bill, lobby fellow legislators, collaborate with the Executive branch and finally vote on the proposed bill. Camp will culminate with a ceremonial signing of the bill by our Ms. President. For additional information contact us at +1 866-277-2123 extension 1, via email at info@girlsinpolitics.com or visit our website at www.girlsinpolitics.com. Ticketing options for students ages 8-11 and 12-17. Please no solicitation emails or calls. We do not book speakers, book vendors or recruit volunteers for events. Frequently Asked Questions Is this event a drop-off? All camps are drop-off unless parent participation is indicated. Parents may wait at the venue for the duration of the camp in any of the lounge or seating area throughout the hotel. The meeting room space capacity can only accommodate students and staff. Is the registration fee refundable? The registration fee is non-refundable unless the organizer cancels the session. If a participant is unable to attend a session a credit will be placed on file that may be used at any time for a future program. The credit does not expire. Is this a partisan program or supported by a political party? No, the Girls in Politics Initiative is an independent organization that is self-funded through the fees generated from hosting sessions. The curriculum is civic education. Is financial assistance available? Due to rising costs associated with hosting events, there is no financial assistance available for this event and there is no promo code for this event. Who are the instructors? Our Lead Instructors are women that currently or have previously worked in government or electoral politics. Our support staff are current or former licensed teachers. All instructors and support staff undergo background screening. All instructors and support staff are also in compliance with any local ordinances or state/provincial regulations applicable to those working with children.",
        "event_link": "https://www.eventbrite.com/e/camp-congress-for-girls-boston-2025-tickets-1299481396839?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Retreats",
            "Boston Family & Education Retreats",
            "#education",
            "#boston",
            "#maine",
            "#cambridge",
            "#massachusetts",
            "#teens",
            "#bostonevents",
            "#rhodeisland",
            "#family_friendly",
            "#boston_events"
        ]
    },
    {
        "title": "Camp Congress for Youth Boston 2025",
        "date_time": "Saturday, November 8 · 1 - 5pm EST.Doors at 12:50pm",
        "location": "225 Albany St 225 Albany Street Boston, MA 02118 Show map",
        "about": "Camp Congress for Youth Boston 2025 is a leadership program that introduces girls and boys to the United States political system. Camp begins with a lesson on the structure of our political system. Each student will choose to run for a seat in the US House of Representatives, the US Senate or for the presidency. Students will create a campaign with a platform, campaign finance plan, and film a political ad. All campers will register to vote and then vote in an election. Once elected to Congress and sworn in, the newly installed members of Congress will learn how to introduce a bill, debate the merits of the bill, lobby fellow legislators, collaborate with the Executive branch and finally vote on the proposed bill. Camp will culminate with a ceremonial signing of the bill by our President. All participants will receive Certificate of Completion. Ticketing options for ages 8-11 and ages 12-17. For additional information contact us at +1 866-277-2123 extension 1, via email at info@girlsinpolitics.com or visit our website at www.girlsinpolitics.com. Ticketing options for students ages 8-11 and 12-17. Please no solicitation emails or calls. We do not book speakers, book vendors or recruit volunteers for events. Frequently Asked Questions Is this event a drop-off? All camps are drop-off unless parent participation is indicated. Parents may wait at the venue for the duration of the camp in any of the lounge or seating area throughout the hotel. The meeting room space capacity can only accommodate students and staff. Is the registration fee refundable? The registration fee is non-refundable unless the organizer cancels the session. If a participant is unable to attend a session a credit will be placed on file that may be used at any time for a future program. The credit does not expire. Is this a partisan program or supported by a political party? No, the Girls in Politics Initiative is an independent organization that is self-funded through the fees generated from hosting sessions. The curriculum is civic education. Is financial assistance available? Due to rising costs associated with hosting events, there is no financial assistance available for this event and there is no promo code for this event. Who are the instructors? Our Lead Instructors are women that currently or have previously worked in government or electoral politics. Our support staff are current or former licensed teachers. All instructors and support staff undergo background screening. All instructors and support staff are also in compliance with any local ordinances or state/provincial regulations applicable to those working with children.",
        "event_link": "https://www.eventbrite.com/e/camp-congress-for-youth-boston-2025-tickets-1300046797969?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Retreats",
            "Boston Family & Education Retreats",
            "#children",
            "#family",
            "#education",
            "#boston",
            "#maine",
            "#leadership",
            "#massachusetts",
            "#bostonevents",
            "#rhodeisland",
            "#massachusetts_events"
        ]
    },
    {
        "title": "Fairy Houses: Luminaria Workshop for Parent/Child (GR K-5)",
        "date_time": "Saturday, May 10 · 11:45am - 1:45pm EDT",
        "location": "New Art Center 61 Washington Park Newton, MA 02460 Show map",
        "about": "Make a whimsical luminaria candle-holder to adorn your home this spring! Parents and kids will add their creative twist to a lovely luminaria decoration for themselves or as a gift for friends and family. All houses will be made from red air dry clay and can hold a battery-operated tea light. One registration covers 1 adult and 1 child. If you are interested in bringing more than one child please call our main office. Children must be accompanied by one adult during workshop.",
        "event_link": "https://www.eventbrite.com/e/fairy-houses-luminaria-workshop-for-parentchild-gr-k-5-tickets-1269391336659?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Newton, MA",
            "Newton Classes",
            "Newton Family & Education Classes",
            "#event",
            "#clay",
            "#newton",
            "#clayworkshop",
            "#grade2",
            "#grade3",
            "#grade1",
            "#grade4",
            "#grade5",
            "#childworkshops"
        ]
    },
    {
        "title": "Let’s Talk Fertility: Embracing Hope on the Journey to Parenthood",
        "date_time": "Sunday, September 14 · 10am - 3pm EDT",
        "location": "Granite Links 100 Quarry Hills Drive Quincy, MA 02169 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/lets-talk-fertility-embracing-hope-on-the-journey-to-parenthood-tickets-1335269359599?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Quincy, MA",
            "Quincy Conferences",
            "Quincy Family & Education Conferences"
        ]
    },
    {
        "title": "Gentle Birth Class",
        "date_time": "Tuesday, April 29 · 6 - 8:15pm EDT",
        "location": "Arlington 33 Aberdeen Road Arlington, MA 02476 Show map",
        "about": "In this in person small group class, you will learn how well your body is designed for birth and what to do to tap into this incredible ability!Through presentation, simple but impactful activities, film, gentle movement, relaxation and breathing exercises/scripts and more you will gain the 'body knowledge' to help attain your birth goals. Each week simple practice will help you truly ‘get’ it'. Partners or support person are encouraged to attend for no extra charge. Supplementary materials, resources including specific coping techniques, video, birth planning tools, support person guides and more provided. Learn how your choices, care and support profoundly impact your birth, your emotional health and your life as a parent. Learn how your brain is ‘wired’ to do what you need to do for health and safety of you and your baby. . Most Health Insurance reimburses a substantial portion of the cost of this class. FSA eligible. LGBTQA friendly",
        "event_link": "https://www.eventbrite.com/e/gentle-birth-class-tickets-1316510120209?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Arlington, MA",
            "Arlington Classes",
            "Arlington Family & Education Classes",
            "#empowerment",
            "#pregnancy",
            "#childbirth_education",
            "#natural_birth",
            "#gentle_birth_class"
        ]
    },
    {
        "title": "Luz y Exito 2025",
        "date_time": "Thursday, May 15 · 12:30 - 3pm EDT",
        "location": "GSU Metcalf Hall 775 Commonwealth Ave Boston, MA 02215 Show map",
        "about": "Students should arrive at noon. Doors open for everyone else at 12:30pm. Come celebrate the senior class with a Serape Stole ceremony in the GSU Metcalf Ballroom at 775 Commonwealth Ave, 2nd Floor, Boston, MA 02215. The ceremony will be followed by a reception at The Howard Thurman Center at 808 Commonwealth Ave, Brookline, MA 02446. *Seniors who will be receiving stoles during the ceremony must have an Eventbrite reservation along with their guests.",
        "event_link": "https://www.eventbrite.com/e/luz-y-exito-2025-tickets-1271205402579?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Family & Education Parties",
            "#inspiration",
            "#future",
            "#success",
            "#2025_event",
            "#luz_y_exito"
        ]
    },
    {
        "title": "EdVestors' Annual Showcase",
        "date_time": "Wednesday, May 21 · 4 - 6:30pm EDT",
        "location": "Boston University Center for Computing and Data Sciences (CDS) 665 Commonwealth Avenue Boston, MA 02215 Show map",
        "about": "As policies evolve and traditional measures of educational success are reconsidered in Massachusetts and beyond, we have an opportunity to reimagine how we use data to measure and drive improvement. At this year’s Education Showcase, we’ll feature educators, community partners, researchers, and students to explore how data, especially community-defined and community-informed data, can be a catalyst for improvement. Panelists include: Nicole Agois , Ed.M., Managing Director, Open Door Arts Apryl Clarkson , Senior Executive Director of the Office of Data and Accountability, Boston Public Schools Ariel Tichnor-Wagner , Ph.D., Program Director, MA in Educational Policy Studies & Lecturer, Boston University Wheelock College of Education and Human Development Please join us on Wednesday, May 21st at Boston University's CDS Conference Center ! EdVestors is committed to providing accessibility accommodations for all of our events. Please request disability or language accommodations in your registration at least two weeks prior to the event, or we may not be able to fulfill them. For accessibility resquests or any other questions, please contact Alexia Hernandez at hernandez@edvestors.org . Habrá traducción al español disponible. Al registrarse, por favor háganos saber con al menos dos semanas de anticipación si requiere interpretación al español o contactando a Alexia Hernandez at hernandez@edvestors.org .",
        "event_link": "https://www.eventbrite.com/e/edvestors-annual-showcase-tickets-1295030915329",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Family & Education Other"
        ]
    },
    {
        "title": "Not Your Mother's Mother's Day: A Conversation and Gathering",
        "date_time": "Tuesday, May 13 · 7 - 8:30pm EDT",
        "location": "Hummingbird Books 55 Boylston Street #Suite 5510 Newton, MA 02467 Show map",
        "about": "Join us for an evening of wine, cheese, and conversation with authors Ruthie Ackerman, Amanda Hess, Nicole Graev Lipson, Nancy Reddy, and Domenica Ruta. Through intimate storytelling and candid discussion of their recent releases, they'll challenge worn-out narratives of motherhood, offering fresh perspectives on what it means to mother in the 21st century, both on and off the page. Tickets: $30 (Includes a book; use the add-ons feature to indicate which book you would like with your ticket) $10 (Admission Only) About Hummingbird Books: An independent, local female-owned and operated store, Hummingbird Books is a community destination for an extensive collection of adult and children’s books and showcases a mix of local and widely beloved authors. Hummingbird Books is a magical place where children discover a love of reading. At Hummingbird Books, we believe reading connects us to others as we search for ideas, wisdom, and sometimes just provides a much-needed break from reality. In addition to its book selection, Hummingbird Books offers a variety of games, gift items, candy, and stationery, as well as in-store programming including story times, and book signings.",
        "event_link": "https://www.eventbrite.com/e/not-your-mothers-mothers-day-a-conversation-and-gathering-tickets-1310946549419",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Newton, MA",
            "Newton Festivals",
            "Newton Family & Education Festivals",
            "#celebration",
            "#event",
            "#motherhood",
            "#unique",
            "#mothers_day"
        ]
    },
    {
        "title": "Daddy Daughter Dance",
        "date_time": "Saturday, May 10 · 5 - 8pm EDT",
        "location": "Cambridge Friends School 5 Cadbury Rd Cambridge, MA 02140 Show map",
        "about": "Welcome to the Daddy Daughter Dance! Presented by The Next Dad Up Foundation Get ready for a magical night filled with fun, laughter, and dancing alongside your little princess! This unforgettable evening is the perfect opportunity for dads and daughters to share smiles, create lasting memories, and enjoy each other’s company in a joyful, heartwarming setting. Come dressed to impress in your best attire and get ready to hit the dance floor—because the night belongs to you and your daughter. From sweet tunes and silly moves to heartfelt moments and cherished photos, this will be a night to remember. We’re so glad you’re here. Let the celebration begin!",
        "event_link": "https://www.eventbrite.com/e/daddy-daughter-dance-tickets-1319549862159",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Family & Education Parties",
            "#dance",
            "#love",
            "#event",
            "#daughter",
            "#daddy"
        ]
    },
    {
        "title": "HONOR THY MOTHER Appreciation Luncheon",
        "date_time": "Sunday, May 18 · 2 - 4pm EDT.Doors at 1:50pm",
        "location": "Hibernian Hall 184 Dudley Street #200 Boston, MA 02119 Show map",
        "about": "Welcome to the Honor Thy Mother Appreciation Luncheon! Come join us at Hibernian Hall for a special event dedicated to showing love and gratitude to all the amazing mothers out there. This in-person luncheon will be a heartwarming gathering filled with delicious food, and heartfelt moments. Let's celebrate and appreciate the incredible women who have shaped our lives and nurtured us with their unconditional love. It's a time to honor, cherish, and thank the mothers in our lives for everything they do. Don't miss this opportunity to show your gratitude and make those in your life feel extra special. Join us at the Honor Thy Mother Appreciation Luncheon for a memorable and meaningful experience!",
        "event_link": "https://www.eventbrite.com/e/honor-thy-mother-appreciation-luncheon-tickets-1289546912529",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Galas",
            "Boston Family & Education Galas",
            "#community",
            "#event",
            "#mother",
            "#luncheon",
            "#appreciation",
            "#honor",
            "#community_event",
            "#mothersday2025"
        ]
    },
    {
        "title": "Gentle Birth Class",
        "date_time": "Tuesday, April 29 · 6 - 8:15pm EDT",
        "location": "Arlington 33 Aberdeen Road Arlington, MA 02476 Show map",
        "about": "In this in person small group class, you will learn how well your body is designed for birth and what to do to tap into this incredible ability!Through presentation, simple but impactful activities, film, gentle movement, relaxation and breathing exercises/scripts and more you will gain the 'body knowledge' to help attain your birth goals. Each week simple practice will help you truly ‘get’ it'. Partners or support person are encouraged to attend for no extra charge. Supplementary materials, resources including specific coping techniques, video, birth planning tools, support person guides and more provided. Learn how your choices, care and support profoundly impact your birth, your emotional health and your life as a parent. Learn how your brain is ‘wired’ to do what you need to do for health and safety of you and your baby. . Most Health Insurance reimburses a substantial portion of the cost of this class. FSA eligible. LGBTQA friendly",
        "event_link": "https://www.eventbrite.com/e/gentle-birth-class-tickets-1316510120209",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Arlington, MA",
            "Arlington Classes",
            "Arlington Family & Education Classes",
            "#empowerment",
            "#pregnancy",
            "#childbirth_education",
            "#natural_birth",
            "#gentle_birth_class"
        ]
    },
    {
        "title": "BLS CPR Classes  & AED Training Boston-CPRClassesBoston.com",
        "date_time": "Wednesday, April 30 · 6:30 - 9:30pm EDT",
        "location": "CPR Certification Boston 1452 Dorchester Avenue #4th fl Boston, MA 02122 Show map",
        "about": "Let’s Book Your CPR Training CPR Certification Boston, MA teaches AHA BLS CPR Classes and First Aid Training in Boston, Massachusetts. Our American Heart Association Basic Life Support CPR Class is hands-on in person and Covers Adult, Child, and Infant CPR and AED machines. Get a Same Day BLS CPR Certification Card with an accredited Boston instructor. On-site Group and Corporate CPR Training is available, or come to one of our classes at our offices. CPR Certification Boston 1452 Dorchester Ave 4th fl, Dorchester, MA 02122, United States (857) 376-4646 www.CPRClassesBoston.com",
        "event_link": "https://www.eventbrite.com/e/bls-cpr-classes-aed-training-boston-cprclassesbostoncom-tickets-1316573549929",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes",
            "#training",
            "#cpr",
            "#healthcare",
            "#certification",
            "#cprclass",
            "#cprtraining",
            "#cpr_class",
            "#cpr_aed",
            "#cprcertification"
        ]
    },
    {
        "title": "Fenway Playgroup",
        "date_time": "Friday, May 2 · 10:30 - 11:30am EDT",
        "location": "Fenway Community Center 1282 Boylston Street #123 Boston, MA 02215 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/fenway-playgroup-tickets-1301300036439",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Family & Education Networking",
            "#parents",
            "#community",
            "#toddlers",
            "#playtime",
            "#fenway_playgroup"
        ]
    },
    {
        "title": "Music for Tots!",
        "date_time": "Sunday, May 4 · 4 - 6pm EDT",
        "location": "The Boston Synagogue 55 Martha Road Boston, MA 02114 Show map",
        "about": "Mingle with other parents in our downtown neighborhood, while your tots dance, play instruments & have fun! Highlights: 🎵 Musical activities tailored for kiddos, led by local professional musicians! 🍹 Drinks for adults, as well as plenty of snacks 🤗 Welcoming and family-friendly atmosphere Whether you're a parent, grandparent, or caregiver, this is the perfect opportunity to connect with your child through music and meet other Jewish families in the community! Free. Suggested donation of $5 appreciated!",
        "event_link": "https://www.eventbrite.com/e/music-for-tots-tickets-1130799474669",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Family & Education Performances",
            "#children",
            "#music",
            "#fun",
            "#learning",
            "#tots"
        ]
    },
    {
        "title": "Rite of Passage 2025",
        "date_time": "Thursday, May 15 · 5:30 - 7:30pm EDT",
        "location": "Tsai Performance Center 685 Commonwealth Avenue Boston, MA 02215 Show map",
        "about": "Come celebrate the senior class with a Kente Sole ceremony in the Tsai Performance Center at 685 Commonwealth Ave, Boston, MA 02215. Doors open at 5:30pm! The ceremony will be followed by a reception in the CDS building at 665 Comm Ave. Boston MA 02215. *Seniors who will be receiving stoles during the ceremony must have an Eventbrite reservation along with their guests. *This event DOES NOT take place at The Howard Thurman Center.",
        "event_link": "https://www.eventbrite.com/e/rite-of-passage-2025-tickets-1271043598619?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Family & Education Parties",
            "#ceremony",
            "#transition",
            "#tradition",
            "#milestone",
            "#rite_of_passage_2025"
        ]
    },
    {
        "title": "Retention and Recruitment of Youth",
        "date_time": "Thursday, May 8 · 9am - 12pm EDT",
        "location": "Northeastern Crossing 1175 Tremont Street Boston, MA 02120 Show map",
        "about": "Trainers: Lauren Bard & Paul Gregg, Health Resources in Action Description: This 3-hour training will focus on best practices for the recruitment and retention of youth in summer programming. Participants will have the opportunity to reflect on what motivates youth to engage in their summer programs and identify barriers to recruitment. Participants will also review their program practices to ensure that high levels of engagement and a sense of belonging lead young people to persist in programming. Through interactive activities and reflection, participants will break down barriers, share creative solutions, and strengthen their overall programming. Learning Objectives: As a result of this training, participants will Understand “youth” in the context of a developmental stage as well as a distinct culture Assess their programs for practices that foster belonging Address any barriers to recruitment and retention Review best practices and strategies to improve recruitment and retention Notice of Accommodations English: Interpretation, translation, and disability accommodation services are available to you at no cost. If you need them, please contact us at oyea@boston.gov, LCA@boston.gov or 617-961-6980. Spanish - Español: Hay servicios de interpretación, traducción y adaptaciones para discapacidades a su disposición sin costo alguno. Si los necesita, por favor póngase en contacto con nosotros mandando un correo electrónico a oyea@boston.gov, LCA@boston.gov o llamando a 617-961-6980 Haitian Creole -Kreyòl ayisyen: Sèvis entèpretasyon, tradiksyon, ak sèvis akomodasyon pou andikape disponib pou ou gratis. Si w bezwen sèvis sa yo, tanpri kontakte nou nan oyea@boston.gov, LCA@boston.gov oswa 617-961-6980 Traditional Chinese - 繁體中文: 我們可以為您提供免費的口譯, 筆譯, 和殘疾人士合理照顧服務。如有需要，請 前與我們連絡，發電子郵件至 oyea@boston.gov, LCA@boston.gov 或致電 617-961-6980 Vietnamese - Tiếng Việt: Các dịch vụ thông dịch, dịch thuật và hỗ trợ người khuyết tật được cung cấp miễn phí cho bạn. Nếu bạn cần họ, vui lòng liên lạc với chúng tôi theo địa chỉ oyea@boston.gov, LCA@boston.gov hoặc 617-961-6980 Simplified Chinese - 简体中文: 我们可以为您提供免费的口译, 笔译, 和残疾人士合理照顾服务。如有需要，请 前与我们联系, 发电子邮件至 oyea@boston.gov, LCA@boston.gov 或致电 617-961-6980 Cabo Verdean Creole - kriolu: Nu ta oferese-bu sirvisus di interpretason, traduson y sirvisus di komodason pa gentis ku difisénsia di grasa. Si bu meste kes sirvisu la, kontata-nu pa email oyea@boston.gov, LCA@boston.gov ó pa telefóni, pa númeru 617-961-6980 Arabic - العربية خدمات الترجمة الشفوية والتحريرية والتسهيلات لذوي الإعاقة متوفرة لك دون تحملك أي تكلفة. إذا احتجت لهذه الخدمات، يرجى التواصل معنا على البريد الألكتروني ،oyea@boston.gov, LCA@boston.gov، أو على رقم الهاتف 6179616980 Russian -Русский: Услуги устного и письменного перевода и по приспособлению инвалидов предоставляются бесплатно. Если Вам они нужны, просьба связаться с нами по адресу электронной почты oyea@boston.gov, LCA@boston.gov либо по телефону 617-961-6980 Portuguese - Português: Disponibilizamos serviços de tradução e interpretação e adaptações especiais para pessoas com deficiências gratuitamente. Para solicitar, envie e-mail para oyea@boston.gov, LCA@boston.gov ou ligue para 617-961-6980 French - Français: Les services d'interprétation, de traduction et d'adaptation aux personnes handicapées sont à votre disposition gratuitement. Si vous en avez besoin, veuillez nous contacter à oyea@boston.gov, LCA@boston.gov ou au 617-961-6980 Somali - Af Soomaali: Adeegyada tarjumaadda luuqadaha iyo hoyga naafada ayaa diyaar kuu ah adiga oo aan wax kharash ah ka bixin. Haddii aad u baahatid iyaga, fadlan nagala soo xiriir oyea@boston.gov, LCA@boston.gov ama 617-961-6980",
        "event_link": "https://www.eventbrite.com/e/retention-and-recruitment-of-youth-tickets-1301412061509?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes",
            "#engagement",
            "#youth",
            "#recruitment",
            "#retention",
            "#opportunities"
        ]
    },
    {
        "title": "Nurturing Fathers' Institute - Save the Date",
        "date_time": "Friday, May 16 · 9am - 3:30pm EDT",
        "location": "Carpenters Local Union 750 Dorchester Avenue Dorchester, MA 02125 Show map",
        "about": "2025 Nurturing Fathers’ Institute A fun and informative in-person gathering for new and seasoned Nurturing Fathers' Program facilitators and other providers working with fathers in and near Massachusetts. Plenary panel pressentation, keynote speaker, and w orkshop options, as well as networking opportunities and a nurturing lunch. Event is free; more details to come.",
        "event_link": "https://www.eventbrite.com/e/nurturing-fathers-institute-save-the-date-tickets-1291227198309?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes"
        ]
    },
    {
        "title": "Experiential Learning Expo",
        "date_time": "Friday, May 2 · 3 - 7pm EDT",
        "location": "Center for Computing and Data Sciences (CCDS) at Boston University 665 Commonwealth Avenue Boston, MA 02215 Show map",
        "about": "Join us for an immersive and interactive experience at BU’s Experiential Learning Expo featuring Spark! Demo Day! The Expo, presented by Boston University’s Undergraduate Affairs, will showcase more than 100 student projects undertaken in conjunction with the Cross-College Challenge, the Learning Assistant Program, and BU Spark!’s Demo Day. For more event details, visit bu.edu/expo . Program Highlights: Learning Assistant Program Poster Session 3-5 pm, floor 1 Students completing their first semester as Learning Assistants will showcase their final projects by redesigning a small aspect of the course they taught. Projects combine the pedagogical theory learned throughout the semester with the in-class, experiential practice of teaching. LA-assisted courses are available in the following departments and programs: biology, chemistry, earth and environment, engineering, mathematics, neuroscience, physics, CGS natural sciences, and women’s gender, and sexuality studies. Cross-College Challenge Showcase 3-5 pm, floor 1 The BU Cross-College Challenge (XCC) is the Hub’s signature interdisciplinary project-based, 4-credit elective course open to juniors and seniors from all of BU’s undergraduate schools and colleges. The XCC engages students in team projects that address a real-world problem or an enduring human question. During this event, student teams will present their final projects as part of the following Cross-College Challenge courses: HUB XC420 A1 Music and Dance of Boston’s Brazilian and Caribbean Communities HUB XC421 A1 Unheard Voices: Deconstructing the Dominant Narrative by Inclusion HUB XC422 A1 Exploring Walkability HUB XC433 A1 Border Studies Program/Projects: A Cross-College Challenge at the US-Mexico Border HUB XC433 B1 From Concept to Cart (C2C) : Starting a Consumer Products Business HUB XC433 D1 The Art and Science of Technology Consulting HUB XC435 A1 Spirit of Wonder: Cross-Cultural Storytelling HUB XC436 A1 Bike to BU Additional XCC teams will present as part of BU Spark! Demo Day. BU Spark! Demo Day 4-5:25 pm, floor 2: On-stage presentations 5:30-7 pm, floor 1: Poster sessions Spark! Demo Day is an opportunity for students participating in the Duan Family Spark! Initiative supported courses and programs to showcase their work to members of the BU community and with our partners from industry and civil society who engage with Spark! as project sponsors, instructors, and mentors. Guests will have the opportunity to hear student presentations, visit project demo stations during breakout sessions, and vote on their favorite projects. XCC and Spark! X-lab Classes that will be featured at BU Spark! Demo Day include: HUB XC475: Spark! Technology Innovation Fellowship Course HUB XC410 A1: Spark! Justice Media co-Lab (JMCL) CDS DS488: Spark! UX Design X-Lab Practicum CDS DS519 / CAS CS519: Spark! Software Engineering X-Lab Practicum CDS DS539: Spark! Data Science Practicum CDS DS549 / CAS CS549: Spark! Machine Learning X-Lab Practicum CDS DS594: Spark! Data Visualization X-Lab Practicum CDS DS701: Tools for Data Science Spark! Internship Don't just learn about something - experience it for yourself at our Experiential Learning Expo!",
        "event_link": "https://www.eventbrite.com/e/experiential-learning-expo-tickets-1299308269009?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Expos",
            "Boston Family & Education Expos",
            "#expo",
            "#experientiallearning",
            "#projectbasedlearning",
            "#bostonuniversity"
        ]
    },
    {
        "title": "2025 MyTERN Graduation Ceremony",
        "date_time": "Thursday, May 8 · 6 - 8pm EDT",
        "location": "ASEAN Auditorium, Cabot Intercultural Center 170 Packard Avenue Medford, MA 02155 Show map",
        "about": "Please join us for Tufts University’s fifth MyTERN college and reentry program graduation ceremony! We are excited to celebrate the hard work and struggle, the academic growth, the creation of new dreams, and the care for one another that this year’s incredible cohort of formerly incarcerated students has demonstrated. This graduation ceremony will include the fifth cohort of MyTERN students completing their undergraduate certificate in civic studies from Tufts: Luis Bizzarro, Jody Boykins, Todd Connelly, Sean Ellis, Rocio Lopez, Nathan Miksch, Elba Morales, Tari Richardson, Jason Stiles, and Chiteara Thomas. But after five years, we are now seeing the wild successes of students who continued in school after MyTERN! We will therefore celebrate five students earning their college degrees from different schools, including Tufts University, Boston College, Bunker Hill Community College, and North Shore Community College. Come and listen to students describe the challenges they faced during and after incarceration and the ways they navigate these. Students will discuss what people need post-incarceration not only to survive but also to thrive. And what does it mean to thrive? Yes to housing and yes to employment! But we need more than that as human beings building and rebuilding our selves and lives, relationships and communities. These graduates know it so well and their words always convey moving and powerful lessons. 🍕 There will be food downstairs after the ceremony at 8:00PM. To learn more about reentry and MyTERN, visit our website ; follow us on Instagram ; and listen to our podcast called MyTERN Conversations , on Spotify or wherever you get your podcasts. DIRECTIONS & PARKING INFO 🚙 A QR code at the event will provide discounted or free parking in the Tufts garage – entrance at 419 Boston Avenue. Come up to the 7th floor and exit the building; cross the bridge and the green; walk right toward the elephant statue; cross the street and you will see the building, Cabot Hall.",
        "event_link": "https://www.eventbrite.com/e/2025-mytern-graduation-ceremony-tickets-1334031918379?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Medford, MA",
            "Medford Other",
            "Medford Family & Education Other",
            "#graduation",
            "#somerville",
            "#medford",
            "#tufts",
            "#2025",
            "#mytern",
            "#tischcollege",
            "#tupit"
        ]
    },
    {
        "title": "Level Up! Improve Your Program’s Quality",
        "date_time": "Thursday, May 22 · 10am - 12pm EDT",
        "location": "Bruce C. Bolling Municipal Building 2300 Washington Street 6th Floor Boston, MA 02119 Show map",
        "about": "Trainer: Karen O’Neill Description: We all want what’s best for youth. But do you have a clear vision of what that means at your program? Do you know how and when to make changes to improve the quality of your program? Do you celebrate not just your participants’ successes but your own as well? Come explore how you can make positive, lasting changes at your program and leave with at least one concrete next step you can take to get started. Topics Include: Standards of Program Quality in Youth Programs Assessing Quality at Your Program Continuous Quality Improvement Making long-lasting, meaningful change Celebrating successes & Getting buy-in on change Action Planning for Quality Improvement Notice of Accommodations English: Interpretation, translation, and disability accommodation services are available to you at no cost. If you need them, please contact us at oyea@boston.gov, LCA@boston.gov or 617-961-6980. Spanish - Español: Hay servicios de interpretación, traducción y adaptaciones para discapacidades a su disposición sin costo alguno. Si los necesita, por favor póngase en contacto con nosotros mandando un correo electrónico a oyea@boston.gov, LCA@boston.gov o llamando a 617-961-6980 Haitian Creole -Kreyòl ayisyen: Sèvis entèpretasyon, tradiksyon, ak sèvis akomodasyon pou andikape disponib pou ou gratis. Si w bezwen sèvis sa yo, tanpri kontakte nou nan oyea@boston.gov, LCA@boston.gov oswa 617-961-6980 Traditional Chinese - 繁體中文: 我們可以為您提供免費的口譯, 筆譯, 和殘疾人士合理照顧服務。如有需要，請 前與我們連絡，發電子郵件至 oyea@boston.gov, LCA@boston.gov 或致電 617-961-6980 Vietnamese - Tiếng Việt: Các dịch vụ thông dịch, dịch thuật và hỗ trợ người khuyết tật được cung cấp miễn phí cho bạn. Nếu bạn cần họ, vui lòng liên lạc với chúng tôi theo địa chỉ oyea@boston.gov, LCA@boston.gov hoặc 617-961-6980 Simplified Chinese - 简体中文: 我们可以为您提供免费的口译, 笔译, 和残疾人士合理照顾服务。如有需要，请 前与我们联系, 发电子邮件至 oyea@boston.gov, LCA@boston.gov 或致电 617-961-6980 Cabo Verdean Creole - kriolu: Nu ta oferese-bu sirvisus di interpretason, traduson y sirvisus di komodason pa gentis ku difisénsia di grasa. Si bu meste kes sirvisu la, kontata-nu pa email oyea@boston.gov, LCA@boston.gov ó pa telefóni, pa númeru 617-961-6980 Arabic - العربية خدمات الترجمة الشفوية والتحريرية والتسهيلات لذوي الإعاقة متوفرة لك دون تحملك أي تكلفة. إذا احتجت لهذه الخدمات، يرجى التواصل معنا على البريد الألكتروني ،oyea@boston.gov, LCA@boston.gov، أو على رقم الهاتف 6179616980 Russian -Русский: Услуги устного и письменного перевода и по приспособлению инвалидов предоставляются бесплатно. Если Вам они нужны, просьба связаться с нами по адресу электронной почты oyea@boston.gov, LCA@boston.gov либо по телефону 617-961-6980 Portuguese - Português: Disponibilizamos serviços de tradução e interpretação e adaptações especiais para pessoas com deficiências gratuitamente. Para solicitar, envie e-mail para oyea@boston.gov, LCA@boston.gov ou ligue para 617-961-6980 French - Français: Les services d'interprétation, de traduction et d'adaptation aux personnes handicapées sont à votre disposition gratuitement. Si vous en avez besoin, veuillez nous contacter à oyea@boston.gov, LCA@boston.gov ou au 617-961-6980 Somali - Af Soomaali: Adeegyada tarjumaadda luuqadaha iyo hoyga naafada ayaa diyaar kuu ah adiga oo aan wax kharash ah ka bixin. Haddii aad u baahatid iyaga, fadlan nagala soo xiriir oyea@boston.gov, LCA@boston.gov ama 617-961-6980",
        "event_link": "https://www.eventbrite.com/e/level-up-improve-your-programs-quality-tickets-1301568288789?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes",
            "#improve",
            "#development",
            "#level_up",
            "#event_name",
            "#program_quality"
        ]
    },
    {
        "title": "Brothers United Send Off Brunch 2025",
        "date_time": "Sunday, April 27 · 1 - 4pm EDT",
        "location": "Howard Thurman Center for Common Ground 808 Commonwealth Avenue Brookline, MA 02446 Show map",
        "about": "Celebrate the graduating seniors of Brothers United with a brunch, awards, ceremony, and keynote speaker! This event is open to all students, faculty, and staff. Please submit your award nomination using the link below. https://forms.gle/U2iGXcCAQFnnvhTR7",
        "event_link": "https://www.eventbrite.com/e/brothers-united-send-off-brunch-2025-tickets-1270970479919?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Galas",
            "Brookline Family & Education Galas",
            "#family",
            "#celebration",
            "#send_off",
            "#brunch_2025",
            "#brothers_united"
        ]
    },
    {
        "title": "Creative Youth Lunch & Learn",
        "date_time": "Saturday, May 17 · 1 - 4pm EDT",
        "location": "Civic Pavilion 5 Congress Street Boston, MA 02203 Show map",
        "about": "Welcome to the Creative Youth Lunch & Learn event! Join us on Sat May 17 2025 at 1:00 PM at the Civic Pavilion for an afternoon of creativity and inspiration. This in-person gathering is perfect for young minds eager to explore their artistic talents and learn from industry professionals. Come hungry and ready to soak up knowledge while enjoying a delicious lunch. ✨Creative empowerment sessions ✨Connect through inspiring conversations. ✨Enjoy a free lunch. ✨Vibe to music. ✨Access job placement support. ✨Fun craft making. Space is limited. Please register in advance. See you there! Speaker Highoights : Wendy Mona Miche l, Founder of MINDART Wendy Michel is a neurodivergent founder, creative strategist, and cultural healer reimagining how we build brands, spaces, and movements. As the force behind MINDART and IMAGINE, she's pioneered \"brand therapy\" — a process that transforms personal stories into platforms for change. With roots in Boston and a spirit shaped by global work from Berlin to Haiti, Wendy brings 15+ years of experience in brand building, content strategy, and community engagement for industry giants and grassroots orgs alike. Her mission? To create a world where the language of art transforms people — one campaign, one conversation, one space at a time. More to be announced!",
        "event_link": "https://www.eventbrite.com/e/creative-youth-lunch-learn-tickets-1323596234969?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes",
            "#youth",
            "#event",
            "#learn",
            "#lunch_learn",
            "#creative_youth"
        ]
    },
    {
        "title": "Squirrel Tales Author Visit Story Time: Carrie Kruck and Kari Allen",
        "date_time": "Tuesday, May 6 · 4 - 5pm EDT",
        "location": "Beacon Hill Books & Cafe 71 Charles Street Boston, MA 02114 Show map",
        "about": "Since meeting as pre-published writers in 2016, Kari Allen and Carrie Kruck (aka “Kari-with-a-K” and “Carrie-with-a-C”) have shared not only a name and a passion for children’s literature...they’ve also become the best of friends! And now, after almost a decade of supporting each other through the publishing journey and through life’s ups & downs, they have 15 children’s books between them either published or under contract. Join us for a very special spring reading from Kari and Carrie from their new children’s books about making and nurturing friendships, Alfred Blooms by Carrie Kruck and Maddie & Mabel Make a Friend by Kari Allen. ALFRED BLOOMS by Carrie Kruck (illustrated by Carmen Mok) is a whimsical story of a boy named Alfred who is sure that if he can only grow a beautiful garden, new friends will flock to join him. He spends his days tending to his small patch of dirt, but despite all his efforts, neither flowers nor friendships will bloom. But when Alfred spills a pack of wildflower seeds and accidentally turns himself into a garden, he grows enough courage to share himself with the world and discovers that friendships, like flowers, can grow in surprising ways. MADDIE & MABEL MAKE A FRIEND by Kari Allen is the sixth book in the award-winning Maddie and Mabel K-3 chapter book series. Maddie and Mabel are sisters and best friends. But will their “best” be put to the test when a moving truck pulls up next door? A new friend is exciting at first. But soon it starts to feel like there is not enough room in the playing and laughing and secret-telling for more than two friends. Healing differences and growing friendships will take a lot of listening, curiosity, a little humor, and open hearts. Join us for a very special reading and flower garden craft activity with Kari and Carrie followed by a Q&A and signing!",
        "event_link": "https://www.eventbrite.com/e/squirrel-tales-author-visit-story-time-carrie-kruck-and-kari-allen-tickets-1320421268559?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Family & Education Screenings",
            "#children",
            "#community",
            "#reading",
            "#kids",
            "#storytime",
            "#story",
            "#picturebook"
        ]
    },
    {
        "title": "Squirrel Tales Author Visit: PRIDE with Sarah Prager & Chris Ayala-Kronos",
        "date_time": "Tuesday, June 3 · 4 - 5pm EDT",
        "location": "Beacon Hill Books & Cafe 71 Charles Street Boston, MA 02114 Show map",
        "about": "We are so excited to celebrate Pride month at Beacon Hill Books and Cafe. Join us for a very special Squirrel Tales author visit children's story time collaboration! Enjoy a reading of Under One Rainbow by Chris Ayala-Kronos and Kind Like Marsha by Sarah Prager with coloring, signing, and a rainbow flag craft to follow! Don't miss this joyful celebration of LGBTQ+ history and education with your little one! Recommended for ages 0-8! Sarah Prager is the author of four books on LGBTQ+ history and has spoken on this topic across eight countries. Her writing has appeared in the New York Times, The Atlantic, National Geographic, NBC News, and other national outlets. Sarah will be sharing her picture book Kind Like Marsha: Learning from LGBTQ+ Leaders . Chris Ayala-Kronos is a writer who has been a children’s book editor for more than a decade and holds an MFA in writing for children from Simmons University. Chris lives in Boston, Massachusetts. They will share their newest picture book Under One Rainbow .",
        "event_link": "https://www.eventbrite.com/e/squirrel-tales-author-visit-pride-with-sarah-prager-chris-ayala-kronos-tickets-1334277683469?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Family & Education Screenings",
            "#children",
            "#community",
            "#reading",
            "#kids",
            "#pride",
            "#lgbtq",
            "#storytime",
            "#story",
            "#picturebook",
            "#pridestorytime"
        ]
    },
    {
        "title": "Dr. Paul Lowe: How to Get Accepted into Medical School!",
        "date_time": "Wednesday, May 28 · 7 - 8pm EDT",
        "location": "Boston Admissions Advisors 800 Boylston Street 16th Flr. Boston, MA 02199 Show map",
        "about": "\"How to Get Accepted Into Medical School \" - Dr. Paul Lowe , president and founder of Pinnacle Educational Center Admissions Advisors Group (PinnacleAAG) and managing director of Medical School Admissions Advisors will discuss applying to medical school from college, re-applying to medical school if you were rejected the first (and sometimes the second time around), applying if you are a gap year student. Through Medical School Admissions Advisors, Dr. Lowe’s acceptance rate to medical school is 95%. His clients are from various colleges and universities. See blog: Dr. Lowe's College Clients Who Were Accepted to Medical Schools . Dr. Lowe’s acceptance rate to medical school is 95% Dr. Lowe is one of the world's leading admissions experts and helps college students get admitted to medical schools. Dr. Lowe and his team provides his clients with the competitive advantage, winning strategies and his proprietary knowledge to gain admissions to medical schools. Excellent live webinar for college students who are applying directly from college the first time, reapplying, taken a gap year or who are currently enrolled in a post-bacc program. Visit location affiliate: Pinnacle Educational Center Admissions Advisors Group and register.",
        "event_link": "https://www.eventbrite.com/e/dr-paul-lowe-how-to-get-accepted-into-medical-school-tickets-1332073199799?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Family & Education Seminars",
            "#premed",
            "#premedical",
            "#medicaleducation",
            "#graduate_school",
            "#boston_events",
            "#medical_school",
            "#dr_paul_lowe",
            "#medicalschoolapplication",
            "#medical_school_admission",
            "#drpaullowe"
        ]
    },
    {
        "title": "Acera School Information Session",
        "date_time": "Tuesday, April 29 · 6:30 - 8pm EDT",
        "location": "The Beebe Estate 235 West Foster Street #2 Melrose, MA 02176 Show map",
        "about": "Discover if Acera is the Right Fit for Your Child Join us for an engaging 90-minute information session designed for parents and guardians who want to explore what makes Acera a unique and transformative learning environment. You’ll hear directly from our Founder and Head of School, Courtney Dickinson, as she shares Acera’s mission, educational approach, and the kinds of students who thrive here. Learn how we use project-based learning, interdisciplinary themes, and individualized pacing to ignite curiosity and support students’ growth—academically, socially, and emotionally. You'll have the opportunity to ask questions, hear about life in our classrooms, and stay afterward for informal conversation about admissions, our philosophy, and your child’s potential fit.",
        "event_link": "https://www.eventbrite.com/e/acera-school-information-session-tickets-1309851052759?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Melrose, MA",
            "Melrose Seminars",
            "Melrose Family & Education Seminars",
            "#education",
            "#opportunity",
            "#information_session",
            "#learning_experience",
            "#gifted_education",
            "#mathematics_education",
            "#stem_learning",
            "#acera_school"
        ]
    },
    {
        "title": "Processing in Practice",
        "date_time": "Monday, May 12 · 12 - 1pm EDT",
        "location": "Congregational Library & Archives 14 Beacon Street Boston, MA 02108 Show map",
        "about": "In this hybrid lunch and learn program, our spring archives interns from Simmons University will discuss their experiences processing CLA collections this semester. Rebecca Arabian will discuss processing her first collections as a Library and Information Science student, which include the St. Mark’s Social Center in Roxbury and the Leyden Congregational Church in Brookline. She will share how holding, examining, and reorganizing these materials has given her a new way of engaging with the past. Olivia Murphy will share how experiential learning at the CLA has enabled her to learn ArchivesSpace and employ DACS to process two separate collections: the Salem and Mariner’s Church records, a small Boston church, and the Diversity Club records, a club for the women who worked at 14 Beacon Street. Rebecca and Olivia’s presentations will also provide glimpses into some of the unique materials they discovered while processing these collections this spring. SPEAKER BIOS Rebecca Arabian is an MLIS student at Simmons University. She has enjoyed working with local church records this semester, which have provided her with wonderful views into the rich history of the Boston area. Olivia Murphy is an MLIS student at Simmons University. She is an avid lover of history, books, and Boston, and has been grateful for the opportunity to work at the Congregational Library & Archives this semester.",
        "event_link": "https://www.eventbrite.com/e/processing-in-practice-tickets-1335193713339?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Family & Education Seminars"
        ]
    },
    {
        "title": "Haitian Creole Children’s Storytimes with Boston Public Library",
        "date_time": "Monday, April 28 · 5:30 - 6:30pm EDT",
        "location": "Codman Square Branch of the Boston Public Library 690 Washington Street Boston, MA 02124 Show map",
        "about": "Haitian Creole Children’s Storytimes For the whole community The Codman Square library would like to offer a welcoming space for Haitian families and community members to experience Haitian Creole storytimes with renowned author, artist, and storyteller Charlot Lucien. Vital Village Netwoks in partnership with Boston Public Library Learn more about the Children's Mental Health Storytimes on our website . You can stay up-to-date on our virtual storytimes and other Vital Village Networks opportunities using our calendar .",
        "event_link": "https://www.eventbrite.com/e/haitian-creole-childrens-storytimes-with-boston-public-library-tickets-1261490154009?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes",
            "#children",
            "#mentalhealth",
            "#virtual",
            "#storytimes",
            "#vvnxbpl"
        ]
    },
    {
        "title": "Let's Talk Parenting! Three Part Series",
        "date_time": "Tuesday, April 29 · 5 - 7pm EDT",
        "location": "Boston Children's Hospital and Boston Children's Museum Boston Boston, MA 02210 Show map",
        "about": "This series aims to explore the unique dynamics of parenting within the Latino community, focusing on work-life balance and the challenges of raising children in the digital age. Through insightful discussions and actionable strategies, the initiative will foster meaningful dialogue that empowers all families, parents, caregivers, and professionals seeking culturally relevant and modern parenting approaches. Our series will take place during three different dates and locations: Part One: Cultural Perspectives - Latino Parenting Date and Time: Thursday, March 27, 2025 at 12:00PM ET (Zoom) Part Two: Balancing Parenthood and Professional Life Date and Time: Tuesday, April 29, 2025 at 5:00PM ET (Hybrid) Location: Boston Children's Hospital, 300 Longwood Ave, Boston, MA 02115 Part Thre e: Parenting in the Digital Age Date and Time: Thursday, June 26, 2025 at 5:00PM ET (In-person) Location: Boston Children's Museum, 308 Congress St, Boston, MA 02210",
        "event_link": "https://www.eventbrite.com/e/lets-talk-parenting-three-part-series-tickets-1299931292489?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Family & Education Seminars",
            "#family_support",
            "#child_development",
            "#lets_talk_parenting"
        ]
    },
    {
        "title": "Rite of Passage 2025",
        "date_time": "Thursday, May 15 · 5:30 - 7:30pm EDT",
        "location": "Tsai Performance Center 685 Commonwealth Avenue Boston, MA 02215 Show map",
        "about": "Come celebrate the senior class with a Kente Sole ceremony in the Tsai Performance Center at 685 Commonwealth Ave, Boston, MA 02215. Doors open at 5:30pm! The ceremony will be followed by a reception in the CDS building at 665 Comm Ave. Boston MA 02215. *Seniors who will be receiving stoles during the ceremony must have an Eventbrite reservation along with their guests. *This event DOES NOT take place at The Howard Thurman Center.",
        "event_link": "https://www.eventbrite.com/e/rite-of-passage-2025-tickets-1271043598619",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Family & Education Parties",
            "#ceremony",
            "#transition",
            "#tradition",
            "#milestone",
            "#rite_of_passage_2025"
        ]
    },
    {
        "title": "Retention and Recruitment of Youth",
        "date_time": "Thursday, May 8 · 9am - 12pm EDT",
        "location": "Northeastern Crossing 1175 Tremont Street Boston, MA 02120 Show map",
        "about": "Trainers: Lauren Bard & Paul Gregg, Health Resources in Action Description: This 3-hour training will focus on best practices for the recruitment and retention of youth in summer programming. Participants will have the opportunity to reflect on what motivates youth to engage in their summer programs and identify barriers to recruitment. Participants will also review their program practices to ensure that high levels of engagement and a sense of belonging lead young people to persist in programming. Through interactive activities and reflection, participants will break down barriers, share creative solutions, and strengthen their overall programming. Learning Objectives: As a result of this training, participants will Understand “youth” in the context of a developmental stage as well as a distinct culture Assess their programs for practices that foster belonging Address any barriers to recruitment and retention Review best practices and strategies to improve recruitment and retention Notice of Accommodations English: Interpretation, translation, and disability accommodation services are available to you at no cost. If you need them, please contact us at oyea@boston.gov, LCA@boston.gov or 617-961-6980. Spanish - Español: Hay servicios de interpretación, traducción y adaptaciones para discapacidades a su disposición sin costo alguno. Si los necesita, por favor póngase en contacto con nosotros mandando un correo electrónico a oyea@boston.gov, LCA@boston.gov o llamando a 617-961-6980 Haitian Creole -Kreyòl ayisyen: Sèvis entèpretasyon, tradiksyon, ak sèvis akomodasyon pou andikape disponib pou ou gratis. Si w bezwen sèvis sa yo, tanpri kontakte nou nan oyea@boston.gov, LCA@boston.gov oswa 617-961-6980 Traditional Chinese - 繁體中文: 我們可以為您提供免費的口譯, 筆譯, 和殘疾人士合理照顧服務。如有需要，請 前與我們連絡，發電子郵件至 oyea@boston.gov, LCA@boston.gov 或致電 617-961-6980 Vietnamese - Tiếng Việt: Các dịch vụ thông dịch, dịch thuật và hỗ trợ người khuyết tật được cung cấp miễn phí cho bạn. Nếu bạn cần họ, vui lòng liên lạc với chúng tôi theo địa chỉ oyea@boston.gov, LCA@boston.gov hoặc 617-961-6980 Simplified Chinese - 简体中文: 我们可以为您提供免费的口译, 笔译, 和残疾人士合理照顾服务。如有需要，请 前与我们联系, 发电子邮件至 oyea@boston.gov, LCA@boston.gov 或致电 617-961-6980 Cabo Verdean Creole - kriolu: Nu ta oferese-bu sirvisus di interpretason, traduson y sirvisus di komodason pa gentis ku difisénsia di grasa. Si bu meste kes sirvisu la, kontata-nu pa email oyea@boston.gov, LCA@boston.gov ó pa telefóni, pa númeru 617-961-6980 Arabic - العربية خدمات الترجمة الشفوية والتحريرية والتسهيلات لذوي الإعاقة متوفرة لك دون تحملك أي تكلفة. إذا احتجت لهذه الخدمات، يرجى التواصل معنا على البريد الألكتروني ،oyea@boston.gov, LCA@boston.gov، أو على رقم الهاتف 6179616980 Russian -Русский: Услуги устного и письменного перевода и по приспособлению инвалидов предоставляются бесплатно. Если Вам они нужны, просьба связаться с нами по адресу электронной почты oyea@boston.gov, LCA@boston.gov либо по телефону 617-961-6980 Portuguese - Português: Disponibilizamos serviços de tradução e interpretação e adaptações especiais para pessoas com deficiências gratuitamente. Para solicitar, envie e-mail para oyea@boston.gov, LCA@boston.gov ou ligue para 617-961-6980 French - Français: Les services d'interprétation, de traduction et d'adaptation aux personnes handicapées sont à votre disposition gratuitement. Si vous en avez besoin, veuillez nous contacter à oyea@boston.gov, LCA@boston.gov ou au 617-961-6980 Somali - Af Soomaali: Adeegyada tarjumaadda luuqadaha iyo hoyga naafada ayaa diyaar kuu ah adiga oo aan wax kharash ah ka bixin. Haddii aad u baahatid iyaga, fadlan nagala soo xiriir oyea@boston.gov, LCA@boston.gov ama 617-961-6980",
        "event_link": "https://www.eventbrite.com/e/retention-and-recruitment-of-youth-tickets-1301412061509",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes",
            "#engagement",
            "#youth",
            "#recruitment",
            "#retention",
            "#opportunities"
        ]
    },
    {
        "title": "Nurturing Fathers' Institute - Save the Date",
        "date_time": "Friday, May 16 · 9am - 3:30pm EDT",
        "location": "Carpenters Local Union 750 Dorchester Avenue Dorchester, MA 02125 Show map",
        "about": "2025 Nurturing Fathers’ Institute A fun and informative in-person gathering for new and seasoned Nurturing Fathers' Program facilitators and other providers working with fathers in and near Massachusetts. Plenary panel pressentation, keynote speaker, and w orkshop options, as well as networking opportunities and a nurturing lunch. Event is free; more details to come.",
        "event_link": "https://www.eventbrite.com/e/nurturing-fathers-institute-save-the-date-tickets-1291227198309",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes"
        ]
    },
    {
        "title": "Experiential Learning Expo",
        "date_time": "Friday, May 2 · 3 - 7pm EDT",
        "location": "Center for Computing and Data Sciences (CCDS) at Boston University 665 Commonwealth Avenue Boston, MA 02215 Show map",
        "about": "Join us for an immersive and interactive experience at BU’s Experiential Learning Expo featuring Spark! Demo Day! The Expo, presented by Boston University’s Undergraduate Affairs, will showcase more than 100 student projects undertaken in conjunction with the Cross-College Challenge, the Learning Assistant Program, and BU Spark!’s Demo Day. For more event details, visit bu.edu/expo . Program Highlights: Learning Assistant Program Poster Session 3-5 pm, floor 1 Students completing their first semester as Learning Assistants will showcase their final projects by redesigning a small aspect of the course they taught. Projects combine the pedagogical theory learned throughout the semester with the in-class, experiential practice of teaching. LA-assisted courses are available in the following departments and programs: biology, chemistry, earth and environment, engineering, mathematics, neuroscience, physics, CGS natural sciences, and women’s gender, and sexuality studies. Cross-College Challenge Showcase 3-5 pm, floor 1 The BU Cross-College Challenge (XCC) is the Hub’s signature interdisciplinary project-based, 4-credit elective course open to juniors and seniors from all of BU’s undergraduate schools and colleges. The XCC engages students in team projects that address a real-world problem or an enduring human question. During this event, student teams will present their final projects as part of the following Cross-College Challenge courses: HUB XC420 A1 Music and Dance of Boston’s Brazilian and Caribbean Communities HUB XC421 A1 Unheard Voices: Deconstructing the Dominant Narrative by Inclusion HUB XC422 A1 Exploring Walkability HUB XC433 A1 Border Studies Program/Projects: A Cross-College Challenge at the US-Mexico Border HUB XC433 B1 From Concept to Cart (C2C) : Starting a Consumer Products Business HUB XC433 D1 The Art and Science of Technology Consulting HUB XC435 A1 Spirit of Wonder: Cross-Cultural Storytelling HUB XC436 A1 Bike to BU Additional XCC teams will present as part of BU Spark! Demo Day. BU Spark! Demo Day 4-5:25 pm, floor 2: On-stage presentations 5:30-7 pm, floor 1: Poster sessions Spark! Demo Day is an opportunity for students participating in the Duan Family Spark! Initiative supported courses and programs to showcase their work to members of the BU community and with our partners from industry and civil society who engage with Spark! as project sponsors, instructors, and mentors. Guests will have the opportunity to hear student presentations, visit project demo stations during breakout sessions, and vote on their favorite projects. XCC and Spark! X-lab Classes that will be featured at BU Spark! Demo Day include: HUB XC475: Spark! Technology Innovation Fellowship Course HUB XC410 A1: Spark! Justice Media co-Lab (JMCL) CDS DS488: Spark! UX Design X-Lab Practicum CDS DS519 / CAS CS519: Spark! Software Engineering X-Lab Practicum CDS DS539: Spark! Data Science Practicum CDS DS549 / CAS CS549: Spark! Machine Learning X-Lab Practicum CDS DS594: Spark! Data Visualization X-Lab Practicum CDS DS701: Tools for Data Science Spark! Internship Don't just learn about something - experience it for yourself at our Experiential Learning Expo!",
        "event_link": "https://www.eventbrite.com/e/experiential-learning-expo-tickets-1299308269009",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Expos",
            "Boston Family & Education Expos",
            "#expo",
            "#experientiallearning",
            "#projectbasedlearning",
            "#bostonuniversity"
        ]
    },
    {
        "title": "Brothers United Send Off Brunch 2025",
        "date_time": "Sunday, April 27 · 1 - 4pm EDT",
        "location": "Howard Thurman Center for Common Ground 808 Commonwealth Avenue Brookline, MA 02446 Show map",
        "about": "Celebrate the graduating seniors of Brothers United with a brunch, awards, ceremony, and keynote speaker! This event is open to all students, faculty, and staff. Please submit your award nomination using the link below. https://forms.gle/U2iGXcCAQFnnvhTR7",
        "event_link": "https://www.eventbrite.com/e/brothers-united-send-off-brunch-2025-tickets-1270970479919",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Galas",
            "Brookline Family & Education Galas",
            "#family",
            "#celebration",
            "#send_off",
            "#brunch_2025",
            "#brothers_united"
        ]
    },
    {
        "title": "Haitian Creole Children’s Storytimes with Boston Public Library",
        "date_time": "Monday, April 28 · 5:30 - 6:30pm EDT",
        "location": "Codman Square Branch of the Boston Public Library 690 Washington Street Boston, MA 02124 Show map",
        "about": "Haitian Creole Children’s Storytimes For the whole community The Codman Square library would like to offer a welcoming space for Haitian families and community members to experience Haitian Creole storytimes with renowned author, artist, and storyteller Charlot Lucien. Vital Village Netwoks in partnership with Boston Public Library Learn more about the Children's Mental Health Storytimes on our website . You can stay up-to-date on our virtual storytimes and other Vital Village Networks opportunities using our calendar .",
        "event_link": "https://www.eventbrite.com/e/haitian-creole-childrens-storytimes-with-boston-public-library-tickets-1261490154009",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes",
            "#children",
            "#mentalhealth",
            "#virtual",
            "#storytimes",
            "#vvnxbpl"
        ]
    },
    {
        "title": "Let's Talk Parenting! Three Part Series",
        "date_time": "Tuesday, April 29 · 5 - 7pm EDT",
        "location": "Boston Children's Hospital and Boston Children's Museum Boston Boston, MA 02210 Show map",
        "about": "This series aims to explore the unique dynamics of parenting within the Latino community, focusing on work-life balance and the challenges of raising children in the digital age. Through insightful discussions and actionable strategies, the initiative will foster meaningful dialogue that empowers all families, parents, caregivers, and professionals seeking culturally relevant and modern parenting approaches. Our series will take place during three different dates and locations: Part One: Cultural Perspectives - Latino Parenting Date and Time: Thursday, March 27, 2025 at 12:00PM ET (Zoom) Part Two: Balancing Parenthood and Professional Life Date and Time: Tuesday, April 29, 2025 at 5:00PM ET (Hybrid) Location: Boston Children's Hospital, 300 Longwood Ave, Boston, MA 02115 Part Thre e: Parenting in the Digital Age Date and Time: Thursday, June 26, 2025 at 5:00PM ET (In-person) Location: Boston Children's Museum, 308 Congress St, Boston, MA 02210",
        "event_link": "https://www.eventbrite.com/e/lets-talk-parenting-three-part-series-tickets-1299931292489",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Family & Education Seminars",
            "#family_support",
            "#child_development",
            "#lets_talk_parenting"
        ]
    },
    {
        "title": "Acera School Information Session",
        "date_time": "Tuesday, April 29 · 6:30 - 8pm EDT",
        "location": "The Beebe Estate 235 West Foster Street #2 Melrose, MA 02176 Show map",
        "about": "Discover if Acera is the Right Fit for Your Child Join us for an engaging 90-minute information session designed for parents and guardians who want to explore what makes Acera a unique and transformative learning environment. You’ll hear directly from our Founder and Head of School, Courtney Dickinson, as she shares Acera’s mission, educational approach, and the kinds of students who thrive here. Learn how we use project-based learning, interdisciplinary themes, and individualized pacing to ignite curiosity and support students’ growth—academically, socially, and emotionally. You'll have the opportunity to ask questions, hear about life in our classrooms, and stay afterward for informal conversation about admissions, our philosophy, and your child’s potential fit.",
        "event_link": "https://www.eventbrite.com/e/acera-school-information-session-tickets-1309851052759",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Melrose, MA",
            "Melrose Seminars",
            "Melrose Family & Education Seminars",
            "#education",
            "#opportunity",
            "#information_session",
            "#learning_experience",
            "#gifted_education",
            "#mathematics_education",
            "#stem_learning",
            "#acera_school"
        ]
    },
    {
        "title": "Seaport Smalls",
        "date_time": "Saturday, May 3 · 10 - 11am EDT",
        "location": "111 Harbor Way 111 Harbor Way Boston, MA 02210 Show map",
        "about": "Back by popular demand, Boston Seaport's children's programming series, Seaport Smalls: Free Fun for your Tiny Crew. Join us Saturdays from 10AM-11AM, all year long, for a rotating selection of free children's programming for ages 0-8 years old. Our programming partners include Curious Creatures bringing live animals, Little Groove Music with music and art for kids, Spanish Fun Program , Spanish education, Wiggles & Giggles , musical enrichment classes, Jungle Jim with balloon magic, Mr. Aaron , summer fun music, Music at the Blissful , kids music class, and Davey the Clown , the silliest entertainer in Boston. Refreshments will be available for purchase at Blue Bottle Coffee and Lakon Paris Patisserie. January-April is indoors at The Paseo at 111 Harbor Way. May-October is outdoors at The Rocks at Harbor Way. November-December is indoors at The Paseo at 111 Harbor Way. Convenient parking can be found at the Harbor Way Garage. Please be sure to register on Eventbrite to receive program updates & schedule changes. SCHEDULE MAY 03 LITTLE GROOVE Spanish Music and Movement 10 DAVEY THE CLOWN Silly, Silly, Silly 17 LITTLE GROOVE Music for Kids 24 CURIOUS CREATURES Live Animal Education 31 SPANISH FUN PROGRAM Kathy the Caterpillar Story Time JUNE 07 LITTLE GROOVE Music for Kids 14 CURIOUS CREATURES Live Animal Education 21 SPANISH FUN PROGRAM Spanish Summer Concert Seaport Smalls x Make Music Boston 28 LITTLE GROOVE Summer Music for Kids JULY 05 MR. AARON Summer Party 12 LITTLE GROOVE Spanish Music and Movement 19 CURIOUS CREATURES Live Animal Education 26 JUNGLE JIM Wild About Balloons Magic Show AUGUST 02 WIGGLES & GIGGLES Music & Movement with Miss Joyce 09 LITTLE GROOVE Music for Kids 16 CURIOUS CREATURES Live Animal Education 23 SPANISH FUN PROGRAM Spanish Summer Concert 30 LITTLE GROOVE Music for Kids SEPTEMBER 06 DAVEY THE CLOWN Silly, Silly, Silly 13 LITTLE GROOVE Music for Kids 20 SPANISH FUN PROGRAM Spanish Fun Education 27 CURIOUS CREATURES Live Animal Education OCTOBER 04 LITTLE GROOVE Music for Kids 11 Music at the Blissful Music for Kids 18 Spanish Fun Program El Ratoncito Perez Story Time 25 LITTLE GROOVE Halloween Music for Kids Halloween Event - There will be spooky festivities starting after our show with Little Groove (More details to come). Please note that by taking part in this event, you grant the event organizers full rights to use the images resulting from photography/video filming. If you do not wish to be photographed, please let the photographer know. This event is brought to you by @Seaportbos . All programming is free and open to the public. RSVPs/Tickets not required to participate. About Boston Seaport Culture, industry and community converge making Boston's Seaport district a dynamic and vibrant area that has quickly emerged as one of the most exciting neighborhoods and destinations in the country. Seaport is currently Boston's single largest development project. WS Development is transforming 33 acres of waterfront land with a carefully selected mix of residential, hotel, office, retail, entertainment, civic and cultural uses, and public open space across the district. Combining the best of historic and modern-day Boston, Seaport is positioned to become the destination for fashion, culture, arts, dining and entertainment, and technology and life sciences, expanding Boston's position as one of the top cities in the world. For more information visit www.bostonseaport.xyz , follow Boston Seaport on Facebook , and @SeaportBos on Instagram and Twitter .",
        "event_link": "https://www.eventbrite.com/e/seaport-smalls-tickets-1304647077529?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes",
            "#seaport",
            "#babies",
            "#toddlers",
            "#mommyandme",
            "#family_friendly",
            "#childrens_activities",
            "#seaportsmalls"
        ]
    },
    {
        "title": "Newton Cantonese School Free Online Tours and In-Person",
        "date_time": "Saturday, May 3 · 9:30am - 12:30pm EDT",
        "location": "Bigelow Middle School 42 Vernon Street Newton, MA 02458 Show map",
        "about": "We are excited to announce that registration for the Newton Cantonese School 2024-2025 school year is now open! Our first day of school will be Saturday, September 7, 2024. Classes will be held in person at Bigelow Middle School in Newton, with additional online one-on-one tutoring sessions available.We welcome students of all ages, starting from 4 years old to adults. Additionally, we are seeking enthusiastic teachers to join us in promoting the Cantonese language and culture.For more information, please contact us at newtoncantoneseschool@gmail.com.Please use registration link below: https://www.emailmeform.com/builder/form/8bl82eAfoVO9jLd",
        "event_link": "https://www.eventbrite.com/e/newton-cantonese-school-free-online-tours-and-in-person-tickets-1001932566277?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Newton, MA",
            "Newton Tours",
            "Newton Family & Education Tours",
            "#school",
            "#tours",
            "#cantonese",
            "#newton",
            "#inperson"
        ]
    },
    {
        "title": "Graduation Party at Lamplighter Broadway",
        "date_time": "Friday, May 16 · 4 - 11:30pm EDT",
        "location": "Lamplighter Brewing Co. - Broadway 284 Broadway Cambridge, MA 02139 Show map",
        "about": "Queue Pomp & Circumstance because we're throwing a Graduation Party at our Lamplighter Broadway Taproom!! Whether you're graduating or not, come celebrate the Class of 2025! We'll be playing graduation-themed games, screening iconic graduation movies, and we'll even have \"superlative\" pitchers! Come in a graduation cap or gown for free entry into a raffle, and if you're graduating (bring your student ID to show a bartender), you'll also get a little freebie. A lot of our regulars are students from the nearby universities, and we want to celebrate all of you! So join us in raising a glass to the class of 2025! Please note that this event is 21+ and all guests must show a valid government-issued ID upon entry to our taproom. All space and seating is first come first serve, and an RSVP here does not guarantee entry. Questions? Get in touch: events@lamplighterbrewing.com.",
        "event_link": "https://www.eventbrite.com/e/graduation-party-at-lamplighter-broadway-tickets-1333241584469?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Family & Education Parties",
            "#celebration",
            "#memories",
            "#class_of_2021",
            "#graduation_party",
            "#lamplighter_broadway"
        ]
    },
    {
        "title": "Squirrel Tales Author Visit Story Time: When You Find a Hope",
        "date_time": "Tuesday, May 20 · 4 - 5pm EDT",
        "location": "Beacon Hill Books & Cafe 71 Charles Street Boston, MA 02114 Show map",
        "about": "Allie Millington is the author of heartfelt books for the young and young at heart. Her debut middle grade novel, Olivetti , was an instant USA Today Bestseller and Indie Bookstore Bestseller, received a glowing review in the New York Times by Tom Hanks, and made several Best of 2024 Lists including School Library Journal, NPR, and The Boston Globe. When You Find a Hope is Allie's debut picture book. In this tale of unexplained wonder, there is a tree that grows hope from its branches. A curious girl visits the tree and plucks the largest, brightest hope she can find. Her hope can float, so she tethers it to her side and takes it with her everywhere. When the unimaginable happens and her hope is crushed, the girl pieces her hope back together and drags it along behind her until even the pieces are lost. Or are they? Looking back, she finds that small trees have begun to sprout in her wake, the beautiful offerings of her now firmly rooted, thriving hope. Join us for a story time reading, activity, and signing with author Allie Millington!",
        "event_link": "https://www.eventbrite.com/e/squirrel-tales-author-visit-story-time-when-you-find-a-hope-tickets-1320436233319?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Family & Education Screenings",
            "#children",
            "#community",
            "#reading",
            "#kids",
            "#storytime",
            "#spring",
            "#hope",
            "#story",
            "#kidsactivity",
            "#picturebook"
        ]
    },
    {
        "title": "Community Stroller Walk with the Goddardschool",
        "date_time": "Sunday, May 25 · 9am - 1pm EDT",
        "location": "The Goddard School 100 1st Avenue Boston, MA 02129 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/community-stroller-walk-with-the-goddardschool-tickets-1320456554099?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Family & Education Events",
            "#community",
            "#family_friendly",
            "#outdoor_activity",
            "#goddardschool",
            "#stroller_walk"
        ]
    },
    {
        "title": "Children's Author Visit Story Time: Tricky Chopsticks by Sylvia Chen",
        "date_time": "Saturday, May 31 · 3 - 4pm EDT",
        "location": "Beacon Hill Books & Cafe 71 Charles Street Boston, MA 02114 Show map",
        "about": "Born and raised in New York, in her elementary school years, Sylvia Chen created picture books with wallpaper-wrapped covers bound by duct tape and even won the Ezra Jack Keats Bookmaking Competition Memorial Award twice! Now Sylvia currently resides in New Jersey with her husband and two sons. She loves crafting picture books that spark kids’ interest in STEAM and creative thinking, and often stays up late into the night puzzling away with wordplay and working on quirky ideas. Tricky Chopsticks tells the story of a young Chinese American girl who uses creative STEAM-powered problem-solving to master chopsticks so she can pick up her dumplings and eat them, too! Join us for a story time reading, fun chopsticks games and activities, and signing with author Sylvia Chen!",
        "event_link": "https://www.eventbrite.com/e/childrens-author-visit-story-time-tricky-chopsticks-by-sylvia-chen-tickets-1320489943969?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Family & Education Screenings",
            "#children",
            "#community",
            "#reading",
            "#kids",
            "#storytime",
            "#story",
            "#kidsactivity",
            "#picturebook"
        ]
    },
    {
        "title": "Baby Shower",
        "date_time": "Sunday, June 1 · 1 - 5pm EDT",
        "location": "31 St Denis Ave 31 Saint Denis Avenue Medford, MA 02155 Show map",
        "about": "Baby Shower Ladies, Come join us for a special baby shower celebration at Michelle's! It's going to be a fun-filled event with games, and delicious treats. Let's shower the mom-to-be with love and well wishes as she prepares for her little one's arrival. Don't forget to RSVP so we can make sure to have enough goodies for everyone. See you there!",
        "event_link": "https://www.eventbrite.com/e/baby-shower-tickets-1321077080109?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Medford, MA",
            "Medford Parties",
            "Medford Family & Education Parties",
            "#gifts",
            "#games",
            "#cake",
            "#diapers",
            "#decorations"
        ]
    },
    {
        "title": "WORC² presents:  Fatherhood Saturday",
        "date_time": "Saturday, June 7 · 11am - 2pm EDT",
        "location": "WORC² 2511 Washington Street Boston, MA 02119 Show map",
        "about": "Fatherhood Saturdays:  Build.  Bond.  Belong! WORC ² in collaboration with the City's Office of Black Male Advancement presents: Fatherhood Saturday Choose a DIY woodworking project (candy dispenser, guitar, birdhouse, etc) Build & paint together with guidance from local builders Snap a family photo to capture the day Enjoy snacks, music, and family-friendly fun ** RSVP  required -- linited spots available. Let's put tools in hands and smiles on faces. Because every family deserves moments like this.",
        "event_link": "https://www.eventbrite.com/e/worc2-presents-fatherhood-saturday-tickets-1312949911529?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Family & Education Seminars",
            "#community",
            "#workshops",
            "#event",
            "#worc2_presents",
            "#fatherhood_saturday"
        ]
    },
    {
        "title": "Talking with Toys at the Mill Cafe",
        "date_time": "Thursday, May 22 · 10 - 11am EDT",
        "location": "The Mill Cafe 14 Mill Street Arlington, MA 02476 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/talking-with-toys-at-the-mill-cafe-tickets-1295804659619?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Arlington, MA",
            "Arlington Other",
            "Arlington Family & Education Other",
            "#free",
            "#kids",
            "#playgroup",
            "#speechtherapy",
            "#arlingtonma",
            "#child_development",
            "#speech_development",
            "#mill_cafe",
            "#langauge_development"
        ]
    },
    {
        "title": "Talking with Toys",
        "date_time": "Thursday, May 29 · 10 - 11am EDT",
        "location": "Watertown Free Public Library 123 Main Street Watertown, MA 02472 Show map",
        "about": "Talking with Toys is a free, hands-on learning experience designed for caregivers/parents and their young language learners (aged 1-3). This event is more of a playgroup than a presentation, with caregivers and children exploring various toy stations while a pediatric speech-language pathologist walks around to demonstrate language-enhancing strategies in real-time. Parents see these strategies in action, ask questions, and gain valuable insights into expected language and play skills. It’s perfect for supporting children’s communication development through play!",
        "event_link": "https://www.eventbrite.com/e/talking-with-toys-tickets-1291251862079?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Watertown Town, MA",
            "Watertown Town Other",
            "Watertown Town Family & Education Other",
            "#fun",
            "#kids",
            "#conversation",
            "#play",
            "#toys",
            "#interaction",
            "#speechtherapy",
            "#child_development",
            "#language_development",
            "#speech_development"
        ]
    },
    {
        "title": "#GraduatesClub Virtual Job Fair / Career Expo Event #Boston #BOS",
        "date_time": "N/A",
        "location": "N/A",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/graduatesclub-virtual-job-fair-career-expo-event-boston-bos-tickets-780154772927?aff=ebdssbdestsearch",
        "tags": []
    },
    {
        "title": "Official In-Person Historical Tour of Harvard",
        "date_time": "Friday, May 2 · 1:30 - 2:30pm EDT",
        "location": "Harvard University Visitor Center, Smith Campus Center 1350 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "Enjoy the sights of Harvard Yard on this student-led in-person tour of Harvard University. The tour showcases Harvard's campus and provides a history of the University, general information, and insight into the student's individual experience. The free walking tour runs 45-60 minutes. This is not an admissions tour. To sign up for a campus tour with the Harvard College Admissions Visitor Center, please see their website .",
        "event_link": "https://www.eventbrite.com/e/official-in-person-historical-tour-of-harvard-tickets-1337467203409?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Tours",
            "Cambridge Family & Education Tours",
            "#college",
            "#harvard",
            "#harvard_university",
            "#college_tour",
            "#historical_tour",
            "#student_led",
            "#walking_tour",
            "#campus_tour",
            "#visit_harvard"
        ]
    },
    {
        "title": "Story Time with Rosalita's Puppets at the Boston Public Market",
        "date_time": "Saturday, May 24 · 10 - 10:45am EDT",
        "location": "Boston Public Market 100 Hanover Street Boston, MA 02108 Show map",
        "about": "Join us in the Nook for Story Time with Rosalita's Puppets 📚 Enjoy a series of engaging stories and enjoy the chance to meet new puppet friends. This free performance is sure to be fun for the whole family! Limited spots are available, so please arrive on time to guarantee admission. No advanced registration required.",
        "event_link": "https://www.eventbrite.com/e/story-time-with-rosalitas-puppets-at-the-boston-public-market-tickets-1219498114689?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Family & Education Other",
            "#children",
            "#reading",
            "#boston",
            "#kids",
            "#storytelling",
            "#puppets",
            "#things_to_do_in_boston"
        ]
    },
    {
        "title": "KACL-NE Children's Day Spectacle Island Adventure",
        "date_time": "Saturday, May 24 · 10am - 3:30pm EDT.Doors at 9:30am",
        "location": "Spectacle Island 21 Second Boston, MA 02129 Show map",
        "about": "Children's Day with KACL-NE for Spectacle Island Adventure Join us for a fun-filled day at Spectacle Island ! Our event, Children's Day - KACL-NE Spectacle Island Adventure , is packed with exciting activities for kids of all ages. From K-pop dance lesson, Taekwondo demonstrations, Nanta Drumming and Korean food, there's something for everyone. Bring your family, pack a picnic basket, blanket and your kite! National Children’s Day in Korea is celebrated in May. Children’s Day is a way for Korea to celebrate the children of the country. It’s an opportunity for parents to take a break from their busy lives and spend quality time with their children. To say “Children’s Day” in Korean, you can say 어린이날 (eorininal). This word is made up of the word for children (어린이 | eorini) and the word for day (날 | nal). It is, therefore, easy to learn and remember. In Korea Children’s Day is a public holiday. The Korean-American Citizens League of New England will host Children's Day at Spectable Island, come explore the beauty of the island with your little ones and make unforgettable memories. Don't miss out on this special event!",
        "event_link": "https://www.eventbrite.com/e/kacl-ne-childrens-day-spectacle-island-adventure-tickets-1303760696339?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Family & Education Parties",
            "#parents",
            "#adventure",
            "#fun",
            "#kids",
            "#american",
            "#korean",
            "#island",
            "#boatride",
            "#spectacleisland",
            "#childrensday"
        ]
    },
    {
        "title": "Graduation Party at Lamplighter Broadway",
        "date_time": "Friday, May 16 · 4 - 11:30pm EDT",
        "location": "Lamplighter Brewing Co. - Broadway 284 Broadway Cambridge, MA 02139 Show map",
        "about": "Queue Pomp & Circumstance because we're throwing a Graduation Party at our Lamplighter Broadway Taproom!! Whether you're graduating or not, come celebrate the Class of 2025! We'll be playing graduation-themed games, screening iconic graduation movies, and we'll even have \"superlative\" pitchers! Come in a graduation cap or gown for free entry into a raffle, and if you're graduating (bring your student ID to show a bartender), you'll also get a little freebie. A lot of our regulars are students from the nearby universities, and we want to celebrate all of you! So join us in raising a glass to the class of 2025! Please note that this event is 21+ and all guests must show a valid government-issued ID upon entry to our taproom. All space and seating is first come first serve, and an RSVP here does not guarantee entry. Questions? Get in touch: events@lamplighterbrewing.com.",
        "event_link": "https://www.eventbrite.com/e/graduation-party-at-lamplighter-broadway-tickets-1333241584469",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Family & Education Parties",
            "#celebration",
            "#memories",
            "#class_of_2021",
            "#graduation_party",
            "#lamplighter_broadway"
        ]
    },
    {
        "title": "Squirrel Tales Author Visit Story Time: When You Find a Hope",
        "date_time": "Tuesday, May 20 · 4 - 5pm EDT",
        "location": "Beacon Hill Books & Cafe 71 Charles Street Boston, MA 02114 Show map",
        "about": "Allie Millington is the author of heartfelt books for the young and young at heart. Her debut middle grade novel, Olivetti , was an instant USA Today Bestseller and Indie Bookstore Bestseller, received a glowing review in the New York Times by Tom Hanks, and made several Best of 2024 Lists including School Library Journal, NPR, and The Boston Globe. When You Find a Hope is Allie's debut picture book. In this tale of unexplained wonder, there is a tree that grows hope from its branches. A curious girl visits the tree and plucks the largest, brightest hope she can find. Her hope can float, so she tethers it to her side and takes it with her everywhere. When the unimaginable happens and her hope is crushed, the girl pieces her hope back together and drags it along behind her until even the pieces are lost. Or are they? Looking back, she finds that small trees have begun to sprout in her wake, the beautiful offerings of her now firmly rooted, thriving hope. Join us for a story time reading, activity, and signing with author Allie Millington!",
        "event_link": "https://www.eventbrite.com/e/squirrel-tales-author-visit-story-time-when-you-find-a-hope-tickets-1320436233319",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Family & Education Screenings",
            "#children",
            "#community",
            "#reading",
            "#kids",
            "#storytime",
            "#spring",
            "#hope",
            "#story",
            "#kidsactivity",
            "#picturebook"
        ]
    },
    {
        "title": "Community Stroller Walk with the Goddardschool",
        "date_time": "Sunday, May 25 · 9am - 1pm EDT",
        "location": "The Goddard School 100 1st Avenue Boston, MA 02129 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/community-stroller-walk-with-the-goddardschool-tickets-1320456554099",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Family & Education Events",
            "#community",
            "#family_friendly",
            "#outdoor_activity",
            "#goddardschool",
            "#stroller_walk"
        ]
    },
    {
        "title": "Children's Author Visit Story Time: Tricky Chopsticks by Sylvia Chen",
        "date_time": "Saturday, May 31 · 3 - 4pm EDT",
        "location": "Beacon Hill Books & Cafe 71 Charles Street Boston, MA 02114 Show map",
        "about": "Born and raised in New York, in her elementary school years, Sylvia Chen created picture books with wallpaper-wrapped covers bound by duct tape and even won the Ezra Jack Keats Bookmaking Competition Memorial Award twice! Now Sylvia currently resides in New Jersey with her husband and two sons. She loves crafting picture books that spark kids’ interest in STEAM and creative thinking, and often stays up late into the night puzzling away with wordplay and working on quirky ideas. Tricky Chopsticks tells the story of a young Chinese American girl who uses creative STEAM-powered problem-solving to master chopsticks so she can pick up her dumplings and eat them, too! Join us for a story time reading, fun chopsticks games and activities, and signing with author Sylvia Chen!",
        "event_link": "https://www.eventbrite.com/e/childrens-author-visit-story-time-tricky-chopsticks-by-sylvia-chen-tickets-1320489943969",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Family & Education Screenings",
            "#children",
            "#community",
            "#reading",
            "#kids",
            "#storytime",
            "#story",
            "#kidsactivity",
            "#picturebook"
        ]
    },
    {
        "title": "#GraduatesClub Virtual Job Fair / Career Expo Event #Boston #BOS",
        "date_time": "N/A",
        "location": "N/A",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/graduatesclub-virtual-job-fair-career-expo-event-boston-bos-tickets-780154772927",
        "tags": []
    },
    {
        "title": "Official In-Person Historical Tour of Harvard",
        "date_time": "Friday, May 2 · 1:30 - 2:30pm EDT",
        "location": "Harvard University Visitor Center, Smith Campus Center 1350 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "Enjoy the sights of Harvard Yard on this student-led in-person tour of Harvard University. The tour showcases Harvard's campus and provides a history of the University, general information, and insight into the student's individual experience. The free walking tour runs 45-60 minutes. This is not an admissions tour. To sign up for a campus tour with the Harvard College Admissions Visitor Center, please see their website .",
        "event_link": "https://www.eventbrite.com/e/official-in-person-historical-tour-of-harvard-tickets-1337467203409",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Tours",
            "Cambridge Family & Education Tours",
            "#college",
            "#harvard",
            "#harvard_university",
            "#college_tour",
            "#historical_tour",
            "#student_led",
            "#walking_tour",
            "#campus_tour",
            "#visit_harvard"
        ]
    },
    {
        "title": "Newton Cantonese School Free Online Tours and In-Person",
        "date_time": "Saturday, May 3 · 9:30am - 12:30pm EDT",
        "location": "Bigelow Middle School 42 Vernon Street Newton, MA 02458 Show map",
        "about": "We are excited to announce that registration for the Newton Cantonese School 2024-2025 school year is now open! Our first day of school will be Saturday, September 7, 2024. Classes will be held in person at Bigelow Middle School in Newton, with additional online one-on-one tutoring sessions available.We welcome students of all ages, starting from 4 years old to adults. Additionally, we are seeking enthusiastic teachers to join us in promoting the Cantonese language and culture.For more information, please contact us at newtoncantoneseschool@gmail.com.Please use registration link below: https://www.emailmeform.com/builder/form/8bl82eAfoVO9jLd",
        "event_link": "https://www.eventbrite.com/e/newton-cantonese-school-free-online-tours-and-in-person-tickets-1001932566277",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Newton, MA",
            "Newton Tours",
            "Newton Family & Education Tours",
            "#school",
            "#tours",
            "#cantonese",
            "#newton",
            "#inperson"
        ]
    },
    {
        "title": "Seaport Smalls",
        "date_time": "Saturday, May 3 · 10 - 11am EDT",
        "location": "111 Harbor Way 111 Harbor Way Boston, MA 02210 Show map",
        "about": "Back by popular demand, Boston Seaport's children's programming series, Seaport Smalls: Free Fun for your Tiny Crew. Join us Saturdays from 10AM-11AM, all year long, for a rotating selection of free children's programming for ages 0-8 years old. Our programming partners include Curious Creatures bringing live animals, Little Groove Music with music and art for kids, Spanish Fun Program , Spanish education, Wiggles & Giggles , musical enrichment classes, Jungle Jim with balloon magic, Mr. Aaron , summer fun music, Music at the Blissful , kids music class, and Davey the Clown , the silliest entertainer in Boston. Refreshments will be available for purchase at Blue Bottle Coffee and Lakon Paris Patisserie. January-April is indoors at The Paseo at 111 Harbor Way. May-October is outdoors at The Rocks at Harbor Way. November-December is indoors at The Paseo at 111 Harbor Way. Convenient parking can be found at the Harbor Way Garage. Please be sure to register on Eventbrite to receive program updates & schedule changes. SCHEDULE MAY 03 LITTLE GROOVE Spanish Music and Movement 10 DAVEY THE CLOWN Silly, Silly, Silly 17 LITTLE GROOVE Music for Kids 24 CURIOUS CREATURES Live Animal Education 31 SPANISH FUN PROGRAM Kathy the Caterpillar Story Time JUNE 07 LITTLE GROOVE Music for Kids 14 CURIOUS CREATURES Live Animal Education 21 SPANISH FUN PROGRAM Spanish Summer Concert Seaport Smalls x Make Music Boston 28 LITTLE GROOVE Summer Music for Kids JULY 05 MR. AARON Summer Party 12 LITTLE GROOVE Spanish Music and Movement 19 CURIOUS CREATURES Live Animal Education 26 JUNGLE JIM Wild About Balloons Magic Show AUGUST 02 WIGGLES & GIGGLES Music & Movement with Miss Joyce 09 LITTLE GROOVE Music for Kids 16 CURIOUS CREATURES Live Animal Education 23 SPANISH FUN PROGRAM Spanish Summer Concert 30 LITTLE GROOVE Music for Kids SEPTEMBER 06 DAVEY THE CLOWN Silly, Silly, Silly 13 LITTLE GROOVE Music for Kids 20 SPANISH FUN PROGRAM Spanish Fun Education 27 CURIOUS CREATURES Live Animal Education OCTOBER 04 LITTLE GROOVE Music for Kids 11 Music at the Blissful Music for Kids 18 Spanish Fun Program El Ratoncito Perez Story Time 25 LITTLE GROOVE Halloween Music for Kids Halloween Event - There will be spooky festivities starting after our show with Little Groove (More details to come). Please note that by taking part in this event, you grant the event organizers full rights to use the images resulting from photography/video filming. If you do not wish to be photographed, please let the photographer know. This event is brought to you by @Seaportbos . All programming is free and open to the public. RSVPs/Tickets not required to participate. About Boston Seaport Culture, industry and community converge making Boston's Seaport district a dynamic and vibrant area that has quickly emerged as one of the most exciting neighborhoods and destinations in the country. Seaport is currently Boston's single largest development project. WS Development is transforming 33 acres of waterfront land with a carefully selected mix of residential, hotel, office, retail, entertainment, civic and cultural uses, and public open space across the district. Combining the best of historic and modern-day Boston, Seaport is positioned to become the destination for fashion, culture, arts, dining and entertainment, and technology and life sciences, expanding Boston's position as one of the top cities in the world. For more information visit www.bostonseaport.xyz , follow Boston Seaport on Facebook , and @SeaportBos on Instagram and Twitter .",
        "event_link": "https://www.eventbrite.com/e/seaport-smalls-tickets-1304647077529",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Family & Education Classes",
            "#seaport",
            "#babies",
            "#toddlers",
            "#mommyandme",
            "#family_friendly",
            "#childrens_activities",
            "#seaportsmalls"
        ]
    }
]