[
    {
        "title": "The WBUR Festival",
        "date_time": "N/A",
        "location": "Boston University Commonwealth Avenue Boston, MA 02215 Show map",
        "about": "We’re celebrating WBUR’s 75th birthday with a big bash for the city we love. The three-day lineup will feature captivating conversations, musical performances, multiple stages and a lively street scene. It will be serious stuff, and wicked fun, too.",
        "event_link": "https://www.eventbrite.com/e/the-wbur-festival-tickets-982066847377?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Festivals",
            "Boston Film & Media Festivals",
            "#business",
            "#boston",
            "#environment",
            "#event",
            "#festival",
            "#politics",
            "#news",
            "#npr",
            "#april",
            "#live_music"
        ]
    },
    {
        "title": "Brice And Wen Present: Boston",
        "date_time": "Wednesday, May 14 · 6 - 11:30pm EDT",
        "location": "Game On! 82 Lansdowne Street Boston, MA 02215 Show map",
        "about": "Get ready, Boston! Brice Izyah and Wendell Holland are bringing their reality TV squad to town for another EPIC Survivor 48 Watch Party! Join us at GameOn Fenway, where the doors open at 6, Survivor kicks off at 8, and the party vibes last until midnight! You never know who might pop up at a Brice and Wen event—this is one night you don’t want to miss!",
        "event_link": "https://www.eventbrite.com/e/brice-and-wen-present-boston-tickets-1228084035409?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#boston",
            "#event",
            "#watchparty",
            "#survivor",
            "#present",
            "#briceandwen",
            "#survivor48"
        ]
    },
    {
        "title": "2025 International Religion and Film Conference in Boston",
        "date_time": "May 29 · 5pm - May 31 · 8pm EDT",
        "location": "Boston University School of Theology 745 Commonwealth Avenue Boston, MA 02215 Show map",
        "about": "Boston University and The Journal of Religion & Film cordially invite you to The 2025 International Conference on Religion & Film to be held on the campus of Boston University School of Theology May 29-31, 2025 Theme—Religion and Film: Conflict and Reconciliation Conflict and its resolution are at the heart of most movies. As Wes Anderson put it, “There's no story if there isn’t some conflict.” From its beginnings, cinema has offered us compelling visions of interpersonal discord and international conflict, social struggle and division, terrorism and genocide—but also stirring portrayals of reconciliation and forgiveness. Religion has often stood at the center of these stories, serving both as a source of conflict and division and a motivation and resource for peace, understanding, and healing. We invite papers that explore the role of religion in the cinematic construction of conflict and reconciliation, war and peace, hostility and forgiveness. How, for example, has religion been portrayed as instrumental in constructing violence as redemptive? Or how has religion been portrayed as offering a salvation that is achieved through suffering and violence? We are especially interested in scholarly discussion of films that highlight the ways religion has helped provide an imaginative vehicle or pathway for moving from conflict to reconciliation. General Call The International Conferences on Religion & Film are gatherings held to foster intellectual stimulation, build networks, and advance scholarship related to Religion and Film Studies. Every conference invites papers that explore the intersection of religion and film through the analysis of individual films, genre studies, religious themes in films, the representation of religion in film, and functionalistic approaches of film as religion. Although there is a thematic emphasis on our location this year in Boston, papers are not restricted to this theme, and we heartily welcome papers that include films from around the world and that consider the role of race and gender in the intersection of religion and film. Please submit a 350-word abstract of your proposal by January 30, 2025 to sthodaa@bu.edu with the subject line “2025 International Conference on Religion & Film.” Please include 2 documents: 1) your anonymous 350-word abstract; 2) a document with your name and institution. Your abstract will undergo academic blind peer-review. Paper acceptances will be announced by March 1, 2025. From its early revolutionary history to conflicts around busing and desegregation, to the Boston Marathon bombing, Boston has seen its share of violence and conflict. But it is also a city that has been the home to peacemakers, such as Rev. Dr. Martin Luther King, Jr., who earned his PhD at Boston University, and his mentor, Rev. Howard Thurman, former Dean of Boston University’s Marsh Chapel. The University is also home to the Howard Thurman Center for Common Ground and the Tom Porter Program on Religion and Conflict Transformation. We invite you to join us May 29-31, 2025 for a stimulating International Conference on Religion & Film! More details regarding conference schedule, discount hotel options, and tours including Boston’s historic “Freedom Trail,” “Black Heritage Trail,” and Boston Movie Tours will be published in late 2024. Discounted Early Bird registration deadline: March 15, 2025 Regular registration deadline April 15, 2025. Housing and other information can be found at the Conference website here For further questions you may contact Dr. Bryan Stone at bpstone@bu.edu .",
        "event_link": "https://www.eventbrite.com/e/2025-international-religion-and-film-conference-in-boston-registration-1043024663847?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Film & Media Conferences",
            "#boston",
            "#film",
            "#religion",
            "#conference",
            "#2025"
        ]
    },
    {
        "title": "WHY ARE YOU YOU? - Film Premiere",
        "date_time": "Thursday, June 12 · 6:30 - 10pm EDT",
        "location": "Coolidge Corner Theatre 290 Harvard Street Brookline, MA 02446 Show map",
        "about": "Join us for the first theatrical communal screening of Why Are You You? . A feature documentary that explores the history of the Young Religious Unitarian Universalists (YRUU) community where adolescents discovered their true selves and were empowered to inspire positive change in the world. Forty years after the program's inception, those former participants reflect on how being a part of the program shaped them and still informs their lives. YRUU, established in 1983, grew out of the Unitarian Universalists’ rich tradition of religious youth education. It was disbanded in 2008. Get your photo taken on the red carpet. Grab some popcorn and a drink and head over to the accessible Moviehouse 2 at the Coolidge Corner Theater. After the screening of the film enjoy a discussion with the filmmakers: Lindsay Caddle LaPointe, Dawn MacKechnie, and Naomi Kooker. www.whyareyouyou.org Want to hear more? The filmmakers will continue the conversation at First Church Boston (66 Marlborough Street Boston, MA 02116) on Saturday, June 14th. Hosted by the Minn's Lecture Series . More info to come.",
        "event_link": "https://www.eventbrite.com/e/why-are-you-you-film-premiere-tickets-1074962183829?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Screenings",
            "Brookline Film & Media Screenings",
            "#documentary",
            "#identity",
            "#self_discovery",
            "#belonging__inclusion",
            "#youth_event",
            "#film_premiere",
            "#unitarian_universalist"
        ]
    },
    {
        "title": "BRUNCH D' TARDINHA",
        "date_time": "Sunday, April 27 · 3 - 10pm EDT",
        "location": "Estella Restaurant 49 Temple Place Boston, MA 02111 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/brunch-d-tardinha-tickets-1324657088009?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Film & Media Parties"
        ]
    },
    {
        "title": "The Bottoms x Loco Present: Bravo Trivia Night",
        "date_time": "Wednesday, April 30 · 7 - 10pm EDT",
        "location": "Loco Taqueria & Oyster Bar 412 West Broadway Boston, MA 02127 Show map",
        "about": "Catch up on all of The Valley drama with Brittany Cartwright! Doors open at 6:30pm, event begins at 7pm. Join us at Loco Southie for Bravo Trivia, hosted by the bottoms. Prizes will be awarded to the top three trivia winners! Teams of all sizes welcome*! Ticket includes admission, one welcome drink provided by Don Julio & Ketel One, meet & greet + a professional photo with Brittany, and an intimate Q&A session. Our full dinner menu is available for purchase throughout the event. *If your team is purchasing tickets separately, please reach out to julia@locotacoshops.com so we can guarantee seating together. This event is 21+.",
        "event_link": "https://www.eventbrite.com/e/the-bottoms-x-loco-present-bravo-trivia-night-tickets-1328183896789?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Appearances",
            "Boston Film & Media Appearances",
            "#fun",
            "#event",
            "#night",
            "#bravo_trivia",
            "#bottoms_x_loco"
        ]
    },
    {
        "title": "Untouchable: Laughing Out Caste Exclusive Screening + Q&A with Directors",
        "date_time": "Tuesday, May 20 · 6:30 - 9pm EDT.Doors at 6:15pm",
        "location": "Coolidge Corner Theatre 290 Harvard Street Brookline, MA 02446 Show map",
        "about": "Internationally acclaimed comedian Manjeet Sarkar has captivated audiences for seven years with his bold humour. Known for his solo show Untouchable, he has completed six national tours across India, performed at the United Nations, and is now on a world tour. As the first comedian from the Dalit community to achieve widespread recognition, Manjeet has broken through centuries of caste oppression with his work. Filmed and edited by Mike Noone, Untouchable: Laughing Out Caste follows Sarkar's journey across India and beyond, capturing his unique perspective on caste, class, & the contrasts between rural and urban life in India. The film sheds light on the shared struggles of marginalized communities worldwide and the transformative power of art. Following the screening, a moderated discussion and Q&A session with Manjeet Sarkar and Mike Noone will offer further insights into the film’s themes. So far, the film has been test screened across 3 continents in cities like Oslo, Vancouver, Toronto, Austin, Bengaluru, and Chennai.",
        "event_link": "https://www.eventbrite.com/e/untouchable-laughing-out-caste-exclusive-screening-qa-with-directors-tickets-1308564444479?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Screenings",
            "Brookline Film & Media Screenings",
            "#directors",
            "#untouchable",
            "#q_and_a",
            "#exclusive_screening",
            "#laughing_out_caste"
        ]
    },
    {
        "title": "Silver Screen Festival",
        "date_time": "Sunday, April 27 · 3:30 - 6:30pm EDT",
        "location": "175 Tremont St 175 Tremont Street Boston, MA 02111 Show map",
        "about": "Silver Screen Festival Welcome to the Silver Screen Festival ! Join us for a day filled with classic movies, popcorn, and good company at 175 Tremont St . Get ready to immerse yourself in the magic of cinema and enjoy a lineup of timeless films. Whether you're a film buff or just looking for a fun day out, this event is perfect for all movie lovers. Don't miss out on this exciting opportunity to experience the nostalgia of the silver screen. Grab your tickets now and get ready for a cinematic adventure!",
        "event_link": "https://www.eventbrite.com/e/silver-screen-festival-tickets-1276439688469?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Festivals",
            "Boston Film & Media Festivals",
            "#cinema",
            "#film",
            "#movies",
            "#premiere",
            "#celebrities"
        ]
    },
    {
        "title": "Center Cinema",
        "date_time": "Wednesday, April 30 · 6 - 8pm EDT",
        "location": "Fenway Community Center 1282 Boylston Street #123 Boston, MA 02215 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/center-cinema-tickets-1312996691449?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#empowerment",
            "#femaleempowerment",
            "#moxie",
            "#movie_night",
            "#community_event",
            "#center_cinema"
        ]
    },
    {
        "title": "Witch-Craft Cinema: \"The Princess Bride\" @ Side Quest Books & Games",
        "date_time": "Thursday, May 29 · 7 - 10pm EDT",
        "location": "Side Quest Books & Games 1 Bow Market Way Suite 32 Somerville, MA 02143 Show map",
        "about": "ABOUT THE EVENT We'll be watching everyone's comfort cult classic, \"The Princess Bride,\" as we do cozy crafty things! You can bring your own craft or buy a kit from Homebody DIY, and we'll have a themed drink to sip on. This event is 21+. ABOUT THE VENUE Side Quest Books & Games is located on the balcony of Bow Market in Somerville's Union Square. There is an elevator available in the Bow Market lobby, which is to the right of Pop's Pinball Parlor. Outside food and drink are allowed. Masks are optional, but please let us know and stay home if you fall ill.",
        "event_link": "https://www.eventbrite.com/e/witch-craft-cinema-the-princess-bride-side-quest-books-games-tickets-1323268173729?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Screenings",
            "Somerville Film & Media Screenings",
            "#event",
            "#movie_night",
            "#craft_night",
            "#side_quest_books_games",
            "#witchcraft_cinema"
        ]
    },
    {
        "title": "Recording to Publishing: A Beginner’s Guide to Descript",
        "date_time": "Wednesday, April 30 · 6:30 - 8:30pm EDT.Doors at 6pm",
        "location": "PRX Podcast Garage 267 Western Avenue #Rear Boston, MA 02134 Show map",
        "about": "Join us and discover how Descript and next-gen podcasting tools can transform your podcasting journey! Looking to streamline your podcast editing and incorporate next-gen AI podcast production tools? Join this friendly, hands-on introduction to Descript, one of the AI-powered software solutions that makes audio and video editing accessible. Whether you’re a total beginner or a seasoned creator wanting to explore new tech offerings, you’ll learn how to record directly in Descript, import media from other sources, and make simple, text-based edits to your content—no advanced audio skills needed! We'll dive into Descript’s built-in AI tools, showing you how to remove filler words, correct mistakes, and even create voiceovers. We’ll explore adding music and graphics, as well as using templates to help you build a professional look and feel for your show, while cutting hours off your production time. You’ll leave this class ready to not only export finished episodes, but also start to create social clips that help grow your audience and keep them engaged. If you're new to podcasting or looking to upgrade your editing workflow, this class will give you the confidence to turn raw recordings into polished episodes efficiently and easily. Bring your laptop and any media files you want to work with, and let’s make editing fun and simple together! In 2 hours, you'll leave ready to: Record and edit your content with confidence. Produce professional-quality audio and video content. Streamline your editing workflow with AI-powered tools Class expectations: -You’ll want to register for free and download Descript before the class time. https://www.descript.com/ -Bring a laptop, and if you have them, any recording files you want to work on.",
        "event_link": "https://www.eventbrite.com/e/recording-to-publishing-a-beginners-guide-to-descript-tickets-1296197083369?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Film & Media Classes",
            "#podcast",
            "#publishing",
            "#podcasting",
            "#beginner",
            "#recording",
            "#contentcreation",
            "#video_production",
            "#podcast_workshop",
            "#descript",
            "#editing_course"
        ]
    },
    {
        "title": "Flagons & Dragons D&D One-Shot @ Aeronaut Brewery",
        "date_time": "Sunday, June 8 · 1 - 5pm EDT.Doors at 8am",
        "location": "Aeronaut Brewing Company 14 Tyler Street Somerville, MA 02143 Show map",
        "about": "Curious about D&D? Looking to get back into it after a long break? Or just excited to meet new people? Join the excitement and play Dungeons & Dragons at Aeronaut Brewery in Somerville with Danger Wizard on Sunday, March 9th at 1:00 pm! All are welcome; absolutely no experience needed to have a great time. Meet new players or reconnect with old friends for an afternoon of camaraderie! Join us at the table for a game led by a professional Dungeon Master. We will have everything you need to play; just bring yourself and a sense of adventure! Enjoy world-class beer alongside excellent Venezuelan food from Carolicious. The event ends at 5:00 pm. Please sign up by the day prior to reserve your spot, tickets are capped at 30 players. No refunds for cancellations made within 24 hours of the event. Event is 21+ Purchase of an event pass includes 2 drink tickets, which can be exchanged for any $7-$9 beer at the bar, tip included.",
        "event_link": "https://www.eventbrite.com/e/flagons-dragons-dd-one-shot-aeronaut-brewery-tickets-1291425962819?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Games",
            "Somerville Film & Media Games",
            "#boston",
            "#event",
            "#cambridge",
            "#rpg",
            "#somerville",
            "#dnd",
            "#dungeons_and_dragons",
            "#one_shot",
            "#aeronaut_brewery",
            "#flagons_dragons"
        ]
    },
    {
        "title": "Whoops, the page or event you are looking for was not found.",
        "date_time": "N/A",
        "location": "N/A",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/boston-creatives-dinner-weekly-tickets-1309468247779?aff=ebdssbdestsearch",
        "tags": []
    },
    {
        "title": "BIG Orientation",
        "date_time": "Starts on Monday, April 28 · 6pm EDT",
        "location": "Brookline Interactive Group 46 Tappan St 3rd floor Brookline, MA 02445 Show map",
        "about": "An hour long orientation for new members* or those simply curious about membership at Brookline Interactive Group. Includes a tour of our facilities and introduction to staff, an interview demo, and time to explore equipment! This month, we will be debuting our newly renovated space--the Brookline Open Podcast Studio (BOPS)! Don't miss it! *New members must complete an orientation within 6 months in order to rent equipment.",
        "event_link": "https://www.eventbrite.com/e/big-orientation-tickets-1284849843469?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Classes",
            "Brookline Film & Media Classes",
            "#brookline",
            "#communityproject",
            "#brookline_events",
            "#brooklineinteractivegroup",
            "#brookline_event"
        ]
    },
    {
        "title": "BSG Launch Party",
        "date_time": "Saturday, May 10 · 6 - 10pm EDT",
        "location": "62 Bow St 62 Bow Street Somerville, MA 02143 Show map",
        "about": "Experience a vibrant evening featuring an art market, live showcase, vintage clothing, live music, & closing with a film screening. All are welcome; donation is optional! Come support local artists and enjoy an unforgettable night of art and entertainment.",
        "event_link": "https://www.eventbrite.com/e/bsg-launch-party-tickets-1317980678689?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Parties",
            "Somerville Film & Media Parties",
            "#celebration",
            "#artmarket",
            "#thrifting",
            "#vintageclothing",
            "#livemusicvenue",
            "#film_screening",
            "#open_reception",
            "#wineandsnacks",
            "#showcase_event",
            "#bsg_launch_party"
        ]
    },
    {
        "title": "WNBA Boston Outing to JFK Library",
        "date_time": "Wednesday, May 21 · 1 - 4pm EDT",
        "location": "John F. Kennedy Presidential Library and Museum Columbia Point Boston, MA 02125 Show map",
        "about": "Join fellow members of the WNBA Boston Chapter in a visit to the JFK library this spring. The John F. Kennedy Presidential Library and Museum is dedicated to the memory of our nation's thirty-fifth president and to all those who through the art of politics seek a new and better world; with multiple exhibitions and interactive experiences, we're so excited to go explore this library together! When: Wednesday, May 21st Lunch in the JFK Library cafe at 1:00 pm ( note: cost of lunch is NOT included in ticket ) Or join us just to explore the Library and Museum, at 2:00 pm Use this form to buy your ticket now! More information: Transportation details are here ; note that parking is free, and the library is also accessible via public transportation! For other logistics, check out the JFK library FAQs here or email the WNBA with questions!",
        "event_link": "https://www.eventbrite.com/e/wnba-boston-outing-to-jfk-library-tickets-1267625083749?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Film & Media Tours",
            "#boston",
            "#event",
            "#library",
            "#publishing",
            "#booktalk",
            "#reads",
            "#bookclubforwomen",
            "#wnba_boston",
            "#jfk_library"
        ]
    },
    {
        "title": "Hideout Comedy presents Billy Anderson",
        "date_time": "Friday, May 2 · 7:30 - 9pm EDT",
        "location": "The White Bull Tavern Comedy Club Boston 1 Union Street Boston, MA 02108 Show map",
        "about": "Located right in the heart of historic downtown Boston, come get a taste of the absolute BEST stand-up comics working today. These comedians are all pros, many having had their comedy featured places like Comedy Central, Funny or Die, Netflix, and more! Past performers include Michael Che, Gary Gulman, Myq Kaplan, Rich Vos, Corinne Fisher, Alonzo Bodden, Liza Treyger, Jeff Ross, Josh Gondelman, and Mark Normand. You never know who will drop in. SHOWS ARE 21+ SHOWS ARE 21+ Doors open at 6:30pm | Show starts at 7:30pm Born in Texas and raised in Augusta, Georgia – Billy Anderson is stand-up comedian currently living in Los Angeles, California. He’s been seen regionally at SketchFest Seattle, The Washington Comedy Festival, Bumbershoot and was a finalist in the 2016 Seattle International Comedy Competition. Outside of the Northwest, Billy has written for Cracked.Com, performed in SF Sketchfest, LaLaFest Los Angeles, the San Francisco International Comedy Competition and as of 2013 he has performed stand-up comedy in every US state. Billy can be heard on Audible’s “Sounds Like America” hosted by Jackie Kashian and seen on season 3 of the syndicated program “Laughs” on Fox television. In 2018 he released his first live comedy special titled “America’s Sweetheart” through The Harmon Brother’s Dry Bar Comedy series on Amazon Prime. You can see Billy both at the Hollywood Improv and touring internationally as the host of the hit comedy showcase The Gateway Show. ____________________________ All sales are final. Please note that if you are under 21 or  are denied entry to the venue because of an ID issue you will not receive a refund for your ticket. Like us on Facebook! www.facebook.com/hideoutcomedy/ IG: @hideoutcomedy",
        "event_link": "https://www.eventbrite.com/e/hideout-comedy-presents-billy-anderson-tickets-1267635244139?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Film & Media Performances",
            "#comedy",
            "#marijuana",
            "#weed",
            "#standupcomedy",
            "#downtownboston"
        ]
    },
    {
        "title": "Get Lit with Author Liv Constantine and Reading with Robin",
        "date_time": "Thursday, June 12 · 6 - 7:30pm EDT",
        "location": "Cambria Somerville 515 Somerville Avenue Somerville, MA 02143 Show map",
        "about": "What better way to celebrate Lit Crawl Somerville than an evening with NY Times Best Selling Author Liv Constantine, in conversation with Robin Kall of Reading with Robin fame. Discussion will include a preview of their latest book, \"Don't Open Your Eyes\", as well as scoop on the adaption of their novels to the screen! Join us at the Cambria Hotel on Thursday, June 12th from 6-7:30 PM for this fun event. ABOUT LIV: Liv Constantine is the pen name of sisters Lynne Constantine and Valerie Constantine. Lynne and Valerie are New York Times, Wall Street Journal, and USA Today international bestselling authors with over two million copies sold worldwide. They are Library Reads Hall of Fame authors. Their books have been translated into 29 languages, are available in 34 countries, and are in development for both television and film. Their books have been praised by The Washington Post, USA Today , The Sunday Times , People Magazine , and Good Morning America , among many others. Their debut novel, THE LAST MRS. PARRISH, is a Reese Witherspoon Book Club selection. TICKET INCLUDES: • Admission to the Program • A Glass of Wine • Nibbles • A Ticket for Raffle Giveaways • Discounted Valet Parking Liv's books will be for sale and available for signing at the event. Provided by Porter Square Books! *A discounted room rate is available, please email lburns@saundershotelgroup.com for details!",
        "event_link": "https://www.eventbrite.com/e/get-lit-with-author-liv-constantine-and-reading-with-robin-tickets-1332630055369?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Seminars",
            "Somerville Film & Media Seminars"
        ]
    },
    {
        "title": "Harriet Film Screening",
        "date_time": "Thursday, May 29 · 6 - 7:30pm EDT",
        "location": "The West End Museum 150 Staniford St. Suite 7 (on Lomasney Way) Boston, MA 02114 Show map",
        "about": "In conjunction with The West End Museum's current special exhibit, An Illusion of Freedom: Boston and the Fugitive Slave Laws , WEM will be hosting a film screening of Harriet (2019). Before the film, there will be a mini-lecture on Harriet Tubman's ties to Boston's underground railroad.",
        "event_link": "https://www.eventbrite.com/e/harriet-film-screening-tickets-1303449896729?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#movie",
            "#film",
            "#screening",
            "#biographical",
            "#movie_night",
            "#civil_rights",
            "#harriet_tubman",
            "#historical_film",
            "#harriet_film_screening"
        ]
    },
    {
        "title": "Saturday Open Skate 8pm-11pm",
        "date_time": "Saturday, April 26 · 8 - 11pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 8pm-11pm All Ages PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED MINORS MUST BE ACCOMPANIED BY AN ADULT NO REFUNDS! We are excited to have everyone back! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/saturday-open-skate-8pm-11pm-tickets-322338341657?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "The WBUR Festival",
        "date_time": "N/A",
        "location": "Boston University Commonwealth Avenue Boston, MA 02215 Show map",
        "about": "We’re celebrating WBUR’s 75th birthday with a big bash for the city we love. The three-day lineup will feature captivating conversations, musical performances, multiple stages and a lively street scene. It will be serious stuff, and wicked fun, too.",
        "event_link": "https://www.eventbrite.com/e/the-wbur-festival-tickets-982066847377",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Festivals",
            "Boston Film & Media Festivals",
            "#business",
            "#boston",
            "#environment",
            "#event",
            "#festival",
            "#politics",
            "#news",
            "#npr",
            "#april",
            "#live_music"
        ]
    },
    {
        "title": "Brice And Wen Present: Boston",
        "date_time": "Wednesday, May 14 · 6 - 11:30pm EDT",
        "location": "Game On! 82 Lansdowne Street Boston, MA 02215 Show map",
        "about": "Get ready, Boston! Brice Izyah and Wendell Holland are bringing their reality TV squad to town for another EPIC Survivor 48 Watch Party! Join us at GameOn Fenway, where the doors open at 6, Survivor kicks off at 8, and the party vibes last until midnight! You never know who might pop up at a Brice and Wen event—this is one night you don’t want to miss!",
        "event_link": "https://www.eventbrite.com/e/brice-and-wen-present-boston-tickets-1228084035409",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#boston",
            "#event",
            "#watchparty",
            "#survivor",
            "#present",
            "#briceandwen",
            "#survivor48"
        ]
    },
    {
        "title": "2025 International Religion and Film Conference in Boston",
        "date_time": "May 29 · 5pm - May 31 · 8pm EDT",
        "location": "Boston University School of Theology 745 Commonwealth Avenue Boston, MA 02215 Show map",
        "about": "Boston University and The Journal of Religion & Film cordially invite you to The 2025 International Conference on Religion & Film to be held on the campus of Boston University School of Theology May 29-31, 2025 Theme—Religion and Film: Conflict and Reconciliation Conflict and its resolution are at the heart of most movies. As Wes Anderson put it, “There's no story if there isn’t some conflict.” From its beginnings, cinema has offered us compelling visions of interpersonal discord and international conflict, social struggle and division, terrorism and genocide—but also stirring portrayals of reconciliation and forgiveness. Religion has often stood at the center of these stories, serving both as a source of conflict and division and a motivation and resource for peace, understanding, and healing. We invite papers that explore the role of religion in the cinematic construction of conflict and reconciliation, war and peace, hostility and forgiveness. How, for example, has religion been portrayed as instrumental in constructing violence as redemptive? Or how has religion been portrayed as offering a salvation that is achieved through suffering and violence? We are especially interested in scholarly discussion of films that highlight the ways religion has helped provide an imaginative vehicle or pathway for moving from conflict to reconciliation. General Call The International Conferences on Religion & Film are gatherings held to foster intellectual stimulation, build networks, and advance scholarship related to Religion and Film Studies. Every conference invites papers that explore the intersection of religion and film through the analysis of individual films, genre studies, religious themes in films, the representation of religion in film, and functionalistic approaches of film as religion. Although there is a thematic emphasis on our location this year in Boston, papers are not restricted to this theme, and we heartily welcome papers that include films from around the world and that consider the role of race and gender in the intersection of religion and film. Please submit a 350-word abstract of your proposal by January 30, 2025 to sthodaa@bu.edu with the subject line “2025 International Conference on Religion & Film.” Please include 2 documents: 1) your anonymous 350-word abstract; 2) a document with your name and institution. Your abstract will undergo academic blind peer-review. Paper acceptances will be announced by March 1, 2025. From its early revolutionary history to conflicts around busing and desegregation, to the Boston Marathon bombing, Boston has seen its share of violence and conflict. But it is also a city that has been the home to peacemakers, such as Rev. Dr. Martin Luther King, Jr., who earned his PhD at Boston University, and his mentor, Rev. Howard Thurman, former Dean of Boston University’s Marsh Chapel. The University is also home to the Howard Thurman Center for Common Ground and the Tom Porter Program on Religion and Conflict Transformation. We invite you to join us May 29-31, 2025 for a stimulating International Conference on Religion & Film! More details regarding conference schedule, discount hotel options, and tours including Boston’s historic “Freedom Trail,” “Black Heritage Trail,” and Boston Movie Tours will be published in late 2024. Discounted Early Bird registration deadline: March 15, 2025 Regular registration deadline April 15, 2025. Housing and other information can be found at the Conference website here For further questions you may contact Dr. Bryan Stone at bpstone@bu.edu .",
        "event_link": "https://www.eventbrite.com/e/2025-international-religion-and-film-conference-in-boston-registration-1043024663847",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Film & Media Conferences",
            "#boston",
            "#film",
            "#religion",
            "#conference",
            "#2025"
        ]
    },
    {
        "title": "WHY ARE YOU YOU? - Film Premiere",
        "date_time": "Thursday, June 12 · 6:30 - 10pm EDT",
        "location": "Coolidge Corner Theatre 290 Harvard Street Brookline, MA 02446 Show map",
        "about": "Join us for the first theatrical communal screening of Why Are You You? . A feature documentary that explores the history of the Young Religious Unitarian Universalists (YRUU) community where adolescents discovered their true selves and were empowered to inspire positive change in the world. Forty years after the program's inception, those former participants reflect on how being a part of the program shaped them and still informs their lives. YRUU, established in 1983, grew out of the Unitarian Universalists’ rich tradition of religious youth education. It was disbanded in 2008. Get your photo taken on the red carpet. Grab some popcorn and a drink and head over to the accessible Moviehouse 2 at the Coolidge Corner Theater. After the screening of the film enjoy a discussion with the filmmakers: Lindsay Caddle LaPointe, Dawn MacKechnie, and Naomi Kooker. www.whyareyouyou.org Want to hear more? The filmmakers will continue the conversation at First Church Boston (66 Marlborough Street Boston, MA 02116) on Saturday, June 14th. Hosted by the Minn's Lecture Series . More info to come.",
        "event_link": "https://www.eventbrite.com/e/why-are-you-you-film-premiere-tickets-1074962183829",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Screenings",
            "Brookline Film & Media Screenings",
            "#documentary",
            "#identity",
            "#self_discovery",
            "#belonging__inclusion",
            "#youth_event",
            "#film_premiere",
            "#unitarian_universalist"
        ]
    },
    {
        "title": "Saturday Open Skate 8pm-11pm",
        "date_time": "Saturday, April 26 · 8 - 11pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 8pm-11pm All Ages PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED MINORS MUST BE ACCOMPANIED BY AN ADULT NO REFUNDS! We are excited to have everyone back! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/saturday-open-skate-8pm-11pm-tickets-322338341657",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "BRUNCH D' TARDINHA",
        "date_time": "Sunday, April 27 · 3 - 10pm EDT",
        "location": "Estella Restaurant 49 Temple Place Boston, MA 02111 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/brunch-d-tardinha-tickets-1324657088009",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Film & Media Parties"
        ]
    },
    {
        "title": "Silver Screen Festival",
        "date_time": "Sunday, April 27 · 3:30 - 6:30pm EDT",
        "location": "175 Tremont St 175 Tremont Street Boston, MA 02111 Show map",
        "about": "Silver Screen Festival Welcome to the Silver Screen Festival ! Join us for a day filled with classic movies, popcorn, and good company at 175 Tremont St . Get ready to immerse yourself in the magic of cinema and enjoy a lineup of timeless films. Whether you're a film buff or just looking for a fun day out, this event is perfect for all movie lovers. Don't miss out on this exciting opportunity to experience the nostalgia of the silver screen. Grab your tickets now and get ready for a cinematic adventure!",
        "event_link": "https://www.eventbrite.com/e/silver-screen-festival-tickets-1276439688469",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Festivals",
            "Boston Film & Media Festivals",
            "#cinema",
            "#film",
            "#movies",
            "#premiere",
            "#celebrities"
        ]
    },
    {
        "title": "BIG Orientation",
        "date_time": "Starts on Monday, April 28 · 6pm EDT",
        "location": "Brookline Interactive Group 46 Tappan St 3rd floor Brookline, MA 02445 Show map",
        "about": "An hour long orientation for new members* or those simply curious about membership at Brookline Interactive Group. Includes a tour of our facilities and introduction to staff, an interview demo, and time to explore equipment! This month, we will be debuting our newly renovated space--the Brookline Open Podcast Studio (BOPS)! Don't miss it! *New members must complete an orientation within 6 months in order to rent equipment.",
        "event_link": "https://www.eventbrite.com/e/big-orientation-tickets-1284849843469",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Classes",
            "Brookline Film & Media Classes",
            "#brookline",
            "#communityproject",
            "#brookline_events",
            "#brooklineinteractivegroup",
            "#brookline_event"
        ]
    },
    {
        "title": "Sunday Open Skate All Ages 12PM-3PM",
        "date_time": "Sunday, April 27 · 12 - 3pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 12pm-3pm (Sunday) All Ages Ages 2-5 skate FREE at this session! WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE MINORS MUST BE ACCOMPANIED BY AN ADULT NO REFUNDS! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/sunday-open-skate-all-ages-12pm-3pm-tickets-322339796007?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Sunday Open Skate All Ages 4PM-7PM",
        "date_time": "Sunday, April 27 · 4 - 7pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 4PM-7PM (Sunday) All Ages WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE MINORS MUST BE ACCOMPANIED BY AN ADULT NO REFUNDS! We are excited to have everyone back! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/sunday-open-skate-all-ages-4pm-7pm-tickets-322340568317?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Sunday Night Adult Night 21+ (8PM-12AM)",
        "date_time": "Sunday, April 27 · 8 - 11:45pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 8pm-12am 21+ (ID WILL BE MANDATORY) - No EXCEPTIONS LIVE DJ and SPECIAL GUESTS! WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE NO VAPE/HOOKAH PENS ONCE YOU EXIT THE BUILDING YOU WILL NOT BE ABLE TO RE-ENTER! NO REFUNDS! We are excited to have everyone back! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/sunday-night-adult-night-21-8pm-12am-tickets-322342263387?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Tuesday Night All Ages (6PM-9PM)",
        "date_time": "Tuesday, April 29 · 6 - 9pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "TUESDAY NIGHT ALL AGES FAMILY NIGHT",
        "event_link": "https://www.eventbrite.com/e/tuesday-night-all-ages-6pm-9pm-tickets-323316166357?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Wednesday Night Adult Night (18+) 7PM-10PM",
        "date_time": "Wednesday, April 30 · 7 - 10pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 7PM-10PM 18+ LIVE DJ WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE NO REFUNDS! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/wednesday-night-adult-night-18-7pm-10pm-tickets-322344018637?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Saturday Open Skate (12pm-3pm)",
        "date_time": "Saturday, May 3 · 12 - 3pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 12pm-3pm All Ages WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE MINORS MUST BE ACCOMPANIED BY AN ADULT NO REFUNDS! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/saturday-open-skate-12pm-3pm-tickets-322325784097?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Saturday Open Skate (4PM-7PM)",
        "date_time": "Saturday, May 3 · 4 - 7pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 4pm-7pm All Ages WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE MINORS MUST BE ACCOMPANIED BY AN ADULT NO REFUNDS! We are excited to have everyone back! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/saturday-open-skate-4pm-7pm-tickets-322330397897?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Hideout Comedy Fridays!",
        "date_time": "Friday, May 2 · 7:30 - 9pm EDT",
        "location": "The White Bull Tavern 1 Union Street Boston, MA 02108 Show map",
        "about": "Located right in the heart of historic downtown Boston, come get a taste of the absolute BEST stand-up comics working today. These comedians are all pros, many having had their comedy featured in places like Comedy Central, Funny or Die, Netflix, and more! Past performers include Michael Che, Gary Gulman, Shane Gillis, Rich Vos, Corinne Fisher, Alonzo Bodden, Liza Treyger, Jeff Ross, Josh Gondelman, and Mark Normand. You never know who will drop in Shows are 21+ Doors open at 6:30pm | Show starts at 7:30pm All sales are final. Please note that if you are under 21 or are denied entry to the venue because of an ID issue you will not receive a refund for your ticket. Tickets are available at the door on a first come first serve basis (unless sold out) for $25 cash or Venmo accepted Like us on Facebook! www.facebook.com/hideoutcomedy/ twitter and IG: @hideoutcomedy",
        "event_link": "https://www.eventbrite.com/e/hideout-comedy-fridays-tickets-147702677685?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Film & Media Performances",
            "#entertainment",
            "#comedy",
            "#standup",
            "#funny",
            "#bostoncomedy",
            "#stand_up_comedy",
            "#comedy_show",
            "#date_night",
            "#comedy_club",
            "#duckduckgoofs"
        ]
    },
    {
        "title": "PA Workshop",
        "date_time": "Saturday, May 10 · 9am - 3:30pm EDT",
        "location": "Red Sky Studios 184 Everett Street Boston, MA 02134 Show map",
        "about": "Learn about the skills to be a PA (Production Assistant) on feature film and commercial productions in an immersive 1 day workshop training program. Through interactive sessions attendees will gain the knowledge on how to be a successful PA ready to work on set. PA Training is covered in 3 Group Sessions: Set Etiquette: PA responsibilities and set protocol Safety Training: Set safety and best work practices Career Paths: Resumes, job searches, and networking The workshop is a unique opportunity for those starting out in the industry to hone their skill set, gain career insights, and make valuable connections. There will be time for hands on demonstrations, to ask questions, and receive feedback. Attendees will learn from the best local crew in the business. Workshop leaders and panelists include working Directors, Assistant Directors, Production Coordinators, Camera and Lighting Crew, Safety Training Specialists, among other crew and experienced PA's. Event Details Lunch is provided Pre-Registration is required. The workshop will sell out. Attendees should wear comfortable clothing and shoes appropriate for being on set. Recent college graduates and current students are encouraged to attend. Attendees will receive a document package that includes: sample call sheets, crew charts, petty cash forms, sample resumes, and more. Transportation & Parking Parking is available in the Red Sky lot entrance on Everett St. Red Sky Studios is accessible by MBTA Bus, Commuter Rail (Boston Landing), and Green Line (Allston St, 1 mile). mbta.com Space is limited and early registration is strongly recommended! The PA Workshop typically sells out in advance. MPC Programs are made possible by the generous support of our Annual Sponsors and the Boston Cultural Council . PA Workshop is presented with additional support from Red Sky Studios .",
        "event_link": "https://www.eventbrite.com/e/pa-workshop-tickets-1337544324079?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Film & Media Classes"
        ]
    },
    {
        "title": "It's Tarot Time: A Tarot Comedy Show at Trident Bookstore!",
        "date_time": "Monday, May 12 · 7 - 9pm EDT",
        "location": "Trident Booksellers & Cafe 338 Newbury Street Boston, MA 02115 Show map",
        "about": "Show starts at 7:00pm for insightful and entertaining readings for all audience members who claim a ticket! Food and drinks available from the cafe ! Come early to get your grub on! Website: itstarottime.com About the Show: Tarot…and comedy…together? Who would’ve thought! Well…I did! I have been hosting and performing my shows for two and a half years now. It’s Tarot Time! is a fun and intimate space where participants come onstage to get a three card reading and I give them a bit of insight and sass. Part improv, part advice, all fun! My readings are described as “counseling with cards”, as they are more an opportunity and space for self-reflection and working towards a personal wholeness. I by the motto, “the cards tell you what you need to hear, not what you want to hear.” Any and all are welcome to come, as long as they are open-minded, ready to learn, have fun, and provide a safe space for all! Testimonials: “It was a lot of fun! I was anxious at first, as it was my first reading and having my tarot read in front of a group seemed nerve racking, but the atmosphere as soon as the event started was friendly and you could tell everyone was there for a good time. It was definitely a night of laughs and I can’t wait to be back!” - Elvira T.L. “Tarot Time was so much fun. It was a casual, inviting experience with some insightful and truly thoughtful readings! Plus, it was funny AF. 10/10! - Taylor M. “At first I was a bit skeptical coming to one of these shows. I expected it to be one of those cliché things you see on tv and only come for pure entertainment. I had just gotten back into tarot and was excited to hear what Antonio had to say. The show ended up being a great night with great laughs and jokes. He gave his audience a wonderful experience. He told me some things that rang true. I am so glad I cam and would definitely recommend!\"- Mekkailah C. \"Antonio’s Comedy Tarot was so much fun. It’s great entertainment for a night out with friends. My friend and I went with an open mind because we both love Tarot readings, but it was more than that. Antonio is a vibe! My reading also addressed what I was hoping to hear about. Pros: I can’t wait to go to my next show ❤️ Cons: I had so much fun I would have stayed longer ❤️\" -Ali D. \"Imagine a long week, repetitive tasks day in and out, in the city of Boston, when you need to step out of your routine for a brief time to feel lighthearted and bubbly again, but without spending to much energy or money to add something to your planner that eventually would increase your stress level. That’s the time you need to come to Antonio. He will charm your heaviness away, bring back your playfulness, and in the middle of jokes and giggles, he will open your eyes to something about your life that you unintentionally, or maybe even intentionally, over looked at. Changes are possible, even for a life in Boston, even when endless repetitions of same tasks consumes our passions away, but Antonio will remind you of your own potentials with his tarot cards, and make you believe in your own power a little bit more. Wherever his show is at, there will be a breath of sweet fresh air in a dense heavy city night.\" - William W. About Antonio: Antonio Morales is a practicing tarot reader of 14 years and standup comedian. He does one-on-one sessions and public events/parties to provide insight to all who are interested. He uses his knowledge of the tarot, experience with reading people from all walks of life, and intuition to provide guidance to the querent (with some sass and comedic relief, of course >;P). He is also a standup comedian and host/producer of the show, The Boston Tee Hee Party, which can also be seen and experienced at Trident bookstore. Go figure! Check them out on Instagram: @antoniomorales_1",
        "event_link": "https://www.eventbrite.com/e/its-tarot-time-a-tarot-comedy-show-at-trident-bookstore-tickets-624467187167?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Film & Media Performances",
            "#boston",
            "#comedy",
            "#standup",
            "#lgbtq",
            "#queer",
            "#spirituality",
            "#funny",
            "#witchcraft",
            "#tarot",
            "#monday"
        ]
    },
    {
        "title": "Next Stop Comedy at Castle Island Brewing Co! - South Boston, MA",
        "date_time": "Friday, May 16 · 8 - 9:30pm EDT",
        "location": "Castle Island Brewing - South Boston 10 Old Colony Avenue Boston, MA 02127 Show map",
        "about": "Next Stop Comedy brings top stand-up comedians to your favorite local venues! Each show features a novel line-up with acts seen on TV and heard on your favorite podcasts. Join us at Castle Island Brewing Company in South Boston, MA! - 10 Old Colony Ave, Boston, MA 02127 For more info, check out our website! - nextstopcomedy.com *Formerly Boston Comedy Club",
        "event_link": "https://www.eventbrite.com/e/next-stop-comedy-at-castle-island-brewing-co-south-boston-ma-tickets-757901352347?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Film & Media Performances",
            "#live",
            "#brewery",
            "#boston",
            "#beer",
            "#comedy",
            "#standup",
            "#datenight",
            "#standupcomedy",
            "#girlsnightout",
            "#southboston"
        ]
    },
    {
        "title": "THE SIDEQUEST: A PAX East Afterparty",
        "date_time": "Thursday, May 8 · 6 - 11pm EDT",
        "location": "Howl at the Moon Boston 184 High Street Boston, MA 02110 Show map",
        "about": "This year, take a SIDEQUEST away from the show floor and meet up with a few hundred of your friends at one of the best party spots in town! Last year we shattered attendance records, and this year we'll be doing it again! HUNDREDS OF YOUR FRIENDS. AN INCREDIBLE BAND. FREE APPETIZER BUFFET. And the best party: IT'S FREE! HOW TO GET IN: Just mention “SIDEQUEST” to get in for FREE from 6-11 PM and get your wristband! Registration via Eventbrite is optional. Complimentary appetizer buffet access until 10pm! Drink specials all night! Get there early, or be stuck waiting in line! (No need for the Eventbrite tickets to get in, and Registration does not guarantee entry!) PAX badges not required. This event is 21+ Have a game or gaming product or giveaway you want to let people know about? Contact us! Full Details Date: Thursday, March 21st, 2024 Location: Howl at the Moon, 184 High St, Boston, MA 02110 Time: 6-11PM Food: Free Buffet until 10PM LIVE MUSIC ALL NIGHT FREE REGISTRATION: (but not necessary -- just show up and mention SIDEQUEST!) $4 : Miller High Life, White Claw $5.50: Dirty Shirley, House Margarita, Devils Lemonade, New Amsterdam Vodka Drinks, Myers' Rum Drinks This event is not associated with PAX East, Penny Arcade, or its organizers.",
        "event_link": "https://www.eventbrite.com/e/the-sidequest-a-pax-east-afterparty-tickets-1318308418969?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Film & Media Parties",
            "#gaming",
            "#cosplay",
            "#afterparty",
            "#paxeast",
            "#sidequest"
        ]
    },
    {
        "title": "Dukakis: Recipe for Democracy",
        "date_time": "Wednesday, April 30 · 6 - 7:30pm EDT",
        "location": "Suffolk University 120 Tremont Street Fifth Floor Commons Boston, MA 02108 Show map",
        "about": "Join us for the screening of the acclaimed documentary Dukakis: Recipe for Democracy. After the screening, the filmmaker Erin Trahan will be joined in conversation by Juan Gallego, who is featured in the film and who serves as assistant deputy chief of staff to Massachusetts Lieutenant Governor Kim Driscoll, and Joan Vennochi, opinion columnist and associate editor at The Boston Globe . The evening's moderator is Rachael Cobb, associate professor, Political Science and Legal Studies Department, Suffolk University.",
        "event_link": "https://www.eventbrite.com/e/dukakis-recipe-for-democracy-tickets-1291375331379?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#documentary",
            "#democracy",
            "#screening",
            "#acclaimed",
            "#dukakis"
        ]
    },
    {
        "title": "Roslindale Film Society: Rushmore",
        "date_time": "Sunday, May 4 · 7 - 9:30pm EDT",
        "location": "The Substation 4228 Washington Street Boston, MA 02131 Show map",
        "about": "Join us for a movie night at The Substation! We are presenting a Wes Anderson double-feature. 5:00 pm: Doors open for family movie 5:30 pm: Fantastic Mr. Fox begins 7:00 pm: Doors open for adults-only movie 7:30 pm: Rushmore begins Rushmore is a 1998 comedy film, directed by Wes Anderson, about a teenager named Max Fischer,  his friendship with a rich industrialist, and their shared affection for an elementary school teacher.  RATED R. BRING YOUR OWN lawn chairs, cushions, blankets, or perch on one of our benches. For the adults, the Substation bar is open! This event is brought to you FREE through generous financial contribution from The Boston Home Team and the Mass Cultural Council . Donations are optional at the door. Beer, wine, and food will be available for purchase. Tickets are limited, so please, if you cannot attend after purchasing tickets, cancel them on eventbrite so that others may have a chance to attend this FREE screening. (Don't acquire free tickets and then not show up to the event!)",
        "event_link": "https://www.eventbrite.com/e/roslindale-film-society-rushmore-tickets-1303401060659?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#free",
            "#wine",
            "#community",
            "#beer",
            "#movie",
            "#cinema",
            "#film"
        ]
    },
    {
        "title": "Game Audio Hang at Boston Gamedev Week (PAX weekend)",
        "date_time": "Friday, May 9 · 12 - 3pm EDT",
        "location": "Harpoon Brewery & Beer Hall 306 Northern Avenue Boston, MA 02210 Show map",
        "about": "PLEASE NOTE: MUST BE 21+ TO ATTEND. Tickets are limited, and you must RSVP to enter. If you're no longer able to make it, please help someone on the waitlist out by cancelling your ticket. In town for Boston Gamedev Week/PAX East? Just a short walk from the expo hall, join Game Audio Boston and Audiokinetic  chill afternoon with game audio friends. There will be talks! There will be (free) light catering! There will be (paid) beer! Come hang! See the schedule below for what we have in store. Boston Gamedev Week is a brand new slate of developer-facing events happening around PAX East. This game audio hang is sponsored by Audiokinetic and supporeted in part by Boston Game Dev, a local nonprofit supporting the gamedev community in Massachusetts. Please consider donating to BGD to keep events like this going.",
        "event_link": "https://www.eventbrite.com/e/game-audio-hang-at-boston-gamedev-week-pax-weekend-tickets-1323696645299?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Film & Media Networking",
            "#game",
            "#gamedev",
            "#pax",
            "#gamedevelopment",
            "#paxeast",
            "#gameaudio",
            "#bostongamedevweek"
        ]
    },
    {
        "title": "Film Screening: 'Hive' (2021)",
        "date_time": "Monday, April 28 · 6:30 - 8:30pm EDT",
        "location": "S354, CGIS South Building, 1730 Cambridge Street 1730 Cambridge Street Cambridge, MA 02138 Show map",
        "about": "“HIVE,” a poignant and award-winning debut by Blerta Basholli, is an extraordinary story of social resilience in a post-war country. The movie tells the powerful true story of Fahrije, a woman living in post-war Kosovo who, after the disappearance of her husband during the war, struggles to provide for her family in a patriarchal village still reeling from loss. Defying tradition and societal expectations, she starts a small agricultural business with other women whose husbands are also missing. As the community's hostility grows, Fahrije must navigate prejudice and threats to protect her livelihood and dignity. Set against the backdrop of a society grappling with trauma and gender norms, “HIVE” is a story of quiet resistance, resilience, and the pursuit of independence. The film made history by becoming the first Kosovan entry to win three major awards at the Sundance Film Festival in 2021: the Grand Jury Prize, the Audience Award, and the Directing Award in the World Cinema Dramatic category. It was also Kosovo's official submission for the Best International Feature Film at the 2022 Oscars. Following the screening, there will be an informal discussion where attendees are invited to share reflections and thoughts. Refreshments will be provided.",
        "event_link": "https://www.eventbrite.com/e/film-screening-hive-2021-tickets-1333217101239?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Screenings",
            "Cambridge Film & Media Screenings",
            "#event",
            "#movie",
            "#screening",
            "#independence",
            "#kosovo",
            "#film_screening",
            "#gender_norms",
            "#hive_2021"
        ]
    },
    {
        "title": "Frederick Wiseman: A Retrospective",
        "date_time": "Starts on Saturday, May 10 · 2:30pm EDT",
        "location": "DMC Lecture Hall Massachusetts College of Art and Design 621 Huntington Avenue Boston, MA 02115 Show map",
        "about": "Massachusetts College of Art and Design (MassArt) partners with The Brattle Theatre, Coolidge Corner Theatre, IFFBoston, Museum of Fine Arts Boston (MFA), and Somerville Theatre to honor the legacy of acclaimed Boston-born filmmaker Frederick Wiseman with screenings of three of his works. Over a career spanning decades, Wiseman has directed over 40 compelling documentaries that explore the intricacies of social institutions and the human experience. On this special day of screenings, MassArt will showcase two of his powerful documentaries, along with a cinematic presentation of the production that marked his live-theater directorial debut. These films will be presented in newly restored 4K digital versions, offering audiences a fresh look at Wiseman’s groundbreaking work.",
        "event_link": "https://www.eventbrite.com/e/frederick-wiseman-a-retrospective-tickets-1321565360569?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#boston",
            "#cinema",
            "#documentary",
            "#retrospective",
            "#frederick_wiseman"
        ]
    },
    {
        "title": "Movie Night: Inside Out",
        "date_time": "Friday, June 13 · 6 - 8pm EDT",
        "location": "Kendall/MIT Open Space 292 Main Street Cambridge, MA 02142 Show map",
        "about": "Outdoor movie night! Featuring Inside Out (PG). Free popcorn will be provided, while supplies last. 🍿🌃 This program is presented in collaboration with MIT Partners and Spouses Connect. Please note that seating is available on a first come, first served basis; feel free to bring along a blanket or chair. All minors must be accompanied by a responsible adult. Responsible adults, please keep a close eye on your kids. Photos and/or videos will be taken at this event. By entering and attending this event, you acknowledge and agree that your likeness may be included in photos and videos of the event and that those photos and videos may be used by MIT in connection with communications about MIT Open Space Programming or in other MIT communications, and/or shared with third parties, including on the Internet. If you do not agree to this usage, please notify a staff member when you arrive. We are committed to creating an inclusive, accessible environment on our website and in person at our events. If you would like to request a disability-related accommodation, please contact us at openspace@mit.edu as soon as possible to allow us time to respond. Requests made less than 2 weeks before the start date of your program may not be able to be met in time. With any questions, email us at openspace@mit.edu .",
        "event_link": "https://www.eventbrite.com/e/movie-night-inside-out-tickets-1258828673449?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Screenings",
            "Cambridge Film & Media Screenings",
            "#free",
            "#kidsevents",
            "#family_friendly"
        ]
    },
    {
        "title": "FABA Season 1 Film Screening & Celebration",
        "date_time": "Thursday, May 15 · 6 - 9:30pm EDT",
        "location": "Civic Pavilion 5 Congress Street Boston, MA 02203 Show map",
        "about": "Join us as we celebrate FABA Season 1 with a special screening event—featuring the incredible artists and creative crew that made it all happen. Where: Civic Pavillion - Boston When: May 15th, 2025 6-9:30 pm Featuring: 🎶 Networking hour featuring music by 1-800-SHORTKING and light refreshments 💃 A special live dance performance by Afrobeats Dance Boston 🎤 Artist & industry panels featuring: Season 1 artists Ayana Mack, Afrobeats Dance Boston, Billy Dean Thomas, & Punky the Singer Laurel Kulow from Women in Film & Video New England and Jessica Estelle Huggins from Secret Society of Black Creatives This is a FREE event thanks to The City of Boston Arts & Culture Office. This event is all about uplifting our creative community. Don’t miss it! Limited seating available, arrive early if you want to sit in the venue. Overflow viewing is available outside of the venue. Thank you to our partners Another Age Productions , Talamas , Women in Film & Video New England , and Secret Society of Black Creatives",
        "event_link": "https://www.eventbrite.com/e/faba-season-1-film-screening-celebration-tickets-1308897761439?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#community",
            "#celebration",
            "#event",
            "#film_screening",
            "#faba_season_1"
        ]
    },
    {
        "title": "Tuesday Night All Ages (6PM-9PM)",
        "date_time": "Tuesday, April 29 · 6 - 9pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "TUESDAY NIGHT ALL AGES FAMILY NIGHT",
        "event_link": "https://www.eventbrite.com/e/tuesday-night-all-ages-6pm-9pm-tickets-323316166357",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Wednesday Night Adult Night (18+) 7PM-10PM",
        "date_time": "Wednesday, April 30 · 7 - 10pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 7PM-10PM 18+ LIVE DJ WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE NO REFUNDS! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/wednesday-night-adult-night-18-7pm-10pm-tickets-322344018637",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Saturday Open Skate (12pm-3pm)",
        "date_time": "Saturday, May 3 · 12 - 3pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 12pm-3pm All Ages WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE MINORS MUST BE ACCOMPANIED BY AN ADULT NO REFUNDS! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/saturday-open-skate-12pm-3pm-tickets-322325784097",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Saturday Open Skate (4PM-7PM)",
        "date_time": "Saturday, May 3 · 4 - 7pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 4pm-7pm All Ages WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE MINORS MUST BE ACCOMPANIED BY AN ADULT NO REFUNDS! We are excited to have everyone back! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/saturday-open-skate-4pm-7pm-tickets-322330397897",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Sunday Open Skate All Ages 12PM-3PM",
        "date_time": "Sunday, April 27 · 12 - 3pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 12pm-3pm (Sunday) All Ages Ages 2-5 skate FREE at this session! WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE MINORS MUST BE ACCOMPANIED BY AN ADULT NO REFUNDS! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/sunday-open-skate-all-ages-12pm-3pm-tickets-322339796007",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Sunday Open Skate All Ages 4PM-7PM",
        "date_time": "Sunday, April 27 · 4 - 7pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 4PM-7PM (Sunday) All Ages WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE MINORS MUST BE ACCOMPANIED BY AN ADULT NO REFUNDS! We are excited to have everyone back! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/sunday-open-skate-all-ages-4pm-7pm-tickets-322340568317",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Sunday Night Adult Night 21+ (8PM-12AM)",
        "date_time": "Sunday, April 27 · 8 - 11:45pm EDT",
        "location": "Chez-Vous Rollerskating Rink 11 Rhoades Street Dorchester, MA 02124 Show map",
        "about": "Join us weekly from 8pm-12am 21+ (ID WILL BE MANDATORY) - No EXCEPTIONS LIVE DJ and SPECIAL GUESTS! WAIVER MUST BE SIGNED BEFORE ENTERING PRICES ARE ADMISSION BASED WITH SKATE RENTALS INCLUDED SKATES ARE FIRST COME, FIRST SERVE NO VAPE/HOOKAH PENS ONCE YOU EXIT THE BUILDING YOU WILL NOT BE ABLE TO RE-ENTER! NO REFUNDS! We are excited to have everyone back! Please check our website for updates: www.chezvousrollerrink.com",
        "event_link": "https://www.eventbrite.com/e/sunday-night-adult-night-21-8pm-12am-tickets-322342263387",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Film & Media Other",
            "#skating",
            "#roller",
            "#rink",
            "#chez",
            "#vous"
        ]
    },
    {
        "title": "Movie Night: Toy Story",
        "date_time": "Friday, June 27 · 6 - 8pm EDT",
        "location": "Kendall/MIT Open Space 292 Main Street Cambridge, MA 02142 Show map",
        "about": "Outdoor movie night! Featuring Toy Story (G). Free popcorn will be provided, while supplies last. 🍿🌃 Please note that seating is available on a first come, first served basis; feel free to bring along a blanket or chair. All minors must be accompanied by a responsible adult. Responsible adults, please keep a close eye on your kids. Photos and/or videos will be taken at this event. By entering and attending this event, you acknowledge and agree that your likeness may be included in photos and videos of the event and that those photos and videos may be used by MIT in connection with communications about MIT Open Space Programming or in other MIT communications, and/or shared with third parties, including on the Internet. If you do not agree to this usage, please notify a staff member when you arrive. We are committed to creating an inclusive, accessible environment on our website and in person at our events. If you would like to request a disability-related accommodation, please contact us at openspace@mit.edu as soon as possible to allow us time to respond. Requests made less than 2 weeks before the start date of your program may not be able to be met in time. With any questions, email us at openspace@mit.edu .",
        "event_link": "https://www.eventbrite.com/e/movie-night-toy-story-tickets-1258842153769?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Screenings",
            "Cambridge Film & Media Screenings",
            "#family",
            "#free",
            "#kids",
            "#film"
        ]
    },
    {
        "title": "Couch Quests Episode 2: Up in Arms!",
        "date_time": "Wednesday, April 30 · 5 - 8pm EDT",
        "location": "Urban Media Arts 145 Pleasant Street Malden, MA 02148 Show map",
        "about": "Couch Quests Episode 2: Up in Arms! 4 Contestants will be selected from the audience to take on the role of amateur boxers looking to make it big! Our host, Miz Sylver will be the retired pro-boxer who will train them for an exhibition match against an undefeated champion! Do they have what it takes?",
        "event_link": "https://www.eventbrite.com/e/couch-quests-episode-2-up-in-arms-tickets-1312396767059?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Malden, MA",
            "Malden Games",
            "Malden Film & Media Games",
            "#gaming_event",
            "#urbanmediaarts",
            "#couchquests",
            "#maldengamingdistrict"
        ]
    },
    {
        "title": "CAC’s Do It Your Damn Self!! National Youth Film Festival",
        "date_time": "Saturday, June 7 · 5 - 9pm EDT",
        "location": "Kendall/MIT Open Space 292 Main Street Cambridge, MA 02142 Show map",
        "about": "Community Art Center's 28th Annual Do It Your Damn Self!! National Youth Film Festival , the longest running youth film festival in the country! Join us for this outdoor event, celebrating teen voices from across the nation, featuring the 2025 film reel, food trucks, outdoor activities, and a panel discussion with the featured filmmakers. While this event is free and open to all, please note that some of the films include content that might not be appropriate for children. All minors must be accompanied by a responsible adult. Responsible adults, please keep a close eye on your kids. Photos and/or videos will be taken at this event. By entering and attending this event, you acknowledge and agree that your likeness may be included in photos and videos of the event and that those photos and videos may be used by MIT in connection with communications about MIT Open Space Programming or in other MIT communications, and/or shared with third parties, including on the Internet. If you do not agree to this usage, please notify a staff member when you arrive. We are committed to creating an inclusive, accessible environment on our website and in person at our events. If you would like to request a disability-related accommodation, please contact us at openspace@mit.edu as soon as possible to allow us time to respond. Requests made less than 2 weeks before the start date of your program may not be able to be met in time. With any questions, email us at openspace@mit.edu .",
        "event_link": "https://www.eventbrite.com/e/cacs-do-it-your-damn-self-national-youth-film-festival-tickets-1258813347609?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Screenings",
            "Cambridge Film & Media Screenings"
        ]
    },
    {
        "title": "Star Wars Movie Marathon at Lamplighter CX",
        "date_time": "Sunday, May 4 · 2 - 9pm EDT",
        "location": "Lamplighter Brewing Co. - CX 110 North First Street Cambridge, MA 02141 Show map",
        "about": "We're celebrating Star Wars all day with a movie marathon in the upstairs taproom. Grab your lightsabers, don your Jedi robes (or Sith cloaks), and get ready to travel at lightspeed through the entire Star Wars saga! All space and seating is first come first serve, and an RSVP here does not guarantee entry. Questions? Get in touch: events@lamplighterbrewing.com.",
        "event_link": "https://www.eventbrite.com/e/star-wars-movie-marathon-at-lamplighter-cx-tickets-1330849419439?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Screenings",
            "Cambridge Film & Media Screenings",
            "#anniversary",
            "#event",
            "#marathon",
            "#buffy",
            "#vampire_slayer"
        ]
    },
    {
        "title": "Roslindale Film Society: Fantastic Mr. Fox (2009)",
        "date_time": "Sunday, May 4 · 5 - 7:30pm EDT",
        "location": "The Substation 4228 Washington Street Boston, MA 02131 Show map",
        "about": "Join us for a movie night at The Substation! We are presenting a Wes Anderson double-feature. 5:00 pm: Doors open for family movie 5:30 pm: Fantastic Mr. Fox begins 7:00 pm: Doors open for adults-only movie 7:30 pm: Rushmore begins Fantastic Mr. Fox is a 2009 animated adventure comedy film directed by Wes Anderson, with voices from stars George Clooney, Meryl Streep, Bill Murray, and Owen Wilson. In the film, a spree of thefts led by Mr. Fox results in his community being hunted down by three farmers. RATED PG. BRING YOUR OWN lawn chairs, cushions, blankets, or perch on one of our benches. For the adults, the Substation bar is open! This event is brought to you FREE through generous financial contribution from The Boston Home Team and the Mass Cultural Council . Donations are optional at the door. Beer, wine, and food will be available for purchase. Tickets are limited, so please, if you cannot attend after purchasing tickets, cancel them on eventbrite so that others may have a chance to attend this FREE screening. (Don't acquire free tickets and then not show up to the event!)",
        "event_link": "https://www.eventbrite.com/e/roslindale-film-society-fantastic-mr-fox-2009-tickets-1303392795939?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#family",
            "#free",
            "#wine",
            "#beer",
            "#animation",
            "#movie",
            "#film",
            "#familyfriendly",
            "#community_event",
            "#fantastic_mr_fox"
        ]
    },
    {
        "title": "Friday Films: Minari",
        "date_time": "Friday, May 23 · 2 - 4pm EDT",
        "location": "Parker Hill Branch of the Boston Public Library 1497 Tremont Street Boston, MA 02120 Show map",
        "about": "Join us on May 23 for a screening of Minari , in which a Korean American family moves to an Arkansas farm in search of its own American dream. Amidst the challenges of new life in the strange and rugged Ozarks, they discover the undeniable resilience of family and what really makes a home. Run time: 1 hr 55 minutes; Rated PG-13; Closed captioning available. \"Chung has a knack for capturing those moments when people behave according to their own internal compass, in ways that may not make sense to an outside observer. And it’s impossible not to appreciate the deep understanding of human behavior, as well as the way that ordinary objects and situations acquire symbolic meaning when we think about them in relation to the characters. This is a lovely, unique film.\" - Matt Zoller Seitz, Roger Ebert",
        "event_link": "https://www.eventbrite.com/e/friday-films-minari-tickets-1331847424499?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#moviescreening",
            "#filmscreening",
            "#movie_night",
            "#film_screening",
            "#boston_events",
            "#movie_screening",
            "#minari",
            "#boston_event"
        ]
    },
    {
        "title": "Friends Trivia at the Boston Public Market",
        "date_time": "Friday, May 30 · 5:30 - 7:30pm EDT",
        "location": "Boston Public Market 100 Hanover Street Boston, MA 02108 Show map",
        "about": "Join us in the Hub on Friday, May 30 for a night of Friends themed trivia! Brush up on the most iconic episodes, memorable moments, and quotable lines and head to BPM for a chance to win! Games start at 5:30 & 6:30 PM for prizes. Grab a drink from the Pine Bar and something to eat from one of our local, artisan food vendors! 🍺🍽️ Your ticket serves as an RSVP and will not be required for admission. This event is first-come, first-seated and we recommend arriving early to guarantee a spot.",
        "event_link": "https://www.eventbrite.com/e/friends-trivia-at-the-boston-public-market-tickets-1330312373119?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Film & Media Games",
            "#boston",
            "#fun",
            "#event",
            "#trivia",
            "#free_event"
        ]
    },
    {
        "title": "Open Mic Industry Night @ Bar Moxy",
        "date_time": "Monday, April 28 · 7 - 10pm EDT",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Get ready for a night of comedy and stunning city views. Join us for Open Mic Night in Area 24, the rooftop bar located on the 24th floor of the Moxy Hotel. From 7 PM to 10 PM on Monday's we're bringing together Boston’s local comedians for an unforgettable evening of entertainment. With the Boston skyline as your backdrop, enjoy the perfect setting for laughs and drinks. Whether you're a comedian eager to take the stage or a guest looking for a night of laughter, all are welcome. Tickets are free, and sign-ups to perform will be available at the event. Adding to the fun, Sam Adams, Short Path, and Narragansett will be joining us, offering beer samples and handing out swag. What you can expect: A lineup of talented local comedians A rooftop setting with breathtaking views of Boston Complimentary beer samples and giveaways from local breweries Drinks and snacks available for purchase at the bar",
        "event_link": "https://www.eventbrite.com/e/open-mic-industry-night-bar-moxy-tickets-1261636872849?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Film & Media Performances",
            "#music",
            "#event",
            "#openmic",
            "#moxy",
            "#industrynight",
            "#bostoncomedy",
            "#comedy_event",
            "#barmoxy",
            "#bar_moxy"
        ]
    },
    {
        "title": "Southie Book Club at Castle Island Brewing Co.",
        "date_time": "Monday, April 28 · 6:30 - 9pm EDT",
        "location": "Castle Island Brewing - South Boston 10 Old Colony Avenue Boston, MA 02127 Show map",
        "about": "Interested in joining our new book club? We'd love to have you! Book club meets the last Monday of every month. The group votes on the book If you haven't submitted your email already, fill out and we'll add you to the mailing list to stay on top of monthly book votes, meeting times and more!",
        "event_link": "https://www.eventbrite.com/e/southie-book-club-at-castle-island-brewing-co-tickets-1297835092699?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Film & Media Seminars",
            "#wine",
            "#brewery",
            "#reading",
            "#boston",
            "#beer",
            "#books",
            "#bookclub"
        ]
    },
    {
        "title": "Survivor Weekly Watch Party",
        "date_time": "Wednesday, April 30 · 8 - 10pm EDT",
        "location": "Lamplighter Brewing Co. - CX 110 North First Street Cambridge, MA 02141 Show map",
        "about": "Join us every Wednesday at Lamplighter CX for a Survivor watch party you won’t want to miss! Grab your friends and settle in for the most thrilling, strategic, and jaw-dropping moments of Survivor . We'll have special beer flights every week to have you feeling island-ready. But don't let the beers distract you from the competition - we'll also be playing survivor bingo, with the winners getting a chance to spin the prize wheel. The competition will be fierce on and off the screen. Doors open at 7:00 pm, with the screening starting at 8:00 pm. All seating is first come, first serve, so plan on arriving early if you have a larger group. Please note that this event is 21+ and all guests must show a valid government-issued ID upon entry to our taproom. All space and seating is first come first serve, and an RSVP here does not guarantee entry. Questions? Get in touch: events@lamplighterbrewing.com.",
        "event_link": "https://www.eventbrite.com/e/survivor-weekly-watch-party-tickets-1246453799869?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Screenings",
            "Cambridge Film & Media Screenings",
            "#house",
            "#event",
            "#show",
            "#screening",
            "#dragon"
        ]
    },
    {
        "title": "Sunday Scaries",
        "date_time": "Sunday, April 27 · 7 - 10pm EDT",
        "location": "Samuel Adams Boston Brewery 30 Germania St Boston, MA 02130 Show map",
        "about": "Escape the dread of the impending week at the brewery with our weekly watch parties! Each month, we’ll explore a new theme, from heartwarming romances to pulse-pounding thrillers, timeless classics to animated adventures. Grab a brewery exclusive beer or your favorite seasonal and cozy up in from the big screen in the Taproom. Movie begins promptly at 6pm. April's theme... Boston! Screening on: April 6 - Coda April 13  - Good Will Hunting April 20  - 21 April 27 - Legally Blonde",
        "event_link": "https://www.eventbrite.com/e/sunday-scaries-tickets-1126282965669?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#brewery",
            "#boston",
            "#beer",
            "#weekend",
            "#movie",
            "#craftbeer",
            "#watchparty",
            "#taproom",
            "#movie_night"
        ]
    },
    {
        "title": "SUND4Y SERVICE",
        "date_time": "April 27 · 10pm - April 28 · 2am EDT",
        "location": "Icon Nightclub 100 Warrenton Street Boston, MA 02116 Show map",
        "about": "L4TIN VISION BRINGS YOPU ALL THE LATIN / HIP HOP AND AFRO BEATS VIBES EVERY AND EVERY SUNDAY LADIES ARE FREE BEFORE 11. REDUCED PRICE WITH RSVP IS $20 IF YOU HAVE QUESTIONS REGUARDING VIP OR GUEST LIST PLEASE DM @SUND4Y_SERVICE OR TEXT 857.991.2394",
        "event_link": "https://www.eventbrite.com/e/sund4y-service-tickets-1222963730439?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Film & Media Performances",
            "#hiphop",
            "#boston",
            "#latin",
            "#nightlife",
            "#club",
            "#afrobeats",
            "#dembow",
            "#sundayfunday",
            "#fyp"
        ]
    },
    {
        "title": "FREE VHS MOVIE NIGHT",
        "date_time": "Friday, May 2 · 7 - 11pm EDT",
        "location": "GrandTen Distilling 383 Dorchester Avenue Boston, MA 02127 Show map",
        "about": "FREE VHS Movie Night – Friday, May 2 📍 Grand Ten Distilling, South Boston, MA 🎬 Final Destination – 7PM 🎬 The Craft – 9PM Two cult classics. One big screen. Totally free. 21+ only. Come early, grab a drink, and relive the VHS era.",
        "event_link": "https://www.eventbrite.com/e/free-vhs-movie-night-tickets-1338878715279?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#nostalgia",
            "#free_event",
            "#vhs",
            "#movie_night",
            "#retro_movies"
        ]
    },
    {
        "title": "Screening: Gold Run (2022)",
        "date_time": "Saturday, May 10 · 1 - 3pm EDT",
        "location": "Scandinavian Cultural Center 206 Waltham Street Newton, MA 02465 Show map",
        "about": "Presented as the Library’s May film choice: Gold Run (2022) April 9, 1940. The German war machine occupies Norway. One of their primary objectives is to seize the nation’s entire gold reserves. But thanks to a few courageous individuals, the gold is smuggled out – just as the Germans come.​​ Based on true events, ​​Gold Run tells the story of how 55 tons of gold was transported through rough winter landscapes on trucks, trains and boats​ by a group of unlikely resistance fighters ahead of the invading Nazi forces. Saturday, May 10th | 1pm | $10; $5 for members In Norwegian with English subtitles | Drama, War, Thriller | 114 minutes",
        "event_link": "https://www.eventbrite.com/e/screening-gold-run-2022-tickets-1110720778749?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Newton, MA",
            "Newton Screenings",
            "Newton Film & Media Screenings",
            "#film",
            "#culture",
            "#screening",
            "#scandinavian",
            "#norwegian",
            "#library_events",
            "#gold_run"
        ]
    },
    {
        "title": "Screening: Odd Fish (2024)",
        "date_time": "Saturday, June 14 · 1 - 2pm EDT",
        "location": "Scandinavian Cultural Center 206 Waltham Street Newton, MA 02465 Show map",
        "about": "Presented as June's Library film choice: Odd Fish (Ljósvíkingar) Odd Fish (Icelandic: Ljósvíkingar) is a 2023 Icelandic drama film directed and written by Snævar Sölvi Sölvason. When two childhood friends get an unexpected opportunity to keep their fish restaurant open all year round, one of them comes out of the closet as a trans woman, putting a strain on their friendship and they see their lives in a new light. Saturday June 14th | 1pm | $10; $5 for members | Tickets In Icelandic with English subtitles | Drama | 104 min.",
        "event_link": "https://www.eventbrite.com/e/screening-odd-fish-2024-tickets-1120969502959?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Newton, MA",
            "Newton Screenings",
            "Newton Film & Media Screenings",
            "#event",
            "#lgbtq",
            "#movie",
            "#film",
            "#nordic",
            "#screening",
            "#scandinavian",
            "#iceland"
        ]
    },
    {
        "title": "Film Night: \"Recovery City\" (2024) Indie Documentary Showing",
        "date_time": "Thursday, May 15 · 6 - 8pm EDT.Doors at 5:45pm",
        "location": "Thomas Crane Public Library 40 Washington Street Quincy, MA 02169 Show map",
        "about": "Community Meeting Room, 40 Washington Street, Quincy, MA, 02169 Please join us for a screening of the documentary Recovery City , an intimate, unflinching portrait of four bold women who refuse to let themselves or their community give in to the stigma and despair of addiction. Recovery City (2024) - a feature documentary by Lisa Olivieri A raw exploration of what it means to be in recovery as seen through the eyes of four women whose lives share a common thread: addiction. In the working class city of Worcester, Massachusetts, Christine fights to regain custody of her young children while grappling with a traumatic past, and battling stigma from the very systems that are designed to help her. Bridget, who found recovery while in prison, now facilitates peer-led support meetings for women. On the frontlines, recovery coaches Janis and Rebecca navigate the city’s toughest corners offering support and trying to save lives. In this portrait of resilience, grit, and camaraderie, the women use their lived experience to lift up those still struggling while refusing to give up hope. Funding for the film provided by: The LEF Foundation, Reliant Foundation, SOAR Natick, Framingham Force, Schwartz Charitable Foundation, Mass Cultural Council, Watertown Cultural Council and Private Individuals. This program is made possible by the generous sponsorship of the Friends of the Thomas Crane Public Library .",
        "event_link": "https://www.eventbrite.com/e/film-night-recovery-city-2024-indie-documentary-showing-tickets-1322447388739?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Quincy, MA",
            "Quincy Screenings",
            "Quincy Film & Media Screenings",
            "#free",
            "#women",
            "#addiction",
            "#resilience",
            "#local",
            "#library",
            "#recovery",
            "#indie",
            "#documentary",
            "#mental_health"
        ]
    },
    {
        "title": "Sati May 10  Mike Henley @  Giggles Comedy Club @ Prince Restaurant",
        "date_time": "Saturday, May 10 · 8:30 - 10pm EDT",
        "location": "517 Broadway 517 Broadway Saugus, MA 01906 Show map",
        "about": "Show 8:30 pm Doors open 7:00 pm Special Event Mike Henley, Jessica Casciano and Johnny Pizzi. There are no guarantees of individual tables. All seating is shared. ***If you are sitting with a group and have purchased your tickets separately, Please have one member of your group e mail us a list to reserve a table together. Check out Prince Restaurant's menu which is available before and during the show https://www.princerestaurant.com/in-house-menu/",
        "event_link": "https://www.eventbrite.com/e/sati-may-10-mike-henley-giggles-comedy-club-prince-restaurant-tickets-1277908441549?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Saugus, MA",
            "Saugus Performances",
            "Saugus Film & Media Performances"
        ]
    },
    {
        "title": "Sat  May 3 Tony V @  Giggles Comedy Club @ Prince Restaurant",
        "date_time": "Saturday, May 3 · 8:30 - 10pm EDT",
        "location": "517 Broadway 517 Broadway Saugus, MA 01906 Show map",
        "about": "Show 8:30 pm Doors open 7:00 pm Special Event Tony V, Carolyn Plummer and Chris Justice. There are no guarantees of individual tables. All seating is shared. ***If you are sitting with a group and have purchased your tickets separately, Please have one member of your group e mail us a list to reserve a table together. Check out Prince Restaurant's menu which is available before and during the show https://www.princerestaurant.com/in-house-menu/",
        "event_link": "https://www.eventbrite.com/e/sat-may-3-tony-v-giggles-comedy-club-prince-restaurant-tickets-1277903195859?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Saugus, MA",
            "Saugus Performances",
            "Saugus Film & Media Performances"
        ]
    },
    {
        "title": "Sun May 25   Lenny Clarke and Friends  @  Giggles Comedy Club @ Prince",
        "date_time": "Sunday, May 25 · 8 - 9:30pm EDT",
        "location": "517 Broadway 517 Broadway Saugus, MA 01906 Show map",
        "about": "Show 8:00 pm Doors open 6:00 pm Special Event Comedy Extravaganza: Lenny Clarke, Christine Hurley, Artie Januario, Ken Rogerson, Steve Sweeney and Johnny Pizzi. There are no guarantees of individual tables. All seating is shared. ***If you are sitting with a group and have purchased your tickets separately, Please have one member of your group e mail us a list to reserve a table together. Check out Prince Restaurant's menu which is available before and during the show https://www.princerestaurant.com/in-house-menu/",
        "event_link": "https://www.eventbrite.com/e/sun-may-25-lenny-clarke-and-friends-giggles-comedy-club-prince-tickets-1280925385309?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Saugus, MA",
            "Saugus Performances",
            "Saugus Film & Media Performances"
        ]
    },
    {
        "title": "Sat  May 17 Steve Sweeney  @  Giggles Comedy Club @ Prince Restaurant",
        "date_time": "Saturday, May 17 · 8:30 - 10pm EDT",
        "location": "517 Broadway 517 Broadway Saugus, MA 01906 Show map",
        "about": "Show 8:30 pm Doors open 7:00 pm Special Event Steve Sweeney, Jason Merrill and Matt Misci. There are no guarantees of individual tables. All seating is shared. ***If you are sitting with a group and have purchased your tickets separately, Please have one member of your group e mail us a list to reserve a table together. Check out Prince Restaurant's menu which is available before and during the show https://www.princerestaurant.com/in-house-menu/",
        "event_link": "https://www.eventbrite.com/e/sat-may-17-steve-sweeney-giggles-comedy-club-prince-restaurant-tickets-1277918140559?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Saugus, MA",
            "Saugus Performances",
            "Saugus Film & Media Performances"
        ]
    },
    {
        "title": "Movie Night: Toy Story",
        "date_time": "Friday, June 27 · 6 - 8pm EDT",
        "location": "Kendall/MIT Open Space 292 Main Street Cambridge, MA 02142 Show map",
        "about": "Outdoor movie night! Featuring Toy Story (G). Free popcorn will be provided, while supplies last. 🍿🌃 Please note that seating is available on a first come, first served basis; feel free to bring along a blanket or chair. All minors must be accompanied by a responsible adult. Responsible adults, please keep a close eye on your kids. Photos and/or videos will be taken at this event. By entering and attending this event, you acknowledge and agree that your likeness may be included in photos and videos of the event and that those photos and videos may be used by MIT in connection with communications about MIT Open Space Programming or in other MIT communications, and/or shared with third parties, including on the Internet. If you do not agree to this usage, please notify a staff member when you arrive. We are committed to creating an inclusive, accessible environment on our website and in person at our events. If you would like to request a disability-related accommodation, please contact us at openspace@mit.edu as soon as possible to allow us time to respond. Requests made less than 2 weeks before the start date of your program may not be able to be met in time. With any questions, email us at openspace@mit.edu .",
        "event_link": "https://www.eventbrite.com/e/movie-night-toy-story-tickets-1258842153769",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Screenings",
            "Cambridge Film & Media Screenings",
            "#family",
            "#free",
            "#kids",
            "#film"
        ]
    },
    {
        "title": "Couch Quests Episode 2: Up in Arms!",
        "date_time": "Wednesday, April 30 · 5 - 8pm EDT",
        "location": "Urban Media Arts 145 Pleasant Street Malden, MA 02148 Show map",
        "about": "Couch Quests Episode 2: Up in Arms! 4 Contestants will be selected from the audience to take on the role of amateur boxers looking to make it big! Our host, Miz Sylver will be the retired pro-boxer who will train them for an exhibition match against an undefeated champion! Do they have what it takes?",
        "event_link": "https://www.eventbrite.com/e/couch-quests-episode-2-up-in-arms-tickets-1312396767059",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Malden, MA",
            "Malden Games",
            "Malden Film & Media Games",
            "#gaming_event",
            "#urbanmediaarts",
            "#couchquests",
            "#maldengamingdistrict"
        ]
    },
    {
        "title": "CAC’s Do It Your Damn Self!! National Youth Film Festival",
        "date_time": "Saturday, June 7 · 5 - 9pm EDT",
        "location": "Kendall/MIT Open Space 292 Main Street Cambridge, MA 02142 Show map",
        "about": "Community Art Center's 28th Annual Do It Your Damn Self!! National Youth Film Festival , the longest running youth film festival in the country! Join us for this outdoor event, celebrating teen voices from across the nation, featuring the 2025 film reel, food trucks, outdoor activities, and a panel discussion with the featured filmmakers. While this event is free and open to all, please note that some of the films include content that might not be appropriate for children. All minors must be accompanied by a responsible adult. Responsible adults, please keep a close eye on your kids. Photos and/or videos will be taken at this event. By entering and attending this event, you acknowledge and agree that your likeness may be included in photos and videos of the event and that those photos and videos may be used by MIT in connection with communications about MIT Open Space Programming or in other MIT communications, and/or shared with third parties, including on the Internet. If you do not agree to this usage, please notify a staff member when you arrive. We are committed to creating an inclusive, accessible environment on our website and in person at our events. If you would like to request a disability-related accommodation, please contact us at openspace@mit.edu as soon as possible to allow us time to respond. Requests made less than 2 weeks before the start date of your program may not be able to be met in time. With any questions, email us at openspace@mit.edu .",
        "event_link": "https://www.eventbrite.com/e/cacs-do-it-your-damn-self-national-youth-film-festival-tickets-1258813347609",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Screenings",
            "Cambridge Film & Media Screenings"
        ]
    },
    {
        "title": "Star Wars Movie Marathon at Lamplighter CX",
        "date_time": "Sunday, May 4 · 2 - 9pm EDT",
        "location": "Lamplighter Brewing Co. - CX 110 North First Street Cambridge, MA 02141 Show map",
        "about": "We're celebrating Star Wars all day with a movie marathon in the upstairs taproom. Grab your lightsabers, don your Jedi robes (or Sith cloaks), and get ready to travel at lightspeed through the entire Star Wars saga! All space and seating is first come first serve, and an RSVP here does not guarantee entry. Questions? Get in touch: events@lamplighterbrewing.com.",
        "event_link": "https://www.eventbrite.com/e/star-wars-movie-marathon-at-lamplighter-cx-tickets-1330849419439",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Screenings",
            "Cambridge Film & Media Screenings",
            "#anniversary",
            "#event",
            "#marathon",
            "#buffy",
            "#vampire_slayer"
        ]
    },
    {
        "title": "Sunday Scaries",
        "date_time": "Sunday, April 27 · 7 - 10pm EDT",
        "location": "Samuel Adams Boston Brewery 30 Germania St Boston, MA 02130 Show map",
        "about": "Escape the dread of the impending week at the brewery with our weekly watch parties! Each month, we’ll explore a new theme, from heartwarming romances to pulse-pounding thrillers, timeless classics to animated adventures. Grab a brewery exclusive beer or your favorite seasonal and cozy up in from the big screen in the Taproom. Movie begins promptly at 6pm. April's theme... Boston! Screening on: April 6 - Coda April 13  - Good Will Hunting April 20  - 21 April 27 - Legally Blonde",
        "event_link": "https://www.eventbrite.com/e/sunday-scaries-tickets-1126282965669",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Screenings",
            "Boston Film & Media Screenings",
            "#brewery",
            "#boston",
            "#beer",
            "#weekend",
            "#movie",
            "#craftbeer",
            "#watchparty",
            "#taproom",
            "#movie_night"
        ]
    },
    {
        "title": "SUND4Y SERVICE",
        "date_time": "April 27 · 10pm - April 28 · 2am EDT",
        "location": "Icon Nightclub 100 Warrenton Street Boston, MA 02116 Show map",
        "about": "L4TIN VISION BRINGS YOPU ALL THE LATIN / HIP HOP AND AFRO BEATS VIBES EVERY AND EVERY SUNDAY LADIES ARE FREE BEFORE 11. REDUCED PRICE WITH RSVP IS $20 IF YOU HAVE QUESTIONS REGUARDING VIP OR GUEST LIST PLEASE DM @SUND4Y_SERVICE OR TEXT 857.991.2394",
        "event_link": "https://www.eventbrite.com/e/sund4y-service-tickets-1222963730439",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Film & Media Performances",
            "#hiphop",
            "#boston",
            "#latin",
            "#nightlife",
            "#club",
            "#afrobeats",
            "#dembow",
            "#sundayfunday",
            "#fyp"
        ]
    },
    {
        "title": "Southie Book Club at Castle Island Brewing Co.",
        "date_time": "Monday, April 28 · 6:30 - 9pm EDT",
        "location": "Castle Island Brewing - South Boston 10 Old Colony Avenue Boston, MA 02127 Show map",
        "about": "Interested in joining our new book club? We'd love to have you! Book club meets the last Monday of every month. The group votes on the book If you haven't submitted your email already, fill out and we'll add you to the mailing list to stay on top of monthly book votes, meeting times and more!",
        "event_link": "https://www.eventbrite.com/e/southie-book-club-at-castle-island-brewing-co-tickets-1297835092699",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Film & Media Seminars",
            "#wine",
            "#brewery",
            "#reading",
            "#boston",
            "#beer",
            "#books",
            "#bookclub"
        ]
    },
    {
        "title": "Open Mic Industry Night @ Bar Moxy",
        "date_time": "Monday, April 28 · 7 - 10pm EDT",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Get ready for a night of comedy and stunning city views. Join us for Open Mic Night in Area 24, the rooftop bar located on the 24th floor of the Moxy Hotel. From 7 PM to 10 PM on Monday's we're bringing together Boston’s local comedians for an unforgettable evening of entertainment. With the Boston skyline as your backdrop, enjoy the perfect setting for laughs and drinks. Whether you're a comedian eager to take the stage or a guest looking for a night of laughter, all are welcome. Tickets are free, and sign-ups to perform will be available at the event. Adding to the fun, Sam Adams, Short Path, and Narragansett will be joining us, offering beer samples and handing out swag. What you can expect: A lineup of talented local comedians A rooftop setting with breathtaking views of Boston Complimentary beer samples and giveaways from local breweries Drinks and snacks available for purchase at the bar",
        "event_link": "https://www.eventbrite.com/e/open-mic-industry-night-bar-moxy-tickets-1261636872849",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Film & Media Performances",
            "#music",
            "#event",
            "#openmic",
            "#moxy",
            "#industrynight",
            "#bostoncomedy",
            "#comedy_event",
            "#barmoxy",
            "#bar_moxy"
        ]
    }
]