[
    {
        "title": "Ocean Vuong at First Parish Church",
        "date_time": "Starts on Friday, May 16 · 7pm EDT",
        "location": "First Parish Church 1446 Massachusetts Ave Cambridge, MA 02138 Show map",
        "about": "Harvard Book Store welcomes Ocean Vuong —author of the critically acclaimed poetry collections Night Sky with Exit Wounds and Time Is a Mother , as well as the New York Times bestselling novel On Earth We’re Briefly Gorgeous —for a discussion of his new novel The Emperor of Gladness . He will be joined in conversation by Emiko Tamagawa —senior producer for Here & Now for their arts and culture segments. Ticketing Tickets include admission for one and one hardcover copy of The Emperor of Gladness pre-signed by the author. Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event. About The Emperor of Gladness Ocean Vuong returns with a bighearted novel about chosen family, unexpected friendship, and the stories we tell ourselves in order to survive. One late summer evening in the post-industrial town of East Gladness, Connecticut, nineteen-year-old Hai stands on the edge of a bridge in pelting rain, ready to jump, when he hears someone shout across the river. The voice belongs to Grazina, an elderly widow succumbing to dementia, who convinces him to take another path. Bereft and out of options, he quickly becomes her caretaker. Over the course of the year, the unlikely pair develops a life-altering bond, one built on empathy, spiritual reckoning, and heartbreak, with the power to transform Hai’s relationship to himself, his family, and a community on the brink. Following the cycles of history, memory, and time, The Emperor of Gladness shows the profound ways in which love, labor, and loneliness form the bedrock of American life. At its heart is a brave epic about what it means to exist on the fringes of society and to reckon with the wounds that haunt our collective soul. Hallmarks of Ocean Vuong’s writing—formal innovation, syntactic dexterity, and the ability to twin grit with grace through tenderness—are on full display in this story of loss, hope, and how far we would go to possess one of life’s most fleeting mercies: a second chance. Bios Ocean Vuong is the author of the critically acclaimed poetry collections Night Sky with Exit Wounds and Time Is a Mother , as well as the New York Times bestselling novel On Earth We’re Briefly Gorgeous . A recipient of the MacArthur “Genius Grant\" and the American Book Award, he used to work as a fast-food server, which inspired The Emperor of Gladness . Born in Saigon, Vietnam, he currently splits his time between Northampton, Massachusetts, and New York City. Emiko Tamagawa is a senior producer for Here & Now . Tamagawa produces arts and culture segments for Here & Now. She studied psychology and drama at Yale and Brandeis, and toured colleges and high schools with her one-woman show about the Japanese-American internment before turning to radio. Masking Policy Masks are encouraged but not required for this event.",
        "event_link": "https://www.eventbrite.com/e/ocean-vuong-at-first-parish-church-tickets-1291383235019?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Hobbies Seminars"
        ]
    },
    {
        "title": "Hotter in The Hamptons Book Launch & Author Photo Op",
        "date_time": "Wednesday, May 7 · 6 - 10pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "Get ready for a sizzling celebration with Tinx! Celebrate the author’s fiction debut, Hotter in The Hamptons on Wednesday, May 7th and bring home a signed copy! Tinx's latest novel follows NYC it-girl Lola King as she escapes to the Hamptons to lay low after a scandal—only to find herself living next door to her rival, Aly Ray Carter, the culture critic who tore her down in a brutal exposé. As the summer blazes on, Lola is drawn to the woman who ruined her life, realizing that some chaos can’t be outrun. Hotter in The Hamptons is everything you love about Tinx—bold, unapologetic, and filled with complex, real women. This novel is spicy, raunchy, and absolutely captivating. EVENT DETAILS Your ticket will include a pre-signed copy of Tinx’s latest novel, Hotter in The Hamptons ! You’ll also get a chance to snap a photo with the author. You’ll receive a QR code to easily download your picture after the event. Tickets are assigned to specific time slots. To help minimize wait times for everyone, please arrive at your designated time. Late arrivals will be directed to the end of the line to ensure fairness to those who arrived on time. Please be respectful of others waiting and help keep the line moving when it’s your turn to meet Tinx and pick up your book. During your time slot, ex: 6PM - 6:30 PM, you will get in line to meet Tinx and get your photo taken. Then you will move on to picking up your book. During your 30 minute time slot, you will have roughly 30 minutes to shop the store. Once your time slot is over, we will make an annoucement on the PA asking that time slot to exit the store, so the next time slot can enter. Please be respectful and honor your time slot. The bar will be open- first come, first serve. Please note that there won’t be any personalizations at this event. Tinx will only be pre-signing Hotter in The Hamptons , so we kindly ask that you don’t bring any other books from home. Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person. PARKING AND TRANSPORTATION There is metered street parking. You can also park at The Charles Hotel, or take the Red Line to Harvard Sq.",
        "event_link": "https://www.eventbrite.com/e/hotter-in-the-hamptons-book-launch-author-photo-op-tickets-1296098999999?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Appearances",
            "Cambridge Hobbies Appearances",
            "#meetandgreet",
            "#booklaunch",
            "#author_event",
            "#book_launch",
            "#summer_event",
            "#book_release",
            "#fiction_books",
            "#author_meetup",
            "#tinx",
            "#hotter_in_the_hamptons"
        ]
    },
    {
        "title": "Alison Bechdel at The Brattle Theatre",
        "date_time": "Starts on Thursday, May 22 · 6pm EDT",
        "location": "The Brattle Theatre 40 Brattle St. Cambridge, MA 02138 Show map",
        "about": "Harvard Book Store welcomes beloved New York Times bestselling author Alison Bechdel —author of Fun Home , which was a Time magazine #1 Book of the Year graphic memoir and was adapted into a Tony Award–winning musical—to celebrate the release of her new comic novel Spent , a laugh-out-loud, brilliant, and passionately political work of autofiction. Ticketing Tickets include admission for one and one hardcover copy of Spent pre-signed by the author. Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event. About Spent In Alison Bechdel’s hilariously skewering and gloriously cast new comic novel confection, a cartoonist named Alison Bechdel, running a pygmy goat sanctuary in Vermont, is existentially irked by a climate-challenged world and a citizenry on the brink of civil war. She wonders: Can she pull humanity out of its death spiral by writing a scathingly self-critical memoir about her own greed and privilege? Meanwhile, Alison’s first graphic memoir about growing up with her father, a taxidermist who specialized in replicas of Victorian animal displays, has been adapted into a highly successful TV series. It’s a phenomenon that makes Alison, formerly on the cultural margins, the envy of her friend group (recognizable as characters, now middle-aged and living communally in Vermont, from Bechdel’s beloved comic strip Dykes to Watch Out For ). As the TV show Death and Taxidermy racks up Emmy after Emmy—and when Alison’s Pauline Bunyanesque partner Holly posts an instructional wood-chopping video that goes viral—Alison’s own envy spirals. Why couldn’t she be the writer for a critically lauded and wildly popular reality TV show…like Queer Eye ...showing people how to free themselves from consumer capitalism and live a more ethical life?!! Spent ’s rollicking and masterful denouement—making the case for seizing what’s true about life in the world at this moment, before it’s too late—once again proves that “nobody does it better” ( New York Times Book Review ) than the real Alison Bechdel. Bio Alison Bechdel’s cult following for her early comic strip Dykes to Watch Out For expanded wildly for her family memoirs, the New York Times bestselling and Time magazine #1 Book of the Year graphic memoir Fun Home , adapted into a Tony Award–winning musical, and Are You My Mother? Most recently, The Secret to Superman Strength was named a New York Times Best Graphic Novel of 2021. Bechdel has been named a MacArthur Fellow, among many other honors. Masking Policy Masks are encouraged but not required for this event.",
        "event_link": "https://www.eventbrite.com/e/alison-bechdel-at-the-brattle-theatre-tickets-1295783817279?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Hobbies Seminars"
        ]
    },
    {
        "title": "Shelby Van Pelt with Emily Habeck: Remarkably Bright Creatures",
        "date_time": "Starts on Wednesday, April 30 · 6pm EDT",
        "location": "Coolidge Corner Theatre 290 Harvard St Brookline, MA 02446 Show map",
        "about": "Live and in person at the Coolidge Corner Theatre with Brookline Booksmith, celebrate the paperback release of Remarkably Bright Creatures with author Shelby Van Pelt, in conversation with Emily Habeck. Register for the event! This event is ticketed. Tickets include a general admission seat at the event and a copy of Remarkably Bright Creatures. Ticketholders will receive email updates with important details about the program, including safety requirements, cancellations, and book signing updates. Signed books! This event will include a live signing at the end of the talk, taking place across the street from the theater at Brookline Booksmith. Can't make it to the event? We can ship you a signed copy of the book! Pick \"Remarkably Bright Creatures(priority mail)\" for this option. Book orders are processed for pickup or shipping after ticket sales have closed.",
        "event_link": "https://www.eventbrite.com/e/shelby-van-pelt-with-emily-habeck-remarkably-bright-creatures-tickets-1224178543979?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#literature",
            "#author",
            "#fiction",
            "#bookstore",
            "#booklaunch",
            "#novel",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "SOLD OUT!John B. King, Jr. with Jennifer De Leon: Teacher by Teacher",
        "date_time": "Starts on Thursday, May 8 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "We have reached capacity  and RSVPs are now closed. There will not be a waitlist. Signed books are still available to purchase, to be shipped or picked up after the event. In person at Brookline Booksmith! Celebrate the release of Teacher By Teacher with author John B. King, Jr., in conversation with Jennifer De Leon. This event is cosponsored by the Puerto Rican Festival of Massachusetts (PRFMA). Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/sold-outjohn-b-king-jr-with-jennifer-de-leon-teacher-by-teacher-tickets-1294956332249?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "The Thrashers Release Party with Julie Soto",
        "date_time": "Monday, May 5 · 7 - 9pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "Join Lovestruck Books on Monday, May 5 to celebrate the release of The Thrashers by Julie Soto! In conversation with Shirlene Obuobi, Julie will discuss The Thrashers — a gripping YA thriller that delves into the complexities of teenage relationships and the struggles of self-worth. This haunting mystery follows a girl who won’t let go— even from beyond the grave . Brutal, heart-wrenching, and utterly riveting, it explores the dark, obsessive side of infatuation. Celebrate the release and get excited to read! Your ticket includes your very own copy of The Thrashers! Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person. EVENT DETAILS 6:30 PM: Doors Open – Get settled in and ready for the discussion! 7:00 PM: Discussion Begins – Julie and Shirlene will dive into The Thrashers. 7:45 PM: Q&A Session – Your chance to ask Julie anything! 8:00 PM: Signatures, Snapping Pics, and Salutations – Meet Julie, get your book signed, and snap a photo! 9:00 PM: Event Wraps Up – Thanks for joining us! To help everything run smoothly and ensure everyone gets a great experience, please review the signing guidelines below: Julie will personalize copies of The Thrashers only. In addition, she will sign up to two extra items , which may include books brought from home or purchased at the event. Fanbound manuscripts or bound fanfiction are totally welcome, but they will count as one of your two additional signed items. Julie is happy to take pictures with readers . Thanks for helping us make this a fun, relaxed, and respectful signing experience for everyone. We can't wait to see you there!",
        "event_link": "https://www.eventbrite.com/e/the-thrashers-release-party-with-julie-soto-tickets-1280906238039?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Hobbies Parties",
            "#book",
            "#bookstore",
            "#bookclub",
            "#booksigning",
            "#bookwriting",
            "#author_event",
            "#book_discussion",
            "#author_talk",
            "#romantasy"
        ]
    },
    {
        "title": "Joint YA Launch! F.T. Lukens and Tucker Shaw",
        "date_time": "Starts on Tuesday, April 29 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of Right Beside You with author Tucker Shaw and the release of Love at Second Sight by F.T. Lukens. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/joint-ya-launch-ft-lukens-and-tucker-shaw-tickets-1249770339729?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "RESCHEDULED John Kenney w/ Nicole Graev Lipson: I See You've Called in Dead",
        "date_time": "Starts on Thursday, May 1 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of I See You've Called in Dead with author John Kenney, in conversation with Nicole Graev Lipson. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/rescheduled-john-kenney-w-nicole-graev-lipson-i-see-youve-called-in-dead-tickets-1273904114499?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "‘The Pillowpuffs’ Children’s Storytime with Julia S. Powell",
        "date_time": "Sunday, May 4 · 10 - 11am EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "Join artist and author Julia S. Powell for children’s storytime at Lovestruck Books! We’re excited to host a magical reading event for young readers and their families on Sunday, May 4th ! The event will feature The Pillowpuffs , a story reminding us to find the whimsy and beauty in the everyday. Throughout the book, her gorgeous landscapes mingle with whimsical creatures known as the Pillowpuffs. Bring your little ones, relax, and enjoy an engaging, soothing storytime that will remind children—and grown-ups—of the importance of slowing down and appreciating the world around us. They are also very silly. TICKETS Event entry is free with RSVP through Eventbrite. If you’d like to take home a signed copy of The Pillowpuffs , you can select the $30 ticket option at eventbrite checkout. EVENT DETAILS: 10:00 AM: Begin Gathering for the Reading – Settle in and get ready for storytime! 10:15 AM: Reading Begins – Enjoy the story with Julia. 10:30 AM: Q & A from the audience. Special sticker giveaway to our young readers. 10:45 AM: Signatures and Salutations – Meet the author and get your book signed! 11:00 AM: Event Wraps Up – Thanks for joining us! Feel free to explore more of the children’s section at Lovestruck. Tickets are limited, so grab yours soon! If the event reaches capacity, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person.",
        "event_link": "https://www.eventbrite.com/e/the-pillowpuffs-childrens-storytime-with-julia-s-powell-tickets-1317709467489?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Hobbies Parties",
            "#book",
            "#bookstore",
            "#bookclub",
            "#booksigning",
            "#bookwriting",
            "#author_event",
            "#book_discussion",
            "#author_talk",
            "#romantasy"
        ]
    },
    {
        "title": "Transnational Series: Haleh Liza Gafori",
        "date_time": "Starts on Tuesday, May 6 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "Join the Transnational Literature Series at Brookline Booksmith for an in-store event with translator Haleh Liza Gafori to discuss and celebrate the release of Water by Rumi. A follow-up to her ground-breaking translations of Rumi in Gold , poet and musician Haleh Liza Gafori translates a new selection of work by the great Persian mystic that will muster the soul and stir the spirit. Water expands on Gold , Haleh Liza Gafori's inspired and widely praised translation of the lyric poetry of the Persian mystic Rumi. As in Gold , Gafori renders with fluid grace and moving immediacy these indisputable masterworks of world literature, drawing on the deep well of Rumi’s work to bring out the worldly wit and wisdom that accompany his otherworldly summons. Behold the divine within and without, he tells us. Question the gnawing hunger for material possessions, fame, and fortune, and the fear of emptiness that drives it. Muster the soul, and experience a more compassionate and liberated state of mind. An eco-poet before his time, Rumi celebrates the immensity and wonder of the natural world while warning us of the havoc that greed and the pursuit of power wreak upon us and our world. His flights of dazzling imagery open up heart-stopping glimpses of the divine, challenging readers to wake from oblivion, and above all, to surrender to the transformative power of Love. Gafori is an acclaimed vocalist and musician as well as a gifted linguist and poet, and in her translations Rumi's poetry sings and beckons as nowhere else. Hers is the work, as the poet Marilyn Hacker has said, \"of someone who is at once an acute and enamored reader of the original Farsi text, a dedicated miner of context and backstory, and, best of all, a marvelous poet in English.” Rumi, Molana, Jalāl ad-Dīn Mohammad Balkhy (1207–1273), was born in or near the city of Balkh, in present-day Afghanistan. Widely considered the greatest poet of the Persian language, Rumi’s major works are the Masnavi , a six-volume collection of mystical teachings, and the Divan-e Shams-e Tabrizi , a collection of lyric poetry. He died and was buried in Konya, Turkey. Haleh Liza Gafori is an Iranian American translator, performance artist, poet, and musician born in New York City. Her work has been published by Harvard Review , The Brooklyn Rail , Columbia University Press, and others. A recipient of a MacDowell fellowship and an NYSCA grant, she presents the poetry of Rumi at universities and institutions, including Stanford University, Lincoln Center, and the Academy of American Poets. Her first collection of Rumi translations, Gold , is also published by NYRB Classics. The Transnational Literature Series at Brookline Booksmith The Transnational Series focuses on stories of migration, the intersection of politics and literature, and works in translation and is supported by the independent bookstore Brookline Booksmith. Subscribe to the Transnational Series newsletter for information on upcoming events, book recommendations, and more. What You Need to Know to Attend RSVP to let us know you're coming! RSVPs don't guarantee a seat, but you'll be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. Reserve a Book Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! Barring technical difficulty, this event will be livestreamed to our store YouTube channel. Event Accesibility This event will take place at street level. If possible, the event will be livestreamed to YouTube. ASL interpretation may be provided (based on the availability of interpreters) but must be requested at least 2 weeks in advance of the event. Seats are limited. Please email ticketing@brooklinebooksmith.com as soon as possible if you require ASL interpretation, guaranteed seating, or other accommodations . We will do our best to serve your needs! IMPORTANT NOTICE REGARDING COVID & IN-PERSON EVENTS: Please note that any Brookline Booksmith in-person event may be canceled by the bookstore, publisher, or author based on concerns about health and safety around the time of the event. Wherever possible, any in-person appearance canceled due to COVID will be moved to the Brookline Booksmith Zoom as a Webinar at the same date and time, and all tickets & registrations will be transferred to the online event. Book signing details may change. Refunds may be requested in the case of a virtual pivot or event cancelation.",
        "event_link": "https://www.eventbrite.com/e/transnational-series-haleh-liza-gafori-tickets-1281589200799?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#music",
            "#poetry",
            "#persian",
            "#author",
            "#bookstore",
            "#booksigning",
            "#translation",
            "#booklaunch",
            "#iranian",
            "#booktalk"
        ]
    },
    {
        "title": "B. Dylan Hollis at First Parish Church",
        "date_time": "Starts on Saturday, May 24 · 5pm EDT",
        "location": "The First Parish in Cambridge, Unitarian Universalist 1446 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "Harvard Book Store welcomes B. Dylan Hollis —social media personality and author of the global bestseller Baking Yesteryear —for a discussion of his new book Baking Across America: A Vintage Recipe Road Trip , a cross-country culinary journey with 100 uniquely American recipes. Following the presentation will be a book signing. Ticketing There are two ticket options for this event. 1. Book-Included Tickets : Includes admission for one and one hardcover copy of Baking Across America. 2. Admission-Only Tickets: Includes admission for one. Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event. About Baking Across America From the deserts of the Southwest to the shining Atlantic Coast, the USA is as sweet as it gets. In this tour de food, B. Dylan Hollis takes you on a delicious road trip to taste everything from the coffee-crazed creations of the Pacific Northwest to the larger-than-life sheet cakes of Texas. You’ll be hitting the pavement in vintage style as you journey with Dylan through the culture capitals of America to savor the very best bakes the nation has to offer. His retro recipes span the decades from the 1900s to the 2000s and feature famous (and forgotten) desserts from every state. With his signature wry humor, Dylan explores the US and uncovers the history of nostalgic local favorites, including Boston Cream Pie on the cobbled streets of Beantown, Beignets in the sultry heat of jazzy New Orleans, and Date Cream scooped up poolside in Palm Springs. Baking Across America is the highly anticipated successor to Baking Yesteryear and delivers 100 wild, wacky, and wonderful recipes from every star-spangled corner of the good ol’ US of A. Bio B. Dylan Hollis is a social media personality who has tasked himself with baking and tasting unusual recipes from by gone years. Born and raised on the island of Bermuda, he later attended college at the University of Wyoming to further a career as a jazz pianist and arranger. He stumbled into both baking and social media fame at once in 2020, when quarantine boredom led him to film an investigation of an old cookbook he had collected from an estate sale. Hundreds of recipes later, Dylan now entertains millions across Tik Tok, YouTube, and Instagram with his unique style and fast jokes. He is the author of the global bestseller Baking Yesteryear . Dylan lives in Laramie, Wyoming. Masking Policy Masks are encouraged but not required for this event.",
        "event_link": "https://www.eventbrite.com/e/b-dylan-hollis-at-first-parish-church-tickets-1289982144319?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Hobbies Seminars"
        ]
    },
    {
        "title": "Ron Chernow at First Parish Church",
        "date_time": "Starts on Monday, June 2 · 7pm EDT",
        "location": "First Parish Church 1446 Massachusetts Ave Cambridge, MA 02138 Show map",
        "about": "Harvard Book Store welcomes Ron Chernow ―prizewinning author of seven books, including the National Book Award winner The House of Morgan , the Pulitzer Prize winner Washington: A Life , and the George Washington Book Prize winner Alexander Hamilton ―for a discussion of his new biography Mark Twain. Ticketing There are two ticket options for this event. 1. Book-Included Ticket: Includes admission for one and one hardcover copy of Mark Twain , pre-signed by Ron Chernow. 2. Admission-Only Ticket: Includes admission for one. Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event. About Mark Twain Pulitzer Prize-winning biographer Ron Chernow illuminates the full, fascinating, and complex life of the writer long celebrated as the father of American literature, Mark Twain Before he was Mark Twain, he was Samuel Langhorne Clemens. Born in 1835, the man who would become America’s first, and most influential, literary celebrity spent his childhood dreaming of piloting steamboats on the Mississippi. But when the Civil War interrupted his career on the river, the young Twain went west to the Nevada Territory and accepted a job at a local newspaper, writing dispatches that attracted attention for their brashness and humor. It wasn’t long before the former steamboat pilot from Missouri was recognized across the country for his literary brilliance, writing under a pen name that he would immortalize. In this richly nuanced portrait of Mark Twain, acclaimed biographer Ron Chernow brings his considerable powers to bear on a man who shamelessly sought fame and fortune, and crafted his persona with meticulous care. After establishing himself as a journalist, satirist, and lecturer, he eventually settled in Hartford with his wife and three daughters, where he went on to write The Adventures of Tom Sawyer and Adventures of Huckleberry Finn . He threw himself into the hurly-burly of American culture, and emerged as the nation’s most notable political pundit. At the same time, his madcap business ventures eventually bankrupted him; to economize, Twain and his family spent nine eventful years in exile in Europe. He suffered the death of his wife and two daughters, and the last stage of his life was marked by heartache, political crusades, and eccentric behavior that sometimes obscured darker forces at play. Drawing on Twain’s bountiful archives, including thousands of letters and hundreds of unpublished manuscripts, Chernow masterfully captures the man whose career reflected the country’s westward expansion, industrialization, and foreign wars, and who was the most important white author of his generation to grapple so fully with the legacy of slavery. Today, more than one hundred years after his death, Twain’s writing continues to be read, debated, and quoted. In this brilliant work of scholarship, a moving tribute to the writer’s talent and humanity, Chernow reveals the magnificent and often maddening life of one of the most original characters in American history. Bio Ron Chernow is the prizewinning author of seven previous books and the recipient of the 2015 National Humanities Medal. His first book, The House of Morgan , won the National Book Award, Washington: A Life won the Pulitzer Prize for Biography, and Alexander Hamilton —the inspiration for the Broadway musical—won the George Washington Book Prize. He has twice been a finalist for the National Book Critics Circle Award and is one of only three living biographers to have won the Gold Medal for Biography of the American Academy of Arts and Letters. A past president of PEN America, Chernow has been the recipient of nine honorary doctorates. Masking Policy Masks are encouraged but not required for this event.",
        "event_link": "https://www.eventbrite.com/e/ron-chernow-at-first-parish-church-tickets-1258436701049?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Hobbies Seminars"
        ]
    },
    {
        "title": "Dave Eggers Book Signing at Harvard Book Store",
        "date_time": "Starts on Tuesday, May 6 · 4pm EDT",
        "location": "Harvard Book Store 1256 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "Harvard Book Store welcomes Dave Eggers —award-winning author of The Every and the illustrator behind the beloved picture book Her Right Foot —for a signing of the paperback release of his Newbery Medal winner The Eyes and the Impossible , an endearing and beautifully illustrated story of a dog who unwittingly becomes a hero to a park full of animals. The signing will take place beginning at 4:00pm on Tuesday, May 6. People who have registered should arrive between 3:45pm, when doors to the signing line open, and 4:45pm to ensure their spot in line. Please note, this is a book signing only, not a presentation. Please read the following ticket and signing guidelines below. Tickets and Book Pickup Tickets are required to join the signing line. Each ticket admin one (1) person and includes one (1) paperback copy of The Eyes and the Impossible . Children under the age of 16 do not need a ticket so long as they are accompanied by an adult who has purchased a ticket. Tickets are non-refundable and non-returnable. Additional copies of The Eyes and the Impossible will be available for purchase at the bookstore, along with copies of Dave's previous titles. Books included with ticket purchase can be picked up at check-in, but not before. If you purchase a ticket and can no longer make the event you will have 30 days after the event to pick up your book from the store. Please note, while we will do our best to have signed copies, we cannot guarantee signed copies will be available to ticket holders who do not attend the signing. Timeline The signing will begin at 4:00pm on Tuesday, May 6, 2025. Doors will open to the signing line at 3:45pm. Harvard Book Store event staff will instruct attendees where to line up. Please do not arrive before 3:45pm. Ticket holders will receive their books at check-in. The signing will end around 5:30pm or later depending on the number of tickets sold. Folks who have registered should arrive between 3:45pm, when doors to the signing line open, and 4:45pm to ensure their spot in line. Ticket holders should expect that there will be some wait-time to get their books personalized. Ticket holders should expect that they may have to wait in line outside the bookstore as we can only allow a certain capacity of people into the store at once. Signing Line Guidelines This signing is specifically for the paperback release of The Eyes and the Impossible . Dave Eggers will personalize copies of The Eyes and the Impossible (first names only for inscriptions) as well as his previous titles. Photos are allowed. Ticket holders should bring their own phones or cameras if they would like a photo. Videos recordings of any kind are prohibited. About The Eyes and the Impossible Johannes, a free dog, lives in an urban park by the sea. His job is to be the Eyes—to see everything that happens within the park and report back to the park’s elders, three ancient Bison. His friends—a seagull, a raccoon, a squirrel, and a pelican—work with him as the Assistant Eyes, observing the humans and other animals who share the park and making sure the Equilibrium is in balance. But changes are afoot. More humans, including Trouble Travelers, arrive in the park. A new building, containing mysterious and hypnotic rectangles, goes up. And then there are the goats—an actual boatload of goats—who appear, along with a shocking revelation that changes Johannes’s view of the world. A story about friendship, beauty, liberation, and running very, very fast, The Eyes and the Impossible will make readers of all ages see the world around them in a wholly new way. Masking Policy Masks are encouraged but not required for this event.",
        "event_link": "https://www.eventbrite.com/e/dave-eggers-book-signing-at-harvard-book-store-tickets-1321669893229?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Appearances",
            "Cambridge Hobbies Appearances"
        ]
    },
    {
        "title": "SOLD OUT!V.E. Schwab with Jodi Picoult: Bury Our Bones in the Midnight Soil",
        "date_time": "Starts on Friday, June 20 · 7pm EDT",
        "location": "All Saints Parish 1773 Beacon Street Brookline, MA 02445 Show map",
        "about": "This event is now sold out. There will not be a waiting list. Live and in person with Brookline Booksmith, at All Saints Parish! Celebrate the release of Bury Our Bones in the Midnight Soil with author V.E. Schwab, in conversation with Jodi Picoult. Register for the event! This event is ticketed. Tickets include a general admission seat at the event AND a signed copy of Bury Our Bones in the Midnight Soil . Ticketholders will receive email updates with important details about the program, including safety requirements, cancellations, and book signing updates. Get your copy! This event will NOT include a live book signing at the end of the talk. All books will be presigned and embossed with a custom seal. Can't make it to the event? We can ship you a signed copy of the book! Pick \"Bury Our Bones (priority mail)\" for this option. Book orders are processed for pickup or shipping after ticket sales have closed.",
        "event_link": "https://www.eventbrite.com/e/sold-outve-schwab-with-jodi-picoult-bury-our-bones-in-the-midnight-soil-tickets-1107542341959?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#literature",
            "#author",
            "#fantasy",
            "#fiction",
            "#bookstore",
            "#booklaunch",
            "#novel",
            "#booktalk",
            "#sff",
            "#authorevent"
        ]
    },
    {
        "title": "Tell me How You Really Feel Release Party",
        "date_time": "Tuesday, May 6 · 7 - 9pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "Celebrate the second romance novel release from Betty Cayouette, Tell Me How You Really Feel . In conversation with Boston lifestyle and literary content creator Elie Delaney , Cayouette will explore the workplace romance between sex and relationships podcasters Maeve and Finn. Hear more about the personal and societal challenges, such as the gender pay gap, and sweetness sprinkled throughout the plot. Your ticket purchase includes a signed copy of the book to take home and enjoy! EVENT DETAILS 6:30 PM: Doors Open – Get settled in and ready for the discussion! 7:00 PM: Discussion Begins – Betty and Elie will dive into the Tell Me How You Really Feel 7:45 PM: Q&A Session – Your chance to ask the author anything! 8:00 PM: Signatures, Snapping Pics, and Slices – Meet Betty, get your book signed, snap a photo, and  grab a slice of custom cake! 9:00 PM: Event Wraps Up – Thanks for joining us! Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person.",
        "event_link": "https://www.eventbrite.com/e/tell-me-how-you-really-feel-release-party-tickets-1301038303589?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Hobbies Parties",
            "#book",
            "#bookstore",
            "#bookclub",
            "#booksigning",
            "#bookwriting",
            "#author_event",
            "#book_discussion",
            "#author_talk",
            "#romantasy"
        ]
    },
    {
        "title": "Kevin Wilson with Joanna Rakoff: Run for the Hills",
        "date_time": "Starts on Friday, May 30 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of Run for the Hills with author Kevin Wilson, in conversation with Joanna Rakoff. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed.",
        "event_link": "https://www.eventbrite.com/e/kevin-wilson-with-joanna-rakoff-run-for-the-hills-tickets-1270796058219?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "The Love Haters Release Celebration with Katherine Center",
        "date_time": "Saturday, June 7 · 6 - 8pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "Join us on Saturday, June 7 to celebrate the release of The Love Haters , the newest laugh-out-loud, all-the-feels rom-com by New York Times bestselling author Katherine Center . Katherine will treat us to a live reading, sharing some of the most humorous and touching scenes from The Love Haters , with the potential to make you laugh, tear up, and everything in between. Afterward, you’ll have the chance to meet Katherine during the book signing . Throughout the night, sip on custom cocktail inspired by the book, adding a special touch to the conversation. It’s a thin line between love and love-hating, and we’re ready to celebrate it all at this release party! TICKETS Your $38 ticket purchase includes a copy of The Love Haters , ensuring you're ready for the release celebration. EVENT DETAILS 5:15 PM: Doors Open – Get settled in and ready for the discussion! 6:00 PM: Reading Begins – A first glimpse at the novel told by Katherine herself. 6:45 PM: Q&A Session – Your chance to ask any burning questions! 7:00 PM: Signatures and Snapping Pics – Meet Katherine, get your book signed, snap a photo, and mingle over cocktails to close out the night. 8:00 PM: Event Wraps Up – Thanks for joining us! Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person.",
        "event_link": "https://www.eventbrite.com/e/the-love-haters-release-celebration-with-katherine-center-tickets-1254860695119?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Hobbies Seminars",
            "#event",
            "#writing",
            "#author",
            "#launch_party",
            "#author_talk",
            "#romance_books",
            "#romantic_comedy"
        ]
    },
    {
        "title": "Dungeons & Flagons  - 5E One Shot - APRIL",
        "date_time": "Sunday, April 27 · 12:30 - 6pm EDT",
        "location": "Widowmaker Taproom and Kitchen 190 North Beacon Street Boston, MA 02135 Show map",
        "about": "Where: Widowmaker Brewery & Kitchen - Brighton (190 N Beacon St, Brighton, MA 02135) When: Sunday, April 27th 12:30pm - 6:00pm Come, sit and roll some dice, enjoying some amazing beers and good company while playing the popular table top game, Dungeons & Dragons. Game Masters will take players through 3 -4 hour game in the comfort of Widowmaker Brewing's brewery & kitchen. Both Veteran and Novice players are welcome to join the adventure. A Night of Masks & Monsters Adventuring is hard but it can come with many rewards. After a successful quest, you're given the honor of visiting the luxurious city of Ibrido, all expenses paid, and an invitation to the party of a lifetime. The masquerade of the Marquis di Maschera. But not all the glitters is gold as a murdered creature two days prior alludes to something sinister beneath that a night of fanciful food and lavish costumes cannot hide. As dusk descends how will you survive, A Night of Masks and Monsters! *Refund available up until 48 hours prior to event, eventbrite service fee will be deducted. Beer not included.",
        "event_link": "https://www.eventbrite.com/e/dungeons-flagons-5e-one-shot-april-tickets-1297069984239?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Hobbies Parties",
            "#brewery",
            "#dnd",
            "#dnd5e",
            "#notch",
            "#dnd_group",
            "#dnd_beers",
            "#dnd_event",
            "#notchbrewery"
        ]
    },
    {
        "title": "What If It's You? Launch at Lovestruck with Jilly Gagnon",
        "date_time": "Tuesday, May 13 · 7 - 9pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "Join us for an exclusive evening celebrating the launch of Jilly Gagnon's new novel, What If It's You? This intriguing romance explores the concept of alternate realities and the paths not taken. Jilly will be in conversation with fellow author Kayla Olson, known for her cozy rom-com The Lodge . Learn more about the author and have your books signed! TICKET OPTIONS: $46 – Includes one copy each of both Jilly Gagnon's What If It's You? AND Kayla Olson's The Lodge . $28 – Includes one copy of Jilly Gagnon's What If It's You? .​ $10- Entry to the event (no book)​ EVENT DETAILS: 6:30 PM: Doors Open – Get settled in and ready for the discussion! 7:00 PM: Discussion Begins – Jilly and Kayla will dive into What If It’s You? 7:45 PM: Q&A Session – Your chance to ask the author anything! 8:00 PM: Signatures, Snapping Pics, and Salutations – Meet Jilly, get your book signed, and snap a photo! 9:00 PM: Event Wraps Up – Thanks for joining us! Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person.",
        "event_link": "https://www.eventbrite.com/e/what-if-its-you-launch-at-lovestruck-with-jilly-gagnon-tickets-1303374140139?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Hobbies Parties",
            "#book",
            "#bookstore",
            "#bookclub",
            "#booksigning",
            "#bookwriting",
            "#author_event",
            "#book_discussion",
            "#author_talk",
            "#romantasy"
        ]
    },
    {
        "title": "Canasta and Mahjong Social Play",
        "date_time": "Monday, May 12 · 7 - 9pm EDT",
        "location": "Donut Villa 319 Broadway Arlington, MA 02474 Show map",
        "about": "Do you play American Mahjong or Canasta? Join Bev and Emily, canasta and mahjong instructors of The Canasta Connection, for an evening of social play. We'll be in the back room at Donut Villa in the Arlington location. All levels welcome, as long as you know the basic rules! Choose to play canasta or mahjong and we'll match you based on level and be available for supervised play. Formal play begins at 7pm, but arrive between 6-7pm to mingle and eat beforehand. You can also grab food and drinks during play. We'll provide all supplies for canasta and mahjong. Bring your mahjong card if that is your game of choice. If you have received your 2025 card around this date, bring that too-we can have different tables by card year. Sign up on your own, with a friend, or your whole group! This is intended to be a great opportunity to play in a fun and inclusive, low-stakes environment. Tables will be designated by level, but specific seats will not be pre-assigned. Emily and Bev are a mother-daughter duo and mahjong and canasta teachers in the Greater Boston area and on Cape Cod. Win mahjong and canasta themed prizes! Registration Required to save a seat. Tickets are $18 per person + Please purchase food/drink at Donut Villa (not included in ticketing price). Visit www.canastaconnection.com to learn more about our events and classes. Follow Us on IG: @canastaconnection Subscribe to Our Mailing List: Find out about upcoming lessons and events ---- Refunds available until 4 days before the event. Refunds will not include eventbrite ticketing fee. If you are unable to attend but you have a friend who would like to attend in your place, they must be able to play at the same ticket level and you must send us a message with their contact info.",
        "event_link": "https://www.eventbrite.com/e/canasta-and-mahjong-social-play-tickets-1313202888189?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Arlington, MA",
            "Arlington Parties",
            "Arlington Hobbies Parties",
            "#fun",
            "#games",
            "#mahjong",
            "#canasta",
            "#social_play"
        ]
    },
    {
        "title": "Ocean Vuong at First Parish Church",
        "date_time": "Starts on Friday, May 16 · 7pm EDT",
        "location": "First Parish Church 1446 Massachusetts Ave Cambridge, MA 02138 Show map",
        "about": "Harvard Book Store welcomes Ocean Vuong —author of the critically acclaimed poetry collections Night Sky with Exit Wounds and Time Is a Mother , as well as the New York Times bestselling novel On Earth We’re Briefly Gorgeous —for a discussion of his new novel The Emperor of Gladness . He will be joined in conversation by Emiko Tamagawa —senior producer for Here & Now for their arts and culture segments. Ticketing Tickets include admission for one and one hardcover copy of The Emperor of Gladness pre-signed by the author. Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event. About The Emperor of Gladness Ocean Vuong returns with a bighearted novel about chosen family, unexpected friendship, and the stories we tell ourselves in order to survive. One late summer evening in the post-industrial town of East Gladness, Connecticut, nineteen-year-old Hai stands on the edge of a bridge in pelting rain, ready to jump, when he hears someone shout across the river. The voice belongs to Grazina, an elderly widow succumbing to dementia, who convinces him to take another path. Bereft and out of options, he quickly becomes her caretaker. Over the course of the year, the unlikely pair develops a life-altering bond, one built on empathy, spiritual reckoning, and heartbreak, with the power to transform Hai’s relationship to himself, his family, and a community on the brink. Following the cycles of history, memory, and time, The Emperor of Gladness shows the profound ways in which love, labor, and loneliness form the bedrock of American life. At its heart is a brave epic about what it means to exist on the fringes of society and to reckon with the wounds that haunt our collective soul. Hallmarks of Ocean Vuong’s writing—formal innovation, syntactic dexterity, and the ability to twin grit with grace through tenderness—are on full display in this story of loss, hope, and how far we would go to possess one of life’s most fleeting mercies: a second chance. Bios Ocean Vuong is the author of the critically acclaimed poetry collections Night Sky with Exit Wounds and Time Is a Mother , as well as the New York Times bestselling novel On Earth We’re Briefly Gorgeous . A recipient of the MacArthur “Genius Grant\" and the American Book Award, he used to work as a fast-food server, which inspired The Emperor of Gladness . Born in Saigon, Vietnam, he currently splits his time between Northampton, Massachusetts, and New York City. Emiko Tamagawa is a senior producer for Here & Now . Tamagawa produces arts and culture segments for Here & Now. She studied psychology and drama at Yale and Brandeis, and toured colleges and high schools with her one-woman show about the Japanese-American internment before turning to radio. Masking Policy Masks are encouraged but not required for this event.",
        "event_link": "https://www.eventbrite.com/e/ocean-vuong-at-first-parish-church-tickets-1291383235019",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Hobbies Seminars"
        ]
    },
    {
        "title": "Hotter in The Hamptons Book Launch & Author Photo Op",
        "date_time": "Wednesday, May 7 · 6 - 10pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "Get ready for a sizzling celebration with Tinx! Celebrate the author’s fiction debut, Hotter in The Hamptons on Wednesday, May 7th and bring home a signed copy! Tinx's latest novel follows NYC it-girl Lola King as she escapes to the Hamptons to lay low after a scandal—only to find herself living next door to her rival, Aly Ray Carter, the culture critic who tore her down in a brutal exposé. As the summer blazes on, Lola is drawn to the woman who ruined her life, realizing that some chaos can’t be outrun. Hotter in The Hamptons is everything you love about Tinx—bold, unapologetic, and filled with complex, real women. This novel is spicy, raunchy, and absolutely captivating. EVENT DETAILS Your ticket will include a pre-signed copy of Tinx’s latest novel, Hotter in The Hamptons ! You’ll also get a chance to snap a photo with the author. You’ll receive a QR code to easily download your picture after the event. Tickets are assigned to specific time slots. To help minimize wait times for everyone, please arrive at your designated time. Late arrivals will be directed to the end of the line to ensure fairness to those who arrived on time. Please be respectful of others waiting and help keep the line moving when it’s your turn to meet Tinx and pick up your book. During your time slot, ex: 6PM - 6:30 PM, you will get in line to meet Tinx and get your photo taken. Then you will move on to picking up your book. During your 30 minute time slot, you will have roughly 30 minutes to shop the store. Once your time slot is over, we will make an annoucement on the PA asking that time slot to exit the store, so the next time slot can enter. Please be respectful and honor your time slot. The bar will be open- first come, first serve. Please note that there won’t be any personalizations at this event. Tinx will only be pre-signing Hotter in The Hamptons , so we kindly ask that you don’t bring any other books from home. Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person. PARKING AND TRANSPORTATION There is metered street parking. You can also park at The Charles Hotel, or take the Red Line to Harvard Sq.",
        "event_link": "https://www.eventbrite.com/e/hotter-in-the-hamptons-book-launch-author-photo-op-tickets-1296098999999",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Appearances",
            "Cambridge Hobbies Appearances",
            "#meetandgreet",
            "#booklaunch",
            "#author_event",
            "#book_launch",
            "#summer_event",
            "#book_release",
            "#fiction_books",
            "#author_meetup",
            "#tinx",
            "#hotter_in_the_hamptons"
        ]
    },
    {
        "title": "Alison Bechdel at The Brattle Theatre",
        "date_time": "Starts on Thursday, May 22 · 6pm EDT",
        "location": "The Brattle Theatre 40 Brattle St. Cambridge, MA 02138 Show map",
        "about": "Harvard Book Store welcomes beloved New York Times bestselling author Alison Bechdel —author of Fun Home , which was a Time magazine #1 Book of the Year graphic memoir and was adapted into a Tony Award–winning musical—to celebrate the release of her new comic novel Spent , a laugh-out-loud, brilliant, and passionately political work of autofiction. Ticketing Tickets include admission for one and one hardcover copy of Spent pre-signed by the author. Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event. About Spent In Alison Bechdel’s hilariously skewering and gloriously cast new comic novel confection, a cartoonist named Alison Bechdel, running a pygmy goat sanctuary in Vermont, is existentially irked by a climate-challenged world and a citizenry on the brink of civil war. She wonders: Can she pull humanity out of its death spiral by writing a scathingly self-critical memoir about her own greed and privilege? Meanwhile, Alison’s first graphic memoir about growing up with her father, a taxidermist who specialized in replicas of Victorian animal displays, has been adapted into a highly successful TV series. It’s a phenomenon that makes Alison, formerly on the cultural margins, the envy of her friend group (recognizable as characters, now middle-aged and living communally in Vermont, from Bechdel’s beloved comic strip Dykes to Watch Out For ). As the TV show Death and Taxidermy racks up Emmy after Emmy—and when Alison’s Pauline Bunyanesque partner Holly posts an instructional wood-chopping video that goes viral—Alison’s own envy spirals. Why couldn’t she be the writer for a critically lauded and wildly popular reality TV show…like Queer Eye ...showing people how to free themselves from consumer capitalism and live a more ethical life?!! Spent ’s rollicking and masterful denouement—making the case for seizing what’s true about life in the world at this moment, before it’s too late—once again proves that “nobody does it better” ( New York Times Book Review ) than the real Alison Bechdel. Bio Alison Bechdel’s cult following for her early comic strip Dykes to Watch Out For expanded wildly for her family memoirs, the New York Times bestselling and Time magazine #1 Book of the Year graphic memoir Fun Home , adapted into a Tony Award–winning musical, and Are You My Mother? Most recently, The Secret to Superman Strength was named a New York Times Best Graphic Novel of 2021. Bechdel has been named a MacArthur Fellow, among many other honors. Masking Policy Masks are encouraged but not required for this event.",
        "event_link": "https://www.eventbrite.com/e/alison-bechdel-at-the-brattle-theatre-tickets-1295783817279",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Hobbies Seminars"
        ]
    },
    {
        "title": "SOLD OUT!John B. King, Jr. with Jennifer De Leon: Teacher by Teacher",
        "date_time": "Starts on Thursday, May 8 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "We have reached capacity  and RSVPs are now closed. There will not be a waitlist. Signed books are still available to purchase, to be shipped or picked up after the event. In person at Brookline Booksmith! Celebrate the release of Teacher By Teacher with author John B. King, Jr., in conversation with Jennifer De Leon. This event is cosponsored by the Puerto Rican Festival of Massachusetts (PRFMA). Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/sold-outjohn-b-king-jr-with-jennifer-de-leon-teacher-by-teacher-tickets-1294956332249",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Dungeons & Flagons  - 5E One Shot - APRIL",
        "date_time": "Sunday, April 27 · 12:30 - 6pm EDT",
        "location": "Widowmaker Taproom and Kitchen 190 North Beacon Street Boston, MA 02135 Show map",
        "about": "Where: Widowmaker Brewery & Kitchen - Brighton (190 N Beacon St, Brighton, MA 02135) When: Sunday, April 27th 12:30pm - 6:00pm Come, sit and roll some dice, enjoying some amazing beers and good company while playing the popular table top game, Dungeons & Dragons. Game Masters will take players through 3 -4 hour game in the comfort of Widowmaker Brewing's brewery & kitchen. Both Veteran and Novice players are welcome to join the adventure. A Night of Masks & Monsters Adventuring is hard but it can come with many rewards. After a successful quest, you're given the honor of visiting the luxurious city of Ibrido, all expenses paid, and an invitation to the party of a lifetime. The masquerade of the Marquis di Maschera. But not all the glitters is gold as a murdered creature two days prior alludes to something sinister beneath that a night of fanciful food and lavish costumes cannot hide. As dusk descends how will you survive, A Night of Masks and Monsters! *Refund available up until 48 hours prior to event, eventbrite service fee will be deducted. Beer not included.",
        "event_link": "https://www.eventbrite.com/e/dungeons-flagons-5e-one-shot-april-tickets-1297069984239",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Hobbies Parties",
            "#brewery",
            "#dnd",
            "#dnd5e",
            "#notch",
            "#dnd_group",
            "#dnd_beers",
            "#dnd_event",
            "#notchbrewery"
        ]
    },
    {
        "title": "Joint YA Launch! F.T. Lukens and Tucker Shaw",
        "date_time": "Starts on Tuesday, April 29 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of Right Beside You with author Tucker Shaw and the release of Love at Second Sight by F.T. Lukens. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/joint-ya-launch-ft-lukens-and-tucker-shaw-tickets-1249770339729",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Shelby Van Pelt with Emily Habeck: Remarkably Bright Creatures",
        "date_time": "Starts on Wednesday, April 30 · 6pm EDT",
        "location": "Coolidge Corner Theatre 290 Harvard St Brookline, MA 02446 Show map",
        "about": "Live and in person at the Coolidge Corner Theatre with Brookline Booksmith, celebrate the paperback release of Remarkably Bright Creatures with author Shelby Van Pelt, in conversation with Emily Habeck. Register for the event! This event is ticketed. Tickets include a general admission seat at the event and a copy of Remarkably Bright Creatures. Ticketholders will receive email updates with important details about the program, including safety requirements, cancellations, and book signing updates. Signed books! This event will include a live signing at the end of the talk, taking place across the street from the theater at Brookline Booksmith. Can't make it to the event? We can ship you a signed copy of the book! Pick \"Remarkably Bright Creatures(priority mail)\" for this option. Book orders are processed for pickup or shipping after ticket sales have closed.",
        "event_link": "https://www.eventbrite.com/e/shelby-van-pelt-with-emily-habeck-remarkably-bright-creatures-tickets-1224178543979",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#literature",
            "#author",
            "#fiction",
            "#bookstore",
            "#booklaunch",
            "#novel",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "RESCHEDULED John Kenney w/ Nicole Graev Lipson: I See You've Called in Dead",
        "date_time": "Starts on Thursday, May 1 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of I See You've Called in Dead with author John Kenney, in conversation with Nicole Graev Lipson. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/rescheduled-john-kenney-w-nicole-graev-lipson-i-see-youve-called-in-dead-tickets-1273904114499",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Transnational Series: Daniel Tam-Claiborne with Aube Rey Lescure",
        "date_time": "Starts on Tuesday, May 20 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "Join the Transnational Literature Series at Brookline Booksmith for an in-store event with Daniel Tam-Claiborne to discuss and celebrate the release of Transplants . He will be in conversation with writer Aube Rey Lescure. A harrowing and poignant novel following two young women in pursuit of kinship and self-discovery who yearn to survive in a world that doesn’t know where either of them belong. On a university campus in rural Qixian, Lin and Liz make an improbable pair: Lin, a Chinese student closer to her menagerie of pets than to her peers, and Liz, a Chinese American teacher grieving her mother’s sudden death. They’re each met with hostility—Lin by her classmates, who mock her for dating a white foreigner; Liz by her fellow English teachers, who exploit their privilege—and forge an unlikely friendship. After a startling betrayal that results in Lin’s expulsion, they swap places. Lin becomes convinced to pursue her degree at a community college near Liz’s Ohio hometown, while Liz searches for answers as to what drove her parents to leave China before she was born. But when a global catastrophe deepens the fissures between modern-day China and an increasingly fractured United States, Lin and Liz—far from home and estranged from themselves—are forced to confront both the familiar and the strange in each other. Unspooling over the course of a single extraordinary year in our not-yet-distant past and in small towns from Dandong to Deadwood, Transplants is a piercing story of migration, belonging, and the parts of ourselves that get lost in translation. Alternating between Liz and Lin’s perspectives, it is a lyrical and moving exploration of race, love, power, and freedom that illuminates the limits and possibilities of what can happen when we open ourselves to the unknown and reveals how even our fiercest differences may bring us closer than we might ever imagine. Daniel Tam-Claiborne is a multiracial writer, multimedia producer, and nonprofit director. He is the author of the short story collection What Never Leaves , and his writing has appeared in Catapult , Literary Hub , Off Assignment , The Rumpus , HuffPost , and elsewhere. A 2022 National Endowment for the Arts Literature Fellow, he has also received support from the U.S. Fulbright Program, Kundiman, Sewanee Writers’ Conference, the New York State Summer Writers Institute, and others. Daniel holds degrees from Oberlin College, Yale University, and the MFA Program for Writers at Warren Wilson College. Born and raised in Brooklyn, he lives with his wife and daughter in Seattle. Moderator Aube Rey Lescure is a French-Chinese-American writer. She grew up between Provence, northern China, and Shanghai, and graduated from Yale University in 2015. She is the co-author and translator of two books on Chinese politics and economics. Aube’s debut novel, River East, River West , was published in 2024. It has been shortlisted for the Women's Prize for Fiction, the Maya Angelou Book Award, and the Stanfords' Fiction with a Sense of Place Award. Her writing has appeared or is forthcoming in Granta , Guernica , LitHub , Electric Literature , The Millions , Litro , and more. Her essay “At the Bend of the Road” was selected for Best American Essays 2022 . The Transnational Literature Series at Brookline Booksmith The Transnational Series focuses on stories of migration, the intersection of politics and literature, and works in translation and is supported by the independent bookstore Brookline Booksmith. Subscribe to the Transnational Series newsletter for information on upcoming events, book recommendations, and more. What You Need to Know to Attend RSVP to let us know you're coming! RSVPs don't guarantee a seat, but you'll be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. Reserve a Book Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! Barring technical difficulty, this event will be livestreamed to our store YouTube channel. Event Accesibility This event will take place at street level. If possible, the event will be livestreamed to YouTube. ASL interpretation may be provided (based on the availability of interpreters) but must be requested at least 2 weeks in advance of the event. Seats are limited. Please email ticketing@brooklinebooksmith.com as soon as possible if you require ASL interpretation, guaranteed seating, or other accommodations . We will do our best to serve your needs! IMPORTANT NOTICE REGARDING COVID & IN-PERSON EVENTS: Please note that any Brookline Booksmith in-person event may be canceled by the bookstore, publisher, or author based on concerns about health and safety around the time of the event. Wherever possible, any in-person appearance canceled due to COVID will be moved to the Brookline Booksmith Zoom as a Webinar at the same date and time, and all tickets & registrations will be transferred to the online event. Book signing details may change. Refunds may be requested in the case of a virtual pivot or event cancelation.",
        "event_link": "https://www.eventbrite.com/e/transnational-series-daniel-tam-claiborne-with-aube-rey-lescure-tickets-1281663302439?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#china",
            "#literature",
            "#chinese",
            "#author",
            "#bookstore",
            "#transplants",
            "#booksigning",
            "#booklaunch",
            "#novel",
            "#booktalk"
        ]
    },
    {
        "title": "First Flight, Final Fall Release Party with C.W. Farnsworth",
        "date_time": "Tuesday, April 29 · 7 - 9pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "Join us at Lovestruck Books on Tuesday, April 29 to celebrate the arrival of First Flight, Final Fall with a special release party! The perfect blend of sports, romance, and sizzling chemistry, this limited first print run cover is a must-have— with stunning sprayed edges and an exclusive bonus epilogue just for YOU. C.W. Farnsworth will be in conversation with the amazing Monica Murphy, diving into the searing romance, the strong characters, and the high-stakes world of sports. If you love a strong female lead who’s a top US college player dedicated to her sport, a celebrity romance with a world-famous soccer star, and a hero who falls first and hard, this is the event for you. Add in a sports romance where both characters are athletes, and a summer fling that turns into first love, and Saylor and Beck is everything you’ve been waiting for. EVENT DETAILS: 6:30 PM: Doors Open – Get settled in and ready for the discussion! 7:00 PM: Discussion Begins – C.W. and Monica will dive into First Flight, Final Fall. 7:45 PM: Q&A Session – Your chance to ask the author anything! 8:00 PM: Signatures, Snapping Pics, and Salutations – Meet C.W., get your book signed, and snap a photo! 9:00 PM: Event Wraps Up – Thanks for joining us! Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person.",
        "event_link": "https://www.eventbrite.com/e/first-flight-final-fall-release-party-with-cw-farnsworth-tickets-1292921776839?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Hobbies Parties",
            "#book",
            "#bookstore",
            "#bookclub",
            "#booksigning",
            "#bookwriting",
            "#author_event",
            "#book_discussion",
            "#author_talk"
        ]
    },
    {
        "title": "Story Hour! Christopher Willard: Feelings Are Like Farts",
        "date_time": "Starts on Sunday, April 27 · 10:30am EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Join us for an all-ages storytime to celebrate Feelings Are Like Farts with author Christopher Willard. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. Reserve a book! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 10AM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed.",
        "event_link": "https://www.eventbrite.com/e/story-hour-christopher-willard-feelings-are-like-farts-tickets-1297285498849?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Tiling",
        "date_time": "Saturday, May 3 · 10am - 2pm EDT",
        "location": "100 Terrace St 100 Terrace Street Boston, MA 02120 Show map",
        "about": "In one of our most popular workshops, you can learn all aspects of tiling, from subfloor to grout. Learn about ceramic and stone tiling, including materials, layout, cutting, and installation. Applications in bathrooms and kitchens will be addressed, and hands-on training will help participants learn tile-setting techniques. Whether you have a tiling project in mind or just want to better understand how tiles stay up on the walls, this class will stick with you! Instructor Theo Graham has worked throughout Massachusetts and New Hampshire as a skilled tile installer, working on kitchens, baths, and floors in a large number of both residential and commercial spaces. ***** If you are a BBR Co-op Member, use the promotion code COOPMEMBER to receive a discount. (Not a member? Consider joining the Co-op!) If you are a BBR Plus Member (income-qualified), use the promotion code PLUSMEMBER to receive a discount. Learn more about Plus membership. If the discounted price presents a financial hardship, please email workshops@bostonbuildingresources.com. Limited scholarship funds are available for further discounts for Plus members.",
        "event_link": "https://www.eventbrite.com/e/tiling-registration-1304082348409?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Hobbies Classes",
            "#workshop",
            "#diy",
            "#remodeling",
            "#handson",
            "#homeimprovement",
            "#tiling",
            "#workshop_course_events",
            "#building_and_construction",
            "#homeimprovement_class",
            "#tile_install"
        ]
    },
    {
        "title": "Sarah Maria Griffin with Paul Tremblay: Eat the Ones You Love",
        "date_time": "Starts on Tuesday, May 13 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of Eat the Ones You Love with author Sarah Maria Griffin, in conversation with Paul Tremblay. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/sarah-maria-griffin-with-paul-tremblay-eat-the-ones-you-love-tickets-1295054174899?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "The Love Haters Meet & Greet with Katherine Center",
        "date_time": "Sunday, June 8 · 10am - 12pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "After quickly selling out of tickets for The Love Haters Release Celebration with Katherine Center we’ve decided to add a more casual meet and greet for folks who’d still love the opportunity to meet Katherine. Join us on Sunday morning, June 8 for a meet, greet and signing of The Love Haters , with Katherine Center. This is the newest laugh-out-loud, all-the-feels rom-com by New York Times bestselling author. It’s a thin line between love and love-hating, and we’re ready to celebrate it all at this book signing! TICKETS Your $29 ticket purchase includes a copy of The Love Haters . Tickets are assigned to specific time slots. To help minimize wait times for everyone, please arrive at your designated time. Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person.",
        "event_link": "https://www.eventbrite.com/e/the-love-haters-meet-greet-with-katherine-center-tickets-1317602276879?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Hobbies Seminars",
            "#event",
            "#writing",
            "#author",
            "#launch_party",
            "#author_talk",
            "#romance_books",
            "#romantasy"
        ]
    },
    {
        "title": "Ibram X. Kendi with Imari K. Paris Jeffries: Malcolm Lives!",
        "date_time": "Starts on Wednesday, May 21 · 6:30pm EDT",
        "location": "Union Church 485 Columbus Avenue Boston, MA 02118 Show map",
        "about": "In-person event at Union Church with Brookline Booksmith! Celebrate the release of Malcolm Lives! with author Ibram X. Kendi, in conversation with Imari K. Paris Jeffries. Register for the event! T his event is ticketed. Tickets include a general admission seat AND a signed copy of Malcolm Lives! Signed books! Can't make it to the event? We can ship you a signed copy of the book! Pick \"Malcolm Lives! (book only, priority mail)\" for this option. We can also hold a signed copy for pickup at Brookline Booksmith. Pick \"Malcolm Lives! (book only, store pickup)\" for this option. Book orders are processed for pickup or shipping after ticket sales have closed.",
        "event_link": "https://www.eventbrite.com/e/ibram-x-kendi-with-imari-k-paris-jeffries-malcolm-lives-tickets-1312139497559?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "An Evening of Poetry: Martín Espada with Luke Salisbury",
        "date_time": "Starts on Wednesday, May 7 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Join us for an evening of poetry as Martín Espada reads from his latest collection of poetry, followed by a conversation with Luke Salisbury. This event is a collaboration with the Puerto Rican Festival of Massachusetts. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. Livestream! Barring technical difficulty, this event will be livestreamed on our store YouTube channel .",
        "event_link": "https://www.eventbrite.com/e/an-evening-of-poetry-martin-espada-with-luke-salisbury-tickets-1330133508129?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#poetry",
            "#literature",
            "#author",
            "#bookstore",
            "#booktalk",
            "#poetryreading",
            "#authorevent",
            "#poetryevent",
            "#poetry_reading",
            "#poetry_event"
        ]
    },
    {
        "title": "Transnational Series: Iman Mersal",
        "date_time": "Starts on Friday, May 16 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "Join the Transnational Literature Series at Brookline Booksmith for an in-store event with writer Iman Mersal to discuss and celebrate the release of Motherhood and Its Ghosts and Traces of Enayat . From one of the preeminent poets of the Arabic-speaking world, come two brilliant and personal works of creative nonfiction retracing and exploring the lives of women. Iman Mersal has only one photograph of her mother, who died giving birth at age twenty-seven. But the woman portrayed in it strikes her as very unlike the one in her fleeting childhood memories, in mood, expression, dress. When Mersal has a child of her own decades later, she begins to wonder whether it’s possible to depict a mother with any degree of fidelity. How to represent—in photography, dream, memory, or writing—an individual whose complex inner landscape has suddenly come under threat of looming archetypes? What is hidden in traditional representations of moth­erhood? What lies outside the narrative in which motherhood “means giving, the melding of two distinct selves, a love unlimited and unconditional”? Sifting through the archives of motherhood, including journal entries, photo­graphs, and the writings that have informed her own poetic practice, Mersal privileg­es questions over answers, drifting over arriving, allowing a form of motherhood to exist in these pages unbounded. And in Traces of Enayat , winner of the prestigious Sheikh Zayed Book Award, Mersal retraces the mysterious life and erasure of Egyptian literature's tragic heroine, Enayat al-Zayyat. Cairo, 1963: four years before her lone novel is finally published, the writer Enayat al-Zayyat takes her own life at age twenty-seven. For the next three decades, it's as if Enayat never existed at all. Years later, when celebrated Egyptian poet Iman Mersal stumbles upon Enayat's long-forgotten Love and Silence in a Cairo book stall, she embarks on a journey of reflection and rediscovery that leads her ever closer to the world and work of Enayat. In this luminous biographical detective story, Mersal retraces Enayat's life and afterlife though interviews with family members and friend, even tracking down the apartments, schools, and sanatoriums where Enayat spent her days. As Mersal maps two simultaneous psychogeographies—from the glamor of golden-age Egyptian cinema to the Cairo of Mersal's own past—a remarkable portrait emerges of two women striving to live on their own terms. With Traces of Enayat , Iman Mersal embraces the reciprocal relationship between a text and its reader, between past and present, between author and subject. Iman Mersal is an Egyptian writer, translator, and literary scholar. A professor of Arabic language and literature at the University of Alberta, she is the author of five books of Arabic poetry. In English translation, her poems have appeared in The New Republic , The New York Review of Books , Parnassus , The Paris Review , and The Nation , among others. The Threshold , translated by Robyn Creswell and published in 2022, was shortlisted for the Griffin Poetry Prize and won the 2023 National Translation Award. Mersal received the 2021 Sheikh Zayed Book Award in Literature for her creative nonfiction book Traces of Enayat , published by Transit Books in 2024. Translator Robin Moger is a translator of Arabic to English who lives in Barcelona. His translations of prose and poetry have appeared in Blackbox Manifold , The White Review , Asymptote , Words Without Borders , Washington Square Review , Michigan Review , and elsewhere. The Transnational Literature Series at Brookline Booksmith The Transnational Series focuses on stories of migration, the intersection of politics and literature, and works in translation and is supported by the independent bookstore Brookline Booksmith. Subscribe to the Transnational Series newsletter for information on upcoming events, book recommendations, and more. What You Need to Know to Attend RSVP to let us know you're coming! RSVPs don't guarantee a seat, but you'll be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. Reserve a Book Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! Barring technical difficulty, this event will be livestreamed to our store YouTube channel. Event Accesibility This event will take place at street level. If possible, the event will be livestreamed to YouTube. ASL interpretation may be provided (based on the availability of interpreters) but must be requested at least 2 weeks in advance of the event. Seats are limited. Please email ticketing@brooklinebooksmith.com as soon as possible if you require ASL interpretation, guaranteed seating, or other accommodations . We will do our best to serve your needs! IMPORTANT NOTICE REGARDING COVID & IN-PERSON EVENTS: Please note that any Brookline Booksmith in-person event may be canceled by the bookstore, publisher, or author based on concerns about health and safety around the time of the event. Wherever possible, any in-person appearance canceled due to COVID will be moved to the Brookline Booksmith Zoom as a Webinar at the same date and time, and all tickets & registrations will be transferred to the online event. Book signing details may change. Refunds may be requested in the case of a virtual pivot or event cancelation.",
        "event_link": "https://www.eventbrite.com/e/transnational-series-iman-mersal-tickets-1310668357339?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#literature",
            "#author",
            "#bookstore",
            "#booksigning",
            "#booklaunch",
            "#booktalk"
        ]
    },
    {
        "title": "Sign Painters' Brush Lettering Workshop",
        "date_time": "May 17 · 10am - May 18 · 6pm EDT",
        "location": "516 E 2nd St 516 East 2nd Street Boston, MA 02127 Show map",
        "about": "This 2-day course is designed to teach students the fundamentals of hand-lettering for signs, posters, and more. The class will have a heavy focus on developing the ability to draw legible letters and numerals from scratch, rather than simply copying references or using patterns/stencils. Students will learn how to become more attuned to the shapes and negative spaces of letters, enhancing their overall design skills.",
        "event_link": "https://www.eventbrite.com/e/sign-painters-brush-lettering-workshop-tickets-1284477259059?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Hobbies Classes",
            "#workshop",
            "#creativity",
            "#lettering",
            "#signs",
            "#hand_lettering",
            "#brush_lettering",
            "#lettering_workshop",
            "#sign_painting",
            "#hand_painted",
            "#sign_painters"
        ]
    },
    {
        "title": "Ruthie Ackerman with Cloe Axelson: The Mother Code",
        "date_time": "Starts on Thursday, May 22 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of The Mother Code with author Ruthie Ackerman, in conversation with Cloe Axelson. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/ruthie-ackerman-with-cloe-axelson-the-mother-code-tickets-1312089919269?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "BoardGame Speed Dating -  Dorchester Brewing - Dorchester -(Ages 25-39)",
        "date_time": "Tuesday, May 13 · 7 - 9pm EDT",
        "location": "Dorchester Brewing 1250 Massachusetts Ave Boston, MA 02125 Show map",
        "about": "Searching for a partner can be horrifically painful. But board games are always awesome. So what if you combined board games and finding a partner? Picture this: You sit down for a night of games. A gaming concierge walks you through several games over the course of the night. You play classics you love and discover brand new games you've never heard of, playing each with a different group of fun singles. All while in a great establishment with plenty of delicious options on tap. At the end of the night, you give your gaming concierge a list of the folks you met that you'd like to date and a list of those you met that you'd like to just hang out with as friends. If any two people put down the same name as each other in either column, then your gaming concierge will make sure you get each other's e-mail address and you can coordinate a time to hang out. Best case scenario: You find true love, discover some awesome board games, and make some new friends. Bad case scenario: You accomplish only one of those three things, which is still pretty great. Worst case scenario: There will be alcohol. Before you decide to buy tickets, a few basics we should cover: 1) This event is for men & women, ages 25-39. We also have events for other age groups, an event for gay men and an event for queer women. And we're hoping to add events to serve even more people in the future! Head over to www.quirkevents.com/boston to see what else we have to offer. (If you scroll all the way to the bottom of the page, you'll be able to join our mailing list and get notified about future events. Plus, joining our mailing list gets you 50% off your first ticket purchase!) 2) Refunds are only available to those who cancel with more than 48 hours' notice, in order to make sure we have enough time to find a replacement for you and keep the event well-populated. (Exceptions will be made for emergency situations on a case-by-case basis). After that, we're blowing the money from your ticket sale on something awesome and nonrefundable. 3) If we get to 24 hours before the event and still haven't sold five tickets for each gender, we will cancel the event (and notify you). When we have run this event in the past, tickets have consistently sold very well, so we don't expect this to happen. But we thought we should cover this in case it came up. 4) How many games we have and which ones we use will be based in part on how many people attend, so we can't tell you for sure what we'll have right now. But the goal is for all of them to be fun, light, easy-to-learn games. Selection will include games from both the something-you-have-played-before category and the something-you-haven't-played-before category. The games are also chosen because they often tend to spark conversation and leave room for chatting with new people as you play. All games will be group games, meaning you'll get a chance to meet a handful of people with each new round. 5) To stay up to date on everything we have going on here at Quirk Events, follow us on Instagram here! 6) Dorchester Brewing is a 21+ venue. No outside food drinks are allowed inside.",
        "event_link": "https://www.eventbrite.com/e/boardgame-speed-dating-dorchester-brewing-dorchester-ages-25-39-tickets-1290287908869?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Hobbies Games",
            "#boston",
            "#beer",
            "#singles",
            "#games",
            "#boardgames",
            "#speeddating",
            "#singles_events",
            "#speed_dating",
            "#singles_30s",
            "#singles_20s"
        ]
    },
    {
        "title": "Lori Lobenstine and Sophie Canon: The Barking Puppy",
        "date_time": "Starts on Wednesday, May 21 · 5pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of The Barking Puppy with author Lori Lobenstine and Sophie Canon. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 4:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/lori-lobenstine-and-sophie-canon-the-barking-puppy-tickets-1296198808529?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "The Seastone Dragon - D&D Mini-Campaign",
        "date_time": "Thursday, May 1 · 6:30 - 9:30pm EDT",
        "location": "Side Quest Books & Games 1 Bow Market Way #suite 32 Somerville, MA 02143 Show map",
        "about": "Join Fight The Exposition as we continue our mini-campaign series with The Seastone Dragon ! Seastone. At first glance, it glimmers with the beauty of the rarest diamond—captivating, flawless, and coveted. But beneath its dazzling surface lies a darker truth: a substance that ensnares the mind, binding its wearer in a grip of irresistible addiction. You, a band of adventurers, have been hired to trace the source of this dangerous gem and uncover who is flooding the markets of Desrune with Seastone. The TLDR of our Mini-Campaign Our games are 18+ and are catered to an adult audience. Purchase of this ticket means you are able to attend the following dates! May 1st May 8th May 15th Sessions start at 6:30 pm and end at 9:30 pm. We do not offer refunds for missed sessions. If you wish to refund your ticket, we require at least 7 days notice. Upon purchasing a ticket, you will receive an email from Fight The Exposition that will go over the full details of the mini-campaign. Meet your Dungeon Master Sam M (he/him) is a professional Dungeon Master and one of the resident Game/Dungeon Masters with Fight The Exposition . With over four years of experience running games and a decade of experience as a player, he takes great pride in creating a fun and friendly environment where players can flex their creativity. Ticket Pricing Sustainer Package ($50 per session, $150 total) For those with the most financial flexbility and who wish to provide extra assistance to help fund our Communal Package, often reserved for players who may not be as financially flexible. Standard Package ($40 per session, $140 total) Our market rate and an accurate reflection of our costs. It includes campaign preparation, facilitated play, and expenses such as materials and fees. Communal Package ($30 per session, $90 total) Reduced admission rate for those who may not be as financially flexible and may otherwise be excluded from attending a Fight The Exposition event. Questions? Send us an email at info@fighttheexposition.com or reach out to us on Instagram @ fighttheexposition . About Fight The Exposition Fight The Exposition is an AAPI-owned small business founded by Joshua Do in March 2023. Our aim is to provide the best Dungeons & Dragons experience, believing that the shared adventures in the game offer a once-in-a-lifetime opportunity. We pride ourselves on running excellent games and creating a safe, inclusive space for all our players.",
        "event_link": "https://www.eventbrite.com/e/the-seastone-dragon-dd-mini-campaign-tickets-1320720192649?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Games",
            "Somerville Hobbies Games",
            "#cambridge",
            "#somerville",
            "#dnd",
            "#dungeonsanddragons"
        ]
    },
    {
        "title": "Intro to Sewing Machine Class - Make a Upcycled Denim Bag (beginner-friend)",
        "date_time": "Monday, April 28 · 12 - 3pm EDT",
        "location": "Innovate@BU 730 Commonwealth Avenue Brookline, MA 02446 Show map",
        "about": "Discover the joy of sewing and upcycling in this beginner-friendly workshop! Whether you're brand new to sewing or looking to refresh your skills, this hands-on class will teach you the essentials of using a sewing machine while creating a stylish, functional and one-of-a-kind upcycled denim crossbody bag . What You’ll Learn: Basics of sewing machine operation and maintenance Essential sewing techniques and tools How to work with upcycled materials, including denim What’s Included: All materials and tools provided, including upcycled denim and sewing supplies Step-by-step guidance to help you complete your bag Your very own handmade crossbody bag to take home Designs: We offer multiple design options for you to choose from, ensuring your project is tailored to your style and preferences. The default class ticket is for a small crossbody bag, and the price difference can be paid at the door. Please email reworkstudioshop@gmail.com the design you would like to make before the arrival. More designs are available @reworkstudioshop free to DM to learn about the price for other projects. The entire making process will be guided with personalized 1-on-1 instruction from the instructor, customized for your specific project. Optional: Participants are welcome to bring their own materials (e.g., old jeans or denim) if approved by the instructor ahead of time. This interactive workshop is the perfect way to learn to sew, explore creative upcycling, and leave with a one-of-a-kind handmade item. Location: 730 Commonwealth Avenue, Brookline, MA 02446 (Appointment or ticket purchase needed before arriving) Duration: 2-3 hours (You’re welcome to stay and work on your project until it’s finished, as long as it’s before our 6:00 PM closing time.) Spaces are limited, so grab your spot today and start your sewing journey with Rework Studio & Shop. Follow us on Instagram @reworkstudioshop for new designs and updates.",
        "event_link": "https://www.eventbrite.com/e/intro-to-sewing-machine-class-make-a-upcycled-denim-bag-beginner-friend-tickets-1286243411669?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Hobbies Classes",
            "#class",
            "#event",
            "#beginner_friendly",
            "#sewing_machine",
            "#upcycled_denim_bag"
        ]
    },
    {
        "title": "Rose Waldman &  Todd Portnowitz with Lisa Newman: Sons & Daughters",
        "date_time": "Starts on Sunday, May 25 · 4pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of Sons and Daughters by Chaim Grade with translator Rose Waldman and editor Todd Portnowitz, in conversation with Lisa Newman. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/rose-waldman-todd-portnowitz-with-lisa-newman-sons-daughters-tickets-1317601825529?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Fae D&D Game Night @ SQBG",
        "date_time": "Friday, May 9 · 7 - 11pm EDT",
        "location": "Side Quest Books & Games 1 Bow Market Way Suite 32 Somerville, MA 02143 Show map",
        "about": "Though parallel to the material plane, the faewild is raw, primal, and shaped by the manic emotions of its inhabitants. And while its impossible beauty may be alluring, make no mistake: the land — and almost everything in it — can be lethal to the over-confident or carefree adventurer. So keep your wits about you, if you can: this isn't your typical fairytale. To get started quickly, we'll be doing some character prep work ahead of time. You must join the Boston D&D & RPGs Discord as part of signing up for this so we're all on the same page! Link to join here: https://discord.gg/fXtJxxAnE4 --- ABOUT YOUR DM Caroline has been playing and GMing TTRPGs for ten years. She loves homebrewing adventures, she strives to create safer and more inclusive gaming environments for everyone, and she's never met an NPC she couldn't make just a liiiiittle more deliciously unlikeable. She also owns Side Quest Books & Games. --- ABOUT THE VENUE Side Quest Books & Games is located on the balcony of Bow Market in Somerville's Union Square. There is an elevator available in the Bow Market lobby, which is to the right of Pop's Pinball Parlor. Outside food and drink are allowed. Masks are optional, but please let us know and stay home if you are ill.",
        "event_link": "https://www.eventbrite.com/e/fae-dd-game-night-sqbg-tickets-1323272205789?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Games",
            "Somerville Hobbies Games",
            "#adventure",
            "#rpg",
            "#dnd",
            "#ttrpg",
            "#roleplaying",
            "#sqbg",
            "#dnd_game_night"
        ]
    },
    {
        "title": "Story Hour! Ben Clanton: Paint with Ploof",
        "date_time": "Starts on Friday, May 9 · 4pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Join us for an all-ages afternoon storytime to celebrate Paint with Ploof with Ben Clanton. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. Reserve a book! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 3:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed.",
        "event_link": "https://www.eventbrite.com/e/story-hour-ben-clanton-paint-with-ploof-tickets-1293029418799?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Set Piece Celebration with Lana Schwartz",
        "date_time": "Tuesday, May 20 · 7 - 9pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "Join Lana Schwartz at Lovestruck Books on Tuesday, May 20 for a celebration of her coming release, Set Piece . In conversation with Katie Cotugno, Lana will discuss the second-chance celebrity/normal person romance that you’ll be tempted to read in one sitting! Set Piece is everything you’re looking for in a romance: smart, warm, and sexy as all hell. EVENT DETAILS: 6:30 PM: Doors Open – Get settled in and ready for the discussion! 7:00 PM: Discussion Begins – Lana and Katie Cotugno will dive into Set Piece 7:45 PM: Q&A Session – Your chance to ask the author anything! 8:00 PM: Signatures, Snapping Pics, and Salutations – Meet Lana get your book signed, and snap a photo! 9:00 PM: Event Wraps Up – Thanks for joining us! Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person.",
        "event_link": "https://www.eventbrite.com/e/set-piece-celebration-with-lana-schwartz-tickets-1333320229699?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Hobbies Parties",
            "#book",
            "#bookstore",
            "#bookclub",
            "#booksigning",
            "#bookwriting",
            "#author_event",
            "#book_discussion",
            "#author_talk",
            "#romantasy"
        ]
    },
    {
        "title": "Speed Puzzling at Winter Hill Brewing in Sommerville, MA.",
        "date_time": "Sunday, April 27 · 4 - 6pm EDT",
        "location": "Winter Hill Brewing Company 328 Broadway Somerville, MA 02145 Show map",
        "about": "Welcome to Puzzle Buzz at Winter Hill Brewing in Somerville, MA! Join us on Sunday at 4:00 for a lively evening of speed puzzle-solving fun! Gather your team or come solo to test your skills, and compete to see who can solve the puzzle the fastest. Enjoy fantastic brews and great company while tackling a fresh new puzzle each month. The best part, you keep the puzzle! Don’t miss this chance to unwind, connect with friends, and take home the puzzle after the event. Mark your calendars and be part of the fun at Winter Hill Brewing ! HOW IT WORKS: Each team gets the same puzzle sealed in a bag to ensure no sneak peeks. After a countdown, you’ll open your bag and start puzzling against the clock. Your Puzzle Host will monitor progress, take photos, and record finish times. Once you’re done, feel free to stick around, enjoy a drink, or tackle another puzzle just for fun!",
        "event_link": "https://www.eventbrite.com/e/speed-puzzling-at-winter-hill-brewing-in-sommerville-ma-tickets-1306699325859?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Games",
            "Somerville Hobbies Games",
            "#jigsawpuzzle",
            "#craft_beer",
            "#board_games",
            "#puzzlecompetition",
            "#speed_puzzle",
            "#monthly_event",
            "#puzzle_fun",
            "#2row_brewing",
            "#jigsaw_challenge"
        ]
    },
    {
        "title": "Transnational Series: Daniel Tam-Claiborne with Aube Rey Lescure",
        "date_time": "Starts on Tuesday, May 20 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "Join the Transnational Literature Series at Brookline Booksmith for an in-store event with Daniel Tam-Claiborne to discuss and celebrate the release of Transplants . He will be in conversation with writer Aube Rey Lescure. A harrowing and poignant novel following two young women in pursuit of kinship and self-discovery who yearn to survive in a world that doesn’t know where either of them belong. On a university campus in rural Qixian, Lin and Liz make an improbable pair: Lin, a Chinese student closer to her menagerie of pets than to her peers, and Liz, a Chinese American teacher grieving her mother’s sudden death. They’re each met with hostility—Lin by her classmates, who mock her for dating a white foreigner; Liz by her fellow English teachers, who exploit their privilege—and forge an unlikely friendship. After a startling betrayal that results in Lin’s expulsion, they swap places. Lin becomes convinced to pursue her degree at a community college near Liz’s Ohio hometown, while Liz searches for answers as to what drove her parents to leave China before she was born. But when a global catastrophe deepens the fissures between modern-day China and an increasingly fractured United States, Lin and Liz—far from home and estranged from themselves—are forced to confront both the familiar and the strange in each other. Unspooling over the course of a single extraordinary year in our not-yet-distant past and in small towns from Dandong to Deadwood, Transplants is a piercing story of migration, belonging, and the parts of ourselves that get lost in translation. Alternating between Liz and Lin’s perspectives, it is a lyrical and moving exploration of race, love, power, and freedom that illuminates the limits and possibilities of what can happen when we open ourselves to the unknown and reveals how even our fiercest differences may bring us closer than we might ever imagine. Daniel Tam-Claiborne is a multiracial writer, multimedia producer, and nonprofit director. He is the author of the short story collection What Never Leaves , and his writing has appeared in Catapult , Literary Hub , Off Assignment , The Rumpus , HuffPost , and elsewhere. A 2022 National Endowment for the Arts Literature Fellow, he has also received support from the U.S. Fulbright Program, Kundiman, Sewanee Writers’ Conference, the New York State Summer Writers Institute, and others. Daniel holds degrees from Oberlin College, Yale University, and the MFA Program for Writers at Warren Wilson College. Born and raised in Brooklyn, he lives with his wife and daughter in Seattle. Moderator Aube Rey Lescure is a French-Chinese-American writer. She grew up between Provence, northern China, and Shanghai, and graduated from Yale University in 2015. She is the co-author and translator of two books on Chinese politics and economics. Aube’s debut novel, River East, River West , was published in 2024. It has been shortlisted for the Women's Prize for Fiction, the Maya Angelou Book Award, and the Stanfords' Fiction with a Sense of Place Award. Her writing has appeared or is forthcoming in Granta , Guernica , LitHub , Electric Literature , The Millions , Litro , and more. Her essay “At the Bend of the Road” was selected for Best American Essays 2022 . The Transnational Literature Series at Brookline Booksmith The Transnational Series focuses on stories of migration, the intersection of politics and literature, and works in translation and is supported by the independent bookstore Brookline Booksmith. Subscribe to the Transnational Series newsletter for information on upcoming events, book recommendations, and more. What You Need to Know to Attend RSVP to let us know you're coming! RSVPs don't guarantee a seat, but you'll be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. Reserve a Book Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! Barring technical difficulty, this event will be livestreamed to our store YouTube channel. Event Accesibility This event will take place at street level. If possible, the event will be livestreamed to YouTube. ASL interpretation may be provided (based on the availability of interpreters) but must be requested at least 2 weeks in advance of the event. Seats are limited. Please email ticketing@brooklinebooksmith.com as soon as possible if you require ASL interpretation, guaranteed seating, or other accommodations . We will do our best to serve your needs! IMPORTANT NOTICE REGARDING COVID & IN-PERSON EVENTS: Please note that any Brookline Booksmith in-person event may be canceled by the bookstore, publisher, or author based on concerns about health and safety around the time of the event. Wherever possible, any in-person appearance canceled due to COVID will be moved to the Brookline Booksmith Zoom as a Webinar at the same date and time, and all tickets & registrations will be transferred to the online event. Book signing details may change. Refunds may be requested in the case of a virtual pivot or event cancelation.",
        "event_link": "https://www.eventbrite.com/e/transnational-series-daniel-tam-claiborne-with-aube-rey-lescure-tickets-1281663302439",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#china",
            "#literature",
            "#chinese",
            "#author",
            "#bookstore",
            "#transplants",
            "#booksigning",
            "#booklaunch",
            "#novel",
            "#booktalk"
        ]
    },
    {
        "title": "Tiling",
        "date_time": "Saturday, May 3 · 10am - 2pm EDT",
        "location": "100 Terrace St 100 Terrace Street Boston, MA 02120 Show map",
        "about": "In one of our most popular workshops, you can learn all aspects of tiling, from subfloor to grout. Learn about ceramic and stone tiling, including materials, layout, cutting, and installation. Applications in bathrooms and kitchens will be addressed, and hands-on training will help participants learn tile-setting techniques. Whether you have a tiling project in mind or just want to better understand how tiles stay up on the walls, this class will stick with you! Instructor Theo Graham has worked throughout Massachusetts and New Hampshire as a skilled tile installer, working on kitchens, baths, and floors in a large number of both residential and commercial spaces. ***** If you are a BBR Co-op Member, use the promotion code COOPMEMBER to receive a discount. (Not a member? Consider joining the Co-op!) If you are a BBR Plus Member (income-qualified), use the promotion code PLUSMEMBER to receive a discount. Learn more about Plus membership. If the discounted price presents a financial hardship, please email workshops@bostonbuildingresources.com. Limited scholarship funds are available for further discounts for Plus members.",
        "event_link": "https://www.eventbrite.com/e/tiling-registration-1304082348409",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Hobbies Classes",
            "#workshop",
            "#diy",
            "#remodeling",
            "#handson",
            "#homeimprovement",
            "#tiling",
            "#workshop_course_events",
            "#building_and_construction",
            "#homeimprovement_class",
            "#tile_install"
        ]
    },
    {
        "title": "Sarah Maria Griffin with Paul Tremblay: Eat the Ones You Love",
        "date_time": "Starts on Tuesday, May 13 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of Eat the Ones You Love with author Sarah Maria Griffin, in conversation with Paul Tremblay. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/sarah-maria-griffin-with-paul-tremblay-eat-the-ones-you-love-tickets-1295054174899",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "The Love Haters Meet & Greet with Katherine Center",
        "date_time": "Sunday, June 8 · 10am - 12pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "After quickly selling out of tickets for The Love Haters Release Celebration with Katherine Center we’ve decided to add a more casual meet and greet for folks who’d still love the opportunity to meet Katherine. Join us on Sunday morning, June 8 for a meet, greet and signing of The Love Haters , with Katherine Center. This is the newest laugh-out-loud, all-the-feels rom-com by New York Times bestselling author. It’s a thin line between love and love-hating, and we’re ready to celebrate it all at this book signing! TICKETS Your $29 ticket purchase includes a copy of The Love Haters . Tickets are assigned to specific time slots. To help minimize wait times for everyone, please arrive at your designated time. Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person.",
        "event_link": "https://www.eventbrite.com/e/the-love-haters-meet-greet-with-katherine-center-tickets-1317602276879",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Hobbies Seminars",
            "#event",
            "#writing",
            "#author",
            "#launch_party",
            "#author_talk",
            "#romance_books",
            "#romantasy"
        ]
    },
    {
        "title": "Story Hour! Christopher Willard: Feelings Are Like Farts",
        "date_time": "Starts on Sunday, April 27 · 10:30am EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Join us for an all-ages storytime to celebrate Feelings Are Like Farts with author Christopher Willard. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. Reserve a book! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 10AM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed.",
        "event_link": "https://www.eventbrite.com/e/story-hour-christopher-willard-feelings-are-like-farts-tickets-1297285498849",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Speed Puzzling at Winter Hill Brewing in Sommerville, MA.",
        "date_time": "Sunday, April 27 · 4 - 6pm EDT",
        "location": "Winter Hill Brewing Company 328 Broadway Somerville, MA 02145 Show map",
        "about": "Welcome to Puzzle Buzz at Winter Hill Brewing in Somerville, MA! Join us on Sunday at 4:00 for a lively evening of speed puzzle-solving fun! Gather your team or come solo to test your skills, and compete to see who can solve the puzzle the fastest. Enjoy fantastic brews and great company while tackling a fresh new puzzle each month. The best part, you keep the puzzle! Don’t miss this chance to unwind, connect with friends, and take home the puzzle after the event. Mark your calendars and be part of the fun at Winter Hill Brewing ! HOW IT WORKS: Each team gets the same puzzle sealed in a bag to ensure no sneak peeks. After a countdown, you’ll open your bag and start puzzling against the clock. Your Puzzle Host will monitor progress, take photos, and record finish times. Once you’re done, feel free to stick around, enjoy a drink, or tackle another puzzle just for fun!",
        "event_link": "https://www.eventbrite.com/e/speed-puzzling-at-winter-hill-brewing-in-sommerville-ma-tickets-1306699325859",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Games",
            "Somerville Hobbies Games",
            "#jigsawpuzzle",
            "#craft_beer",
            "#board_games",
            "#puzzlecompetition",
            "#speed_puzzle",
            "#monthly_event",
            "#puzzle_fun",
            "#2row_brewing",
            "#jigsaw_challenge"
        ]
    },
    {
        "title": "Intro to Sewing Machine Class - Make a Upcycled Denim Bag (beginner-friend)",
        "date_time": "Monday, April 28 · 12 - 3pm EDT",
        "location": "Innovate@BU 730 Commonwealth Avenue Brookline, MA 02446 Show map",
        "about": "Discover the joy of sewing and upcycling in this beginner-friendly workshop! Whether you're brand new to sewing or looking to refresh your skills, this hands-on class will teach you the essentials of using a sewing machine while creating a stylish, functional and one-of-a-kind upcycled denim crossbody bag . What You’ll Learn: Basics of sewing machine operation and maintenance Essential sewing techniques and tools How to work with upcycled materials, including denim What’s Included: All materials and tools provided, including upcycled denim and sewing supplies Step-by-step guidance to help you complete your bag Your very own handmade crossbody bag to take home Designs: We offer multiple design options for you to choose from, ensuring your project is tailored to your style and preferences. The default class ticket is for a small crossbody bag, and the price difference can be paid at the door. Please email reworkstudioshop@gmail.com the design you would like to make before the arrival. More designs are available @reworkstudioshop free to DM to learn about the price for other projects. The entire making process will be guided with personalized 1-on-1 instruction from the instructor, customized for your specific project. Optional: Participants are welcome to bring their own materials (e.g., old jeans or denim) if approved by the instructor ahead of time. This interactive workshop is the perfect way to learn to sew, explore creative upcycling, and leave with a one-of-a-kind handmade item. Location: 730 Commonwealth Avenue, Brookline, MA 02446 (Appointment or ticket purchase needed before arriving) Duration: 2-3 hours (You’re welcome to stay and work on your project until it’s finished, as long as it’s before our 6:00 PM closing time.) Spaces are limited, so grab your spot today and start your sewing journey with Rework Studio & Shop. Follow us on Instagram @reworkstudioshop for new designs and updates.",
        "event_link": "https://www.eventbrite.com/e/intro-to-sewing-machine-class-make-a-upcycled-denim-bag-beginner-friend-tickets-1286243411669",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Hobbies Classes",
            "#class",
            "#event",
            "#beginner_friendly",
            "#sewing_machine",
            "#upcycled_denim_bag"
        ]
    },
    {
        "title": "First Flight, Final Fall Release Party with C.W. Farnsworth",
        "date_time": "Tuesday, April 29 · 7 - 9pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "Join us at Lovestruck Books on Tuesday, April 29 to celebrate the arrival of First Flight, Final Fall with a special release party! The perfect blend of sports, romance, and sizzling chemistry, this limited first print run cover is a must-have— with stunning sprayed edges and an exclusive bonus epilogue just for YOU. C.W. Farnsworth will be in conversation with the amazing Monica Murphy, diving into the searing romance, the strong characters, and the high-stakes world of sports. If you love a strong female lead who’s a top US college player dedicated to her sport, a celebrity romance with a world-famous soccer star, and a hero who falls first and hard, this is the event for you. Add in a sports romance where both characters are athletes, and a summer fling that turns into first love, and Saylor and Beck is everything you’ve been waiting for. EVENT DETAILS: 6:30 PM: Doors Open – Get settled in and ready for the discussion! 7:00 PM: Discussion Begins – C.W. and Monica will dive into First Flight, Final Fall. 7:45 PM: Q&A Session – Your chance to ask the author anything! 8:00 PM: Signatures, Snapping Pics, and Salutations – Meet C.W., get your book signed, and snap a photo! 9:00 PM: Event Wraps Up – Thanks for joining us! Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person.",
        "event_link": "https://www.eventbrite.com/e/first-flight-final-fall-release-party-with-cw-farnsworth-tickets-1292921776839",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Hobbies Parties",
            "#book",
            "#bookstore",
            "#bookclub",
            "#booksigning",
            "#bookwriting",
            "#author_event",
            "#book_discussion",
            "#author_talk"
        ]
    },
    {
        "title": "Jennifer Hope Choi with Tiana Clark: The Wanderer's Curse",
        "date_time": "Starts on Wednesday, May 14 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of The Wanderer's Curse with author Jennifer Hope Choi with Tiana Clark. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/jennifer-hope-choi-with-tiana-clark-the-wanderers-curse-tickets-1296149049699?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Story Hour! Jamie Michalak: Hazel the Handful",
        "date_time": "Starts on Sunday, May 4 · 10:30am EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Join us for an all-ages storytime to celebrate Hazel the Handful with author Jamie Michalak. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. Reserve a book! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 10AM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed.",
        "event_link": "https://www.eventbrite.com/e/story-hour-jamie-michalak-hazel-the-handful-tickets-1292820674439?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Solo Journaling RPG Night @ SQBG",
        "date_time": "Tuesday, May 13 · 6 - 9pm EDT",
        "location": "Side Quest Books & Games 1 Bow Market Way Suite 32 Somerville, MA 02143 Show map",
        "about": "Join us for a cozy, quiet evening where you can try out the solo journaling RPG of your choice — all materials (and guidance) provided! Games available will include: Anamnesis The Eleventh Beast Tangled Blessings Carved by the Garden To Honour and Obey Auspex ...and more! What's a solo role-playing game? A solo journaling RPG isa type of tabletop role-playing game designed to be played by a single person. It involves using prompts — often drawn from dice, cards, or other random generators — to spark imaginative writing, world-building, or character development through writing. These games prioritize creative expression and narrative exploration. ----- ABOUT THE VENUE Side Quest Books & Games is a woman- and queer-owned fantasy shop for magical books, indie tabletop role-playing games, and nerdy knick-knacks — all centering women and underrepresented creators. The shop is located on the Bow Market balcony. Outside food and drink are welcome. Masks are optional, but please let us know and stay home if you get sick.",
        "event_link": "https://www.eventbrite.com/e/solo-journaling-rpg-night-sqbg-tickets-1323561019639?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Parties",
            "Somerville Hobbies Parties",
            "#creative",
            "#writing",
            "#ttrpg",
            "#sqbg",
            "#solo_rpg",
            "#rpg_night",
            "#solo_journaling"
        ]
    },
    {
        "title": "DIY Effect Building Workshop @ Synthfest",
        "date_time": "Saturday, May 3 · 11am - 3pm EDT",
        "location": "Northeastern University 360 Huntington Avenue Ryder Bldg, Room 431 Boston, MA 02115 Show map",
        "about": "We are hosting two different workshops at NESF.  Build a Theremin in an Altoids tin for on-the-go fun sounds and exprimentation OR Build a Tank Reverb EuroRack module to add thick drippy reverb to your musical creations. We will guide you at every step along the way. The Cram Audio DIY Tank Reverb is an analog circuit that uses an actual spring reverb tank to gives you a lush reverb effect. The module offers control for Mix and Feedback allowing you to tailor the reverb from subtle to overdriven, with many interesting settings along the way, helping you to craft the unique tone required to set your composition apart from the crowd. The Cram Audio DIY Tank Reverb drives the reverb tank via discrete transistors to ensure rich clean reverb tone. The Mix potentiometer helps you to proportion the wet & dry signals and the feedback potentiometer helps to extend the natural decay of the reverb tank - almost to infinity if desired. Learn to build your very own 𝐓𝐡𝐞𝐫𝐞𝐦𝐢𝐧! You'll be experimenting with eerie sci-fi sounds in no time. The Theremin is an electronic musical instrument controlled without physical contact by the performer. It's named after its inventor, Leon Theremin, who patented the device in 1928. The 𝗔𝗹𝘁𝗼𝗶𝗱𝘀 𝗧𝗵𝗲𝗿𝗲𝗺𝗶𝗻 is controlled by of two antennas which function as position sensors. Each antenna forms one half of a capacitor with each of the thereminist's hands as the other half of the capacitor. These antennas capacitively sense the relative position of you hands and control oscillators for frequency with one hand, and volume with the other. The electric signals from the Theremin are sent to an amplifier via a 1/4\" jack. Learn and save. You will solder, assemble components, and customize your very own musical instrument. No prior experience soldering is necessary - bring your creativity and enthusiasm to learn more about effect pedals! Don't miss this opportunity to dive deep into the world of DIY electronics and create a unique and sophisticated effect pedal. If you need help with your circuit, your instructors have 20+ years’ experience building, designing, and troubleshooting analog and digital circuitry. So rest assured that we will get your effect working and get you jamming. Expect this workshop to last 3 – 4 hours. You’ll leave with a working module and a good handful of electronics knowledge. I hope to see you there!",
        "event_link": "https://www.eventbrite.com/e/diy-effect-building-workshop-synthfest-registration-1309785566889?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Hobbies Classes",
            "#eurorack",
            "#reverb",
            "#diyprojects"
        ]
    },
    {
        "title": "Beginner Sewing - Apron",
        "date_time": "Thursday, May 1 · 5:30 - 7pm EDT",
        "location": "Craft Loft (Cambridge Store) 100 Cambridgeside Place #2nd floor Cambridge, MA 02141 Show map",
        "about": "New to sewing or would like to try your hand at a wearable project? This Apron sewing workshop is the perfect intro to sewing. Learn the basics of using a sewing machine, pattern and make your own stylish apron! The topics covered include: Fundamentals of using a sewing machine How to use a pattern What's seam allowance Right side vs. Wrong side of fabric Overstitch and reverse stitch Choose from a selection of fun fabric prints or bring your own. If you decide to bring your own fabric, please plan for 1.5yards of non-stretchy fabric. Cotton, canvas or flannel should all work well. Avoid anything extra thick or synthetic such as vinyl or faux leather. These will not work with our sewing machines and are also difficult to work with for beginners. Duration : 90min Minimum age : +13yrs (all minors need to be accompanied with an adult for the duration of the workshop) Location: Craft Loft 100 CambridgeSide Pl, 2nd floor near TJ Maxx Cambridge, MA 02141 *Please see our refund/reschedule policy here. Tipping is not expected but always appreciated!",
        "event_link": "https://www.eventbrite.com/e/beginner-sewing-apron-tickets-1256772342909?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Hobbies Classes",
            "#apron",
            "#sewing_class",
            "#sewing_workshop",
            "#beginner_sewing",
            "#sewing_project"
        ]
    },
    {
        "title": "Pub Trivia Murder Mystery Challenge: The Case of the Poisoned Patron",
        "date_time": "Saturday, May 17 · 5 - 8pm EDT",
        "location": "Boston Public Market 100 Hanover Street Boston, MA 02108 Show map",
        "about": "For months, the local pub was home to a run-of-the-mill trivia game. Until one night, it was home to a murder! A local player dropped dead in this otherwise friendly battle of wits, and the game hasn't run again since... until tonight. Tonight, we're enlisting your help to solve this mystery the only way we know how: Through a game of pub trivia. Each round, your group will answer trivia questions, which will, in turn, unlock details of the murder, uncover backstories and ultimately answer the greatest question of them all: Whodunnit? So form a team with your sleuthiest friends and see if you can solve The Case of The Poisoned Patron! Please note: This is not a theatrical production featuring actors or audience roles or some of the other staples of a murder mystery production, rather this is a trivia game with a murder mystery puzzle interwoven. A few other items of note... --------- 1) This is our second time running this event at Boston Public Market, and we also host it in other Boston locations and elsewhere in New England. They are all the same game featuring the same key elements and questions, so we ask players not to sign up for more than one event. However, for those of you dying to play again, we have good news: If this continues to get as good a reaction as it has so far, we plan to do a new mystery later in 2025. If you click the \"upcoming events\" tab at www.quirkevents.com , and choose the city of your choice, then scroll all the way to the bottom of the page, you'll be able to join our mailing list and get notified about future events. Plus, joining our mailing list gets you 50% off your first ticket purchase! 2) Refunds are only available to those who cancel with more than 48 hours' notice. After that, we're blowing the money from your ticket sale on something extravagant and nonrefundable. 3) To stay up to date on everything we have going on at Quirk Events, follow us on Instagram here!",
        "event_link": "https://www.eventbrite.com/e/pub-trivia-murder-mystery-challenge-the-case-of-the-poisoned-patron-tickets-1263969509829?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Hobbies Games",
            "#beer",
            "#games",
            "#boardgames",
            "#triviatainment",
            "#murder_mystery",
            "#murder_mystery_events",
            "#murder_mystery_evening",
            "#trivia_game",
            "#murder_mystery_game"
        ]
    },
    {
        "title": "Matt Serafini: Feeders",
        "date_time": "Starts on Friday, May 23 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of Feeders with author Matt Serafini. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/matt-serafini-feeders-tickets-1304704579519?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Game Night: \"Lady Blackbird\" at Side Quest Books & Games",
        "date_time": "Friday, May 23 · 7 - 10:30pm EDT",
        "location": "Side Quest Books & Games 1 Bow Market Way Suite 32 Somerville, MA 02143 Show map",
        "about": "ABOUT THE GAME Lady Blackbird is on the run from an arranged marriage and has given up the high status lifestyle of Ilysium in hopes of reuniting with her once secret lover, the pirate king Uriah Flint. She has hired a smuggler ship, The Owl, to discretely escort her across The Wild Blue. It's smooth sailing for crew and cargo until The Owl is flagged and captured by the Imperial cruiser Hand of Sorrow. It's only a matter of time before the Imperial officers discover the true identity of The Owl and of its captain, the infamous Cyrus Vance. How will Lady Blackbird and the others escape this ordeal? What dangers lie in the path between the Hand of Sorrow and the pirate king? Can a lost love protect Lady Blackbird from the grasp of her betrothed? --- ABOUT YOUR GM Cam (they/he) is a game master with several years of experience running indie tabletop games for friends and strangers! He welcomes players who love to learn about/explore new systems and worlds to his table. They love to help players gain confidence in this unique medium that encourages collaborative storytelling and worldbuilding. --- ABOUT THE VENUE Side Quest Books & Games is located on the balcony of Bow Market in Somerville's Union Square. There is an elevator available in the Bow Market lobby, which is to the right of Pop's Pinball Parlor. Outside food and drink are allowed. Masks are optional, but please let us know and stay home if you are ill.",
        "event_link": "https://www.eventbrite.com/e/game-night-lady-blackbird-at-side-quest-books-games-tickets-1323565723709?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Games",
            "Somerville Hobbies Games",
            "#adventure",
            "#rpg",
            "#ttrpg",
            "#roleplaying",
            "#game_night",
            "#sqbg"
        ]
    },
    {
        "title": "Modern KINTSUGI Pottery Workshop & Matcha",
        "date_time": "Friday, May 16 · 5:30 - 7pm EDT",
        "location": "91 Hampshire St, Cambridge, Massachusetts, USA 91 Hampshire Street Cambridge, MA 02139 Show map",
        "about": "Kintsugi Pottery Workshop Join us for a hands-on Kintsugi Pottery Workshop at 91 Hampshire St, Cambridge, Massachusetts, USA. Discover the ancient Japanese art of repairing broken pottery with gold. Get your creative juices flowing as you learn this beautiful technique that transforms flaws into beautiful features. Whether you're a pottery enthusiast or just looking for a unique experience, this workshop is perfect for you. Come and explore the art of KINTSUGI with us! Just bring your creativity and curiosity and ready to have fun. This is an one hour event. You will bring home a piece of Kintsugi pottery with you. Pottery and all materials will be provided. Disclaimer: this is intended to be an event for adults. Any children at 7 or older are welcome when attending with an adult (both need to purchase the tickets and bring your own children's gloves ). Adults are solely responsible for the safety of their children. While we do not accept cancellations and refunds, we offer an one-time reschedulling for the future events. About us: Carol, the founder of Nirvana Healing Arts, is a certified Himalayan singing bowl sound healing therapist, a Reiki master, a RYT 500 yoga teacher, a breathwork instructor, and truth seeker. She learned and started practice Kintsugi since 2015 and she has developed new ways of Kintsugi art to allow people to explore their creativity. She currently teaches yoga at CorePower Yoga and Healthworks. Since her self-discovery and spiritual awakening journey started in 2019, she has travelled the world to learn different healing modalities from world renowned masters in addition to her own research on psychology and energy healing. She was also a meetup organizer for 6 years for two groups with over 1000 members she founded prior to the pandemic. Nirvana healing Arts offers small group sound bath meditation, one on one personalized sound healing therapy, and corporate wellness event. “Healing as a spirtual journey to meet the SELF ”-Carol Sun, Founder of Nirvana Healing Arts. Follow us on Instagram: Nirvana_Healing_Arts",
        "event_link": "https://www.eventbrite.com/e/modern-kintsugi-pottery-workshop-matcha-tickets-1314331503909?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Hobbies Classes",
            "#workshop",
            "#event",
            "#craft",
            "#pottery",
            "#kintsugi"
        ]
    },
    {
        "title": "Floral Designing Workshop",
        "date_time": "Saturday, May 17 · 10 - 11:30am EDT.Doors at 10am",
        "location": "Quincy Market 200-299 Faneuil Hall Marketplace Boston, MA 02109 Show map",
        "about": "Welcome to the Floral Designing Workshop happening at Faneuil Hall Marketplace ! Join Katherine Le-Mai , founder of Haus of Blooms , for an exclusive floral designing workshop on May 17th. With over 10 years of experience in the luxury events and design space, Katherine is thrilled to share her signature design techniques, flower care tips and selection processes. Whether you're a floristry enthusiast, seeking a unique Mother's Day gift, or looking for a fun and bonding activity to share with friends or a date in Boston, this workshop is perfect for you! No experience is needed as we'll provide all the tools, expert guidance, seasonal and premium designer blooms to create your own beautiful floral arrangement to take home. Light refreshments will be available for you to start your morning, so plan to arrive 10-15 minutes early to allow time for parking. Class will begin promptly at 10:30am, and end with a raffle where 2 lucky participants can win an additonal floral arrangement, designed by Haus of Blooms! Other Important Details to Note: Each participant must have their own ticket to attend, with the exception of minor(s) who may accompany a ticket-holding adult. One Ticket = One Arrangement The workshop cannot be rescheduled and cost of ticket cannot be credited, if missed. Please notify us in advance at info@hausofblooms.com if you intend to transfer your ticket to another attendee. By purchasing a ticket, you acknowledge that you have read and agree to these terms.",
        "event_link": "https://www.eventbrite.com/e/floral-designing-workshop-tickets-1312999269159?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Hobbies Classes",
            "#workshop",
            "#flowers",
            "#boston",
            "#raffle",
            "#diy",
            "#floristry",
            "#bostonevents",
            "#floristryworkshop",
            "#floral_design",
            "#floraldesignworkshop"
        ]
    },
    {
        "title": "Jessie Rosen Release Party: All the Signs",
        "date_time": "Wednesday, May 28 · 7 - 9pm EDT",
        "location": "Lovestruck Books 44 Brattle Street cambridge, MA 02138 Show map",
        "about": "Join Jessie Rosen at Lovestruck on Wednesday, May 28 for the release of her sophomore novel All the Signs — a heartfelt and beautifully crafted tale of self-discovery for astrology fans and cynics alike! In conversation with Courtney Marzilli, the two will unpack the heroine’s dreamy journey, embracing astrology’s power in the search for purpose.Your ticket includes a signed copy of All the Signs and a chance to meet the author! EVENT DETAILS: 6:30 PM: Doors Open – Get settled in and ready for the discussion! 7:00 PM: Discussion Begins – Jessie and Courtney will dive into All the Signs 7:45 PM: Q&A Session – Your chance to ask the author anything! 8:00 PM: Signatures, Snapping Pics, and Salutations – Meet Jessie get your book signed, and snap a photo! 9:00 PM: Event Wraps Up – Thanks for joining us! Tickets are limited, so grab yours soon! If the event sells out, you can join the waitlist. Should any spots open up, you’ll have 24 hours to register before we offer them to the next person.",
        "event_link": "https://www.eventbrite.com/e/jessie-rosen-release-party-all-the-signs-tickets-1317589298059?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Hobbies Parties",
            "#book",
            "#bookstore",
            "#bookclub",
            "#booksigning",
            "#bookwriting",
            "#author_event",
            "#book_discussion",
            "#author_talk",
            "#romantasy"
        ]
    },
    {
        "title": "CanalSide Food + Drink Event: Candle Painting and Sip",
        "date_time": "Friday, May 16 · 6 - 7:30pm EDT",
        "location": "CanalSide Food Hall 47 Cambridgeside Place Cambridge, MA 02141 Show map",
        "about": "Come check out the new and improved CanalSide Food + Drink while painting your own designs on candles! In this relaxing and colorful workshop, enjoy creating your own painted candles with expert guidance. We use tapered, odorless candles that are easy to work with for beginners and look great on display and lit! Ticket includes 2 painted candles with the option to purchase more. Ticket also includes one beverage ticket with the options of premium beers, wine, non-alcoholic mocktails and soft drinks. Duration : 1.5hrs Parking : Street parking or garage. Unfortunately, we don't validate parking vouchers. Location: CanalSide Food + Drink 100 CambridgeSide Pl Cambridge, MA Parking : Street parking or garage. Unfortunately, we don't validate parking vouchers. *Please see our refund/reschedule policy here.",
        "event_link": "https://www.eventbrite.com/e/canalside-food-drink-event-candle-painting-and-sip-tickets-1219717490849?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Hobbies Classes",
            "#art",
            "#creative",
            "#event",
            "#crafts",
            "#diy",
            "#canalside",
            "#food_drink",
            "#candle_painting"
        ]
    },
    {
        "title": "Boston Murder Mystery: Solve the case!",
        "date_time": "Sunday, April 27 · 5 - 6:30pm EDT",
        "location": "North Square North Square Boston, MA 02113 Show map",
        "about": "Picture this: You and your friends , armed with just your phones and your courage, become the star detectives for a day in a mysterious murder case. You walk the streets investigating every corner for a clue and you feel the adrenaline rush in your blood as you collect pieces of evidence and get closer to finding the murderer. The story unfolds as you progress , fully immersing you into the scene. The ordinary streets, that you've visited many times, are now your personal universe, where every corner hides a secret and every landmark tells part of the story. WHY SHOULD YOU PLAY THIS❓ 🧠 Mental Stimulation – Exercise your brain with fun puzzles and challenges. 👫 Social Connection – Bond with friends/family through shared problem-solving and create long-lasting memories. 🏙️ Reinvented Discovery – See your city in a whole new way, rediscovering famous landmarks and hidden gems. 🏃‍♂️ Active Adventure – Get outside, explore and do you daily steps while playing. 🕵️ Story Immersion – Lose yourself in a captivating narrative where YOU are the main character . PERFECT FOR ❓ • Friend groups who love games and challenges • Couples who search for unique date ideas • Families who want fun activities to do outside • Work colleagues who need exciting teambuilding experiences • Solo adventurers who are mystery solving enthusiasts HOW DOES IT WORK? This is a role-playing outdoor city game that combines the challenge of an outdoor escape room , the excitement of a scavenger hunt , and the suspense of a murder mystery ! You will play alone ( or with your friends ), guided by the Questo mobile app on your smartphone. 1. Buy your tickets & check the confirmation email 🎫 2. Download the Questo app on your smartphone 📲, login with your email and find the game inside your profile page 🔓. 3. Head outdoors to the Starting L ocation & begin your investigation. The app will guide you all the way.📍",
        "event_link": "https://www.eventbrite.com/e/boston-murder-mystery-solve-the-case-tickets-1319049465459?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Hobbies Games",
            "#friends",
            "#outdoor",
            "#dating",
            "#couples",
            "#teambuilding",
            "#walking",
            "#escape",
            "#scavenger_hunt",
            "#family_friendly",
            "#murder_mystery"
        ]
    },
    {
        "title": "Board Game Speed Dating for Gay Men at Club Café",
        "date_time": "Monday, April 28 · 7 - 9pm EDT",
        "location": "Club Café, Columbus Avenue, Boston, MA, USA 209 Columbus Avenue Boston, MA 02116 Show map",
        "about": "Gay Men Board Game Speed Dating at Club Cafe Searching for a partner can be horrifically painful. But board games are always awesome. So what if you combined board games and finding a partner? Picture this: You sit down for a night of games. A gaming concierge walks you through several games over the course of the night. You play classics you love and discover brand new games you've never heard of, playing each with a different group of fun singles. All while in a great establishment with plenty of delicious options on tap. At the end of the night, you give your gaming concierge a list of the folks you met that you'd like to date and a list of those you met that you'd like to just hang out with as friends. If any two people put down the same name as each other in either column, then your gaming concierge will make sure you get each other's e-mail address and you can coordinate a time to hang out. Best case scenario: You find true love, discover some awesome board games, and make some new friends. Bad case scenario: You accomplish only one of those three things, which is still pretty great. Worst case scenario: There will be alcohol. Before you decide to buy tickets, a few basics we should cover: 1) This is an all-inclusive event for men looking to date other men. Non-binary individuals and anyone else who feels like they would be a good fit are encouraged to attend. If you are a woman looking to date another woman, or if you are looking to date someone of the opposite sex, you can find out more about our other speed dating events at www.quirkevents.com/public-events-boston . 2) Refunds are only available to those who cancel with more than 48 hours' notice, in order to make sure we have enough time to find a replacement for you and keep the event well-populated. (Exceptions will be made for emergency situations on a case-by-case basis). After that, we're blowing the money from your ticket sale on something awesome and nonrefundable. 3) If we get to 24 hours before the event and still haven't sold eight tickets, we will cancel the event (and notify you). We think this is very unlikely but wanted to include a note about it in case that happened. 4) How many games we have and which ones we use will be based in part on how many people attend, so we can't tell you for sure what we'll have right now. But the goal is for all of them to be fun, light, easy-to-learn games. Selection will include games from both the something-you-have-played-before category and the something-you-haven't-played-before category. The games are also chosen because they often tend to spark conversation and leave room for chatting with new people as you play. All games will be group games, meaning you'll get a chance to meet a handful of people with each new round. 5) Desperately wish you could attend, but you have plans on this date or the tickets you want are sold out? E-mail hello@quirkevents.com, and we will add you to our please-notify-me-next-time-you-create-an-event mailing list. 6) Follow us here on Instagram to stay up-to-date on all our events around town!",
        "event_link": "https://www.eventbrite.com/e/board-game-speed-dating-for-gay-men-at-club-cafe-tickets-1063430211389?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Hobbies Games",
            "#boston",
            "#beer",
            "#gay",
            "#lgbtq",
            "#men",
            "#speeddating",
            "#boardgame",
            "#gaymer",
            "#boston_events",
            "#clubcafe"
        ]
    },
    {
        "title": "Dungeons and Dragons at Trident Booksellers",
        "date_time": "Monday, April 28 · 6 - 9pm EDT",
        "location": "Trident Booksellers & Cafe 338 Newbury Street Boston, MA 02115 Show map",
        "about": "For Ages 18+ Fight The Exposition presents Dungeons and Dragons (D&D) night at Trident Booksellers & Cafe! Come join us for a night of adventure as we explore the fantastical realm of sword and sorcery, battle epic monsters, and uncover secrets that have been locked away for centuries. Open to all levels of experience, seats are limited so don't miss out on what will be a very exciting night! D&D Beginner's Table We're excited to offer a beginner's table specifically designed for new players! We'll dedicate the beginning of the session going over the rules and mechanics of the game, and we encourage you to ask questions throughout the session. Rotating TTRPGs - Very Good Dogs In Space Now introducing our rotating TTRPG series! In addition to running Dungeons and Dragons, we will be featuring TTRPG systems ran by one of our professional Game Masters. For the months of April and May , join GM Grayson (she/he) in her game of Very Good Dogs In Space, a game based on the The Very Good Dogs of Chernobyl TTRPG system by 9th Level Games. \"The success of Space Colony Pl-95 was unprecedented. People were even encouraged to bring their beloved pets with them. All was well, until the disaster. You are the remnants of those well-loved companions. You are very good dogs, and you are all that stands between this world and utter destruction.\" This game contains elements of horror . You will be playing the part of dogs, and there will be times when you and your companions are in danger. Please be aware that this game may include harm to animals. ********** Media Release Policy By purchasing a ticket and attending our event, you consent to being photographed, filmed, and otherwise recorded. These photos and videos may be used for promotional purposes, including but not limited to social media, website content, and marketing materials. If you have any concerns about being recorded, please inform us before the event. Lateness Policy We understand that sometimes unforeseen circumstances can cause delays. To accommodate this, we offer a 45-minute grace period from the event start time. If you arrive within this window, you will still be seated. If you arrive more than 45 minutes late, it will be at the Dungeon Master's discretion to determine if you can join their table. To ensure you have the best experience, we highly recommend arriving 5-10 minutes before the event start time. Accessibility and Accommodation We strive to make our events inclusive and accessible for everyone. If you have any accessibility needs or accommodations, please let us know by contacting us directly at info@fighttheexposition.com. Refund Policy Fight The Exposition does not offer refunds for requests made within 48 hours of the event start time. If you find that you are unable to attend our event, we recommend reaching out to us as soon as possible. We may be able to assist you in transferring your ticket to an interested customer.",
        "event_link": "https://www.eventbrite.com/e/dungeons-and-dragons-at-trident-booksellers-tickets-1114636681319?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Hobbies Games",
            "#boston",
            "#cambridge",
            "#somerville",
            "#dnd",
            "#tabletop",
            "#tabletopgaming",
            "#dungeons_and_dragons",
            "#trident_booksellers"
        ]
    },
    {
        "title": "BOSTON - NOW SHOWING: A Letterpress Cinema Fantasy Workshop",
        "date_time": "Saturday, May 10 · 3 - 5pm EDT",
        "location": "Alamo Drafthouse Cinema Boston Seaport 60 Seaport Boulevard ##315 Boston, MA 02210 Show map",
        "about": "Step back in time and immerse yourself in the world of classic cinema with NOW SHOWING , an exclusive, hands-on letterpress workshop where you’ll design and print your own unique lobby poster, inspired by the golden age of Hollywood. In this 2.5-hour workshop, you’ll have the chance to work with authentic vintage letterpress cuts from a wide range of movie genres—from spine-chilling horror to out-of-this-world sci-fi, classic westerns, and glamorous Hollywood films. Whether you're a design enthusiast or a cinephile, this workshop is your chance to create a piece of film history, one lobby poster at a time. What to Expect: Over the course of 2.5 hours, you will dive into the rich history of letterpress printing, guided by expert instructors at The Press Room. Each participant will design their own custom lobby poster, using a curated selection of vintage cuts and typefaces from The Press Room's impressive collection of authentic letterpress movie advertisement cuts. Whether you’re a seasoned printmaker or a beginner eager to explore a new craft, this workshop offers a relaxed, inspiring environment where you can create something truly one-of-a-kind. The process is hands-on and highly personal, with you at the creative helm. No prior experience is needed—just bring your love for design, film, and tactile printmaking! Unique Aspects of the Workshop: Authentic Materials : You’ll work with genuine vintage letterpress cuts that have been carefully curated from The Press Room’s collection. These include iconic film images, typography, and vintage advertisements from cinema’s golden era. One-of-a-Kind Creations : Each participant will design their own lobby poster, leaving with an edition that is uniquely theirs. It's a fantastic way to create a keepsake that celebrates both the art of letterpress and the magic of classic films. In-depth Learning : Get an insider’s look at the letterpress printing process as you explore the tools, techniques, and history behind this timeless art form. The instructors will walk you through each step, from setting type to running the press, so you can fully understand and appreciate the craft. Take Home a Masterpiece : At the end of the workshop, you’ll have your own hand-printed poster edition to take home—a lasting piece of cinema history and a testament to your creativity. Additional Details: Location : The Press Room in the Alamo Drafthouse Seaport Ticket Price : $85 per person (includes all materials and printing time) Capacity : Limited to 8 spots to ensure individual attention for each participant Age Group : Suitable for ages 21+ What to Bring : Just your creativity! All materials will be provided, but feel free to bring any additional design ideas or inspiration for your poster. Don’t miss your chance to experience the magic of vintage letterpress printing while creating something that will last a lifetime. Sign up today and reserve your spot in this unforgettable workshop!",
        "event_link": "https://www.eventbrite.com/e/boston-now-showing-a-letterpress-cinema-fantasy-workshop-tickets-1253353928339?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Hobbies Classes",
            "#workshop",
            "#creative",
            "#boston",
            "#seaport",
            "#massachusetts",
            "#letterpress",
            "#bostonevents",
            "#boston_events",
            "#seaport_boston",
            "#letterpressworkshop"
        ]
    },
    {
        "title": "Finger Knit Velvet Hand Bag and Tote (Advanced Beginner) Workshop",
        "date_time": "Thursday, May 1 · 6 - 7:30pm EDT",
        "location": "Craft Loft (Cambridge Store) 100 Cambridgeside Place #2nd floor Cambridge, MA 02141 Show map",
        "about": "This bag is perfectly sized for style and function. It also feels velvety soft and is quite roomy inside to carry all your everyday essentials. Velvet Tube Yarn is a new material that has a lovely velvet exterior filled with bouncy fiber in the interior. It's soft to the touch yet offers a hefty weight and ease-of-use compared to conventional yarn. This workshop will show you how to finger knit (no needles necessary!) with this unique yarn. We will cover core knitting skills such as cast on, chain stitch and bind off. Treat yourself or bring a friend so you can make something multi-colored. Perfect activity for Girls Night Out and Valentine's Day outings. Materials: 2 skeins of velvet yarn (choose colors when you arrive) Duration: 90 minutes Location: Craft Loft 100 CambridgeSide Pl, 2nd floor near Old Navy Cambridge, MA 02141 *Please see our refund/reschedule policy here. Please note that ticket sales end 24 hours prior to the workshop. We cannot guarantee availability for walk-ins. Thanks! Tipping is not expected but always appreciated!",
        "event_link": "https://www.eventbrite.com/e/finger-knit-velvet-hand-bag-and-tote-advanced-beginner-workshop-tickets-800186217517?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Hobbies Classes",
            "#art",
            "#fashion",
            "#crafts",
            "#diy",
            "#handbag",
            "#tote",
            "#velvet",
            "#velvethandbag"
        ]
    },
    {
        "title": "Adam Met at First Parish Church",
        "date_time": "Starts on Friday, June 13 · 7pm EDT",
        "location": "First Parish Church 1446 Massachusetts Ave Cambridge, MA 02138 Show map",
        "about": "Harvard Book Store welcomes Adam Met — member of the multi-platinum band AJR, climate advocate, and educator—for an unforgettable evening celebrating his debut book, Amplify: How to Use the Power of Connection to Engage, Take Action, and Build a Better World . This unique event blends engaging conversations, literary insights, special guests, and musical analyses, offering a multifaceted exploration of how fan-building tactics from the music industry can be harnessed to drive social change. Dive into lively discussions, participate in interactive trivia, and discover practical strategies for making a tangible impact on the world. Each ticket includes a copy of Amplify , ensuring you leave not only inspired but also equipped with the tools to amplify your own advocacy. Don't miss this opportunity to connect with Adam in a setting that promises to be as enlightening as it is entertaining Ticketing Tickets include admission for one and one hardcover copy of Amplify pre-signed by the author. Tickets go on sale Friday, April 18th at 10am ET . Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event. About Amplify A blueprint for boosting activism and building support for the causes you care about using fan-building tactics from the music industry and featuring the voices of today’s most passionate change-makers, from the bassist for AJR and founder of Planet Reimagined. From stadium acts to indie singer-songwriters, musicians have pioneered ways of sparking passion, building awareness, and catalyzing engagement. Now imagine if social movements—from the fight to protect the planet to campaigns promoting global health or LGBTQIA+ rights—had the same fervent support as your favorite artists. Adam Met, climate advocate, educator, and member of the multiplatinum band AJR, gained firsthand experience growing an audience from the ground up as the band progressed from playing in living rooms to selling out arenas. With award-winning journalist Heather Landy, Met shows how to apply fan-building strategies to social movements in exciting, inventive ways. Amplify is a playbook for developing passionate supporters (i.e., fans) utilizing the art and science of engagement, collaboration, and authentic connection, with tactics that will inspire people to carry your message to the world and spur others to act. Amplify ’s innovative tool kit will help you find your voice and maximize your impact in the world of social progress to create the change you want to see. This movement-building manifesto includes cutting-edge research and strategies from today’s most effective organizers, engagers, and thinkers, including extensive interviews with: • Adam Grant (Wharton professor) on embracing disagreement within a movement. • Christiana Figueres (Paris Climate Agreement architect) on finding a path to solutions. • Andrew Yang (former U.S. presidential candidate) on becoming the front person for your ideas. • David Hogg (March for Our Lives co-founder) on the challenges in building a youth-led movement. • Sue Doster (NYC Pride co-chair) on keeping movements nimble and relevant. • Glenn Beck (conservative commentator) on finding common ground. • Jim Gaffigan (comedian) on setting and achieving goals. • Bill Nye (scientist and entertainer) on communication that connects with people. Bio Adam Met, PhD , seamlessly transitions between his roles as a musician, educator, and advocate. As the bassist in the multi-Platinum band AJR, he has played for millions of fans worldwide. He is the co-founder of the climate research and advocacy nonprofit Planet Reimagined and teaches about climate campaigning and policy at Columbia University. Masking Policy Masks are encouraged but not required for this event.",
        "event_link": "https://www.eventbrite.com/e/adam-met-at-first-parish-church-tickets-1329964663109?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Hobbies Seminars"
        ]
    },
    {
        "title": "Allison King with Ken Liu: The Phoenix Pencil Company",
        "date_time": "Starts on Wednesday, June 11 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of The Phoenix Pencil Company with author Allison King, in conversation with Ken Liu. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/allison-king-with-ken-liu-the-phoenix-pencil-company-tickets-1330275462719?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Board Game Speed Dating - High Street Place - Downtown Boston- (Ages 25-39)",
        "date_time": "Monday, June 9 · 7 - 9pm EDT",
        "location": "High Street Place Food Hall 100 High Street Boston, MA 02110 Show map",
        "about": "Searching for a partner can be horrifically painful. But board games are always awesome. So what if you combined board games and finding a partner? Picture this: You sit down for a night of games. A gaming concierge walks you through several games over the course of the night. You play classics you love and discover brand new games you've never heard of, playing each with a different group of fun singles. All while in a great establishment with plenty of delicious options on tap. At the end of the night, you give your gaming concierge a list of the folks you met that you'd like to date and a list of those you met that you'd like to just hang out with as friends. If any two people put down the same name as each other in either column, then your gaming concierge will make sure you get each other's e-mail address and you can coordinate a time to hang out. Best case scenario: You find true love, discover some awesome board games, and make some new friends. Bad case scenario: You accomplish only one of those three things, which is still pretty great. Worst case scenario: There will be alcohol. Before you decide to buy tickets, a few basics we should cover: 1) This event is for men & women, ages 25-39. We also have events for gay men and queer women. And we're hoping to add events to serve even more people in the future! Head over to https://www.quirkevents.com/boston to see what else we have to offer. (If you scroll all the way to the bottom of the page, you'll be able to join our mailing list and get notified about future events. Plus, joining our mailing list gets you 50% off your first ticket purchase!) 2) To stay up-to-date on everything we have going on at Quirk Events, follow us on Instagram here! 3) Refunds are only available to those who cancel with more than 48 hours' notice, in order to make sure we have enough time to find a replacement for you and keep the event well-populated. (Exceptions will be made for emergency situations on a case-by-case basis). After that, we're blowing the money from your ticket sale on something awesome and nonrefundable. 4) If we get to 24 hours before the event and still haven't sold five tickets for each gender, we will cancel the event (and notify you). When we have run this event in the past, tickets have consistently sold very well, so we don't expect this to happen. But we thought we should cover this in case it came up. 5) How many games we have and which ones we use will be based in part on how many people attend, so we can't tell you for sure what we'll have right now. But the goal is for all of them to be fun, light, easy-to-learn games. Selection will include games from both the something-you-have-played-before category and the something-you-haven't-played-before category. The games are also chosen because they often tend to spark conversation and leave room for chatting with new people as you play. All games will be group games, meaning you'll get a chance to meet a handful of people with each new round.",
        "event_link": "https://www.eventbrite.com/e/board-game-speed-dating-high-street-place-downtown-boston-ages-25-39-tickets-1294819021549?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Hobbies Games",
            "#singles",
            "#games",
            "#boardgames",
            "#speeddating",
            "#singles_events",
            "#speed_dating",
            "#board_games",
            "#singles_30s",
            "#singles_20s"
        ]
    },
    {
        "title": "Jennifer Hope Choi with Tiana Clark: The Wanderer's Curse",
        "date_time": "Starts on Wednesday, May 14 · 7pm EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Celebrate the release of The Wanderer's Curse with author Jennifer Hope Choi with Tiana Clark. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. In the event that we reach capacity and have to close RSVPs, there will not be a waiting list. Get your copy! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 6:30PM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed. Livestream! When possible, events are livestreamed. Check out our store YouTube channel for livestream updates. No registration is required for the livestream.",
        "event_link": "https://www.eventbrite.com/e/jennifer-hope-choi-with-tiana-clark-the-wanderers-curse-tickets-1296149049699",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Story Hour! Jamie Michalak: Hazel the Handful",
        "date_time": "Starts on Sunday, May 4 · 10:30am EDT",
        "location": "Brookline Booksmith 279 Harvard Street Brookline, MA 02446 Show map",
        "about": "In person at Brookline Booksmith! Join us for an all-ages storytime to celebrate Hazel the Handful with author Jamie Michalak. Register for the event! RSVP to let us know you're coming! Depending on the volume of responses, an RSVP may be required for entrance to the event. You will also be alerted to important details about the program, including safety requirements, cancellations, and book signing updates. Reserve a book! Books will be available for purchase at the event, but you can ensure that you get a copy by preordering on this page. You can pick your book up after 10AM on the day of the event. Can't make it to the event? Preorder the book here to have it signed, and choose to have it held or shipped from the store! Book orders are processed for pickup or shipping after ticket sales have closed.",
        "event_link": "https://www.eventbrite.com/e/story-hour-jamie-michalak-hazel-the-handful-tickets-1292820674439",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Seminars",
            "Brookline Hobbies Seminars",
            "#author",
            "#bookstore",
            "#booklaunch",
            "#booktalk",
            "#authorevent"
        ]
    },
    {
        "title": "Solo Journaling RPG Night @ SQBG",
        "date_time": "Tuesday, May 13 · 6 - 9pm EDT",
        "location": "Side Quest Books & Games 1 Bow Market Way Suite 32 Somerville, MA 02143 Show map",
        "about": "Join us for a cozy, quiet evening where you can try out the solo journaling RPG of your choice — all materials (and guidance) provided! Games available will include: Anamnesis The Eleventh Beast Tangled Blessings Carved by the Garden To Honour and Obey Auspex ...and more! What's a solo role-playing game? A solo journaling RPG isa type of tabletop role-playing game designed to be played by a single person. It involves using prompts — often drawn from dice, cards, or other random generators — to spark imaginative writing, world-building, or character development through writing. These games prioritize creative expression and narrative exploration. ----- ABOUT THE VENUE Side Quest Books & Games is a woman- and queer-owned fantasy shop for magical books, indie tabletop role-playing games, and nerdy knick-knacks — all centering women and underrepresented creators. The shop is located on the Bow Market balcony. Outside food and drink are welcome. Masks are optional, but please let us know and stay home if you get sick.",
        "event_link": "https://www.eventbrite.com/e/solo-journaling-rpg-night-sqbg-tickets-1323561019639",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Parties",
            "Somerville Hobbies Parties",
            "#creative",
            "#writing",
            "#ttrpg",
            "#sqbg",
            "#solo_rpg",
            "#rpg_night",
            "#solo_journaling"
        ]
    },
    {
        "title": "DIY Effect Building Workshop @ Synthfest",
        "date_time": "Saturday, May 3 · 11am - 3pm EDT",
        "location": "Northeastern University 360 Huntington Avenue Ryder Bldg, Room 431 Boston, MA 02115 Show map",
        "about": "We are hosting two different workshops at NESF.  Build a Theremin in an Altoids tin for on-the-go fun sounds and exprimentation OR Build a Tank Reverb EuroRack module to add thick drippy reverb to your musical creations. We will guide you at every step along the way. The Cram Audio DIY Tank Reverb is an analog circuit that uses an actual spring reverb tank to gives you a lush reverb effect. The module offers control for Mix and Feedback allowing you to tailor the reverb from subtle to overdriven, with many interesting settings along the way, helping you to craft the unique tone required to set your composition apart from the crowd. The Cram Audio DIY Tank Reverb drives the reverb tank via discrete transistors to ensure rich clean reverb tone. The Mix potentiometer helps you to proportion the wet & dry signals and the feedback potentiometer helps to extend the natural decay of the reverb tank - almost to infinity if desired. Learn to build your very own 𝐓𝐡𝐞𝐫𝐞𝐦𝐢𝐧! You'll be experimenting with eerie sci-fi sounds in no time. The Theremin is an electronic musical instrument controlled without physical contact by the performer. It's named after its inventor, Leon Theremin, who patented the device in 1928. The 𝗔𝗹𝘁𝗼𝗶𝗱𝘀 𝗧𝗵𝗲𝗿𝗲𝗺𝗶𝗻 is controlled by of two antennas which function as position sensors. Each antenna forms one half of a capacitor with each of the thereminist's hands as the other half of the capacitor. These antennas capacitively sense the relative position of you hands and control oscillators for frequency with one hand, and volume with the other. The electric signals from the Theremin are sent to an amplifier via a 1/4\" jack. Learn and save. You will solder, assemble components, and customize your very own musical instrument. No prior experience soldering is necessary - bring your creativity and enthusiasm to learn more about effect pedals! Don't miss this opportunity to dive deep into the world of DIY electronics and create a unique and sophisticated effect pedal. If you need help with your circuit, your instructors have 20+ years’ experience building, designing, and troubleshooting analog and digital circuitry. So rest assured that we will get your effect working and get you jamming. Expect this workshop to last 3 – 4 hours. You’ll leave with a working module and a good handful of electronics knowledge. I hope to see you there!",
        "event_link": "https://www.eventbrite.com/e/diy-effect-building-workshop-synthfest-registration-1309785566889",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Hobbies Classes",
            "#eurorack",
            "#reverb",
            "#diyprojects"
        ]
    },
    {
        "title": "Boston Murder Mystery: Solve the case!",
        "date_time": "Sunday, April 27 · 5 - 6:30pm EDT",
        "location": "North Square North Square Boston, MA 02113 Show map",
        "about": "Picture this: You and your friends , armed with just your phones and your courage, become the star detectives for a day in a mysterious murder case. You walk the streets investigating every corner for a clue and you feel the adrenaline rush in your blood as you collect pieces of evidence and get closer to finding the murderer. The story unfolds as you progress , fully immersing you into the scene. The ordinary streets, that you've visited many times, are now your personal universe, where every corner hides a secret and every landmark tells part of the story. WHY SHOULD YOU PLAY THIS❓ 🧠 Mental Stimulation – Exercise your brain with fun puzzles and challenges. 👫 Social Connection – Bond with friends/family through shared problem-solving and create long-lasting memories. 🏙️ Reinvented Discovery – See your city in a whole new way, rediscovering famous landmarks and hidden gems. 🏃‍♂️ Active Adventure – Get outside, explore and do you daily steps while playing. 🕵️ Story Immersion – Lose yourself in a captivating narrative where YOU are the main character . PERFECT FOR ❓ • Friend groups who love games and challenges • Couples who search for unique date ideas • Families who want fun activities to do outside • Work colleagues who need exciting teambuilding experiences • Solo adventurers who are mystery solving enthusiasts HOW DOES IT WORK? This is a role-playing outdoor city game that combines the challenge of an outdoor escape room , the excitement of a scavenger hunt , and the suspense of a murder mystery ! You will play alone ( or with your friends ), guided by the Questo mobile app on your smartphone. 1. Buy your tickets & check the confirmation email 🎫 2. Download the Questo app on your smartphone 📲, login with your email and find the game inside your profile page 🔓. 3. Head outdoors to the Starting L ocation & begin your investigation. The app will guide you all the way.📍",
        "event_link": "https://www.eventbrite.com/e/boston-murder-mystery-solve-the-case-tickets-1319049465459",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Hobbies Games",
            "#friends",
            "#outdoor",
            "#dating",
            "#couples",
            "#teambuilding",
            "#walking",
            "#escape",
            "#scavenger_hunt",
            "#family_friendly",
            "#murder_mystery"
        ]
    },
    {
        "title": "Dungeons and Dragons at Trident Booksellers",
        "date_time": "Monday, April 28 · 6 - 9pm EDT",
        "location": "Trident Booksellers & Cafe 338 Newbury Street Boston, MA 02115 Show map",
        "about": "For Ages 18+ Fight The Exposition presents Dungeons and Dragons (D&D) night at Trident Booksellers & Cafe! Come join us for a night of adventure as we explore the fantastical realm of sword and sorcery, battle epic monsters, and uncover secrets that have been locked away for centuries. Open to all levels of experience, seats are limited so don't miss out on what will be a very exciting night! D&D Beginner's Table We're excited to offer a beginner's table specifically designed for new players! We'll dedicate the beginning of the session going over the rules and mechanics of the game, and we encourage you to ask questions throughout the session. Rotating TTRPGs - Very Good Dogs In Space Now introducing our rotating TTRPG series! In addition to running Dungeons and Dragons, we will be featuring TTRPG systems ran by one of our professional Game Masters. For the months of April and May , join GM Grayson (she/he) in her game of Very Good Dogs In Space, a game based on the The Very Good Dogs of Chernobyl TTRPG system by 9th Level Games. \"The success of Space Colony Pl-95 was unprecedented. People were even encouraged to bring their beloved pets with them. All was well, until the disaster. You are the remnants of those well-loved companions. You are very good dogs, and you are all that stands between this world and utter destruction.\" This game contains elements of horror . You will be playing the part of dogs, and there will be times when you and your companions are in danger. Please be aware that this game may include harm to animals. ********** Media Release Policy By purchasing a ticket and attending our event, you consent to being photographed, filmed, and otherwise recorded. These photos and videos may be used for promotional purposes, including but not limited to social media, website content, and marketing materials. If you have any concerns about being recorded, please inform us before the event. Lateness Policy We understand that sometimes unforeseen circumstances can cause delays. To accommodate this, we offer a 45-minute grace period from the event start time. If you arrive within this window, you will still be seated. If you arrive more than 45 minutes late, it will be at the Dungeon Master's discretion to determine if you can join their table. To ensure you have the best experience, we highly recommend arriving 5-10 minutes before the event start time. Accessibility and Accommodation We strive to make our events inclusive and accessible for everyone. If you have any accessibility needs or accommodations, please let us know by contacting us directly at info@fighttheexposition.com. Refund Policy Fight The Exposition does not offer refunds for requests made within 48 hours of the event start time. If you find that you are unable to attend our event, we recommend reaching out to us as soon as possible. We may be able to assist you in transferring your ticket to an interested customer.",
        "event_link": "https://www.eventbrite.com/e/dungeons-and-dragons-at-trident-booksellers-tickets-1114636681319",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Hobbies Games",
            "#boston",
            "#cambridge",
            "#somerville",
            "#dnd",
            "#tabletop",
            "#tabletopgaming",
            "#dungeons_and_dragons",
            "#trident_booksellers"
        ]
    },
    {
        "title": "Board Game Speed Dating for Gay Men at Club Café",
        "date_time": "Monday, April 28 · 7 - 9pm EDT",
        "location": "Club Café, Columbus Avenue, Boston, MA, USA 209 Columbus Avenue Boston, MA 02116 Show map",
        "about": "Gay Men Board Game Speed Dating at Club Cafe Searching for a partner can be horrifically painful. But board games are always awesome. So what if you combined board games and finding a partner? Picture this: You sit down for a night of games. A gaming concierge walks you through several games over the course of the night. You play classics you love and discover brand new games you've never heard of, playing each with a different group of fun singles. All while in a great establishment with plenty of delicious options on tap. At the end of the night, you give your gaming concierge a list of the folks you met that you'd like to date and a list of those you met that you'd like to just hang out with as friends. If any two people put down the same name as each other in either column, then your gaming concierge will make sure you get each other's e-mail address and you can coordinate a time to hang out. Best case scenario: You find true love, discover some awesome board games, and make some new friends. Bad case scenario: You accomplish only one of those three things, which is still pretty great. Worst case scenario: There will be alcohol. Before you decide to buy tickets, a few basics we should cover: 1) This is an all-inclusive event for men looking to date other men. Non-binary individuals and anyone else who feels like they would be a good fit are encouraged to attend. If you are a woman looking to date another woman, or if you are looking to date someone of the opposite sex, you can find out more about our other speed dating events at www.quirkevents.com/public-events-boston . 2) Refunds are only available to those who cancel with more than 48 hours' notice, in order to make sure we have enough time to find a replacement for you and keep the event well-populated. (Exceptions will be made for emergency situations on a case-by-case basis). After that, we're blowing the money from your ticket sale on something awesome and nonrefundable. 3) If we get to 24 hours before the event and still haven't sold eight tickets, we will cancel the event (and notify you). We think this is very unlikely but wanted to include a note about it in case that happened. 4) How many games we have and which ones we use will be based in part on how many people attend, so we can't tell you for sure what we'll have right now. But the goal is for all of them to be fun, light, easy-to-learn games. Selection will include games from both the something-you-have-played-before category and the something-you-haven't-played-before category. The games are also chosen because they often tend to spark conversation and leave room for chatting with new people as you play. All games will be group games, meaning you'll get a chance to meet a handful of people with each new round. 5) Desperately wish you could attend, but you have plans on this date or the tickets you want are sold out? E-mail hello@quirkevents.com, and we will add you to our please-notify-me-next-time-you-create-an-event mailing list. 6) Follow us here on Instagram to stay up-to-date on all our events around town!",
        "event_link": "https://www.eventbrite.com/e/board-game-speed-dating-for-gay-men-at-club-cafe-tickets-1063430211389",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Hobbies Games",
            "#boston",
            "#beer",
            "#gay",
            "#lgbtq",
            "#men",
            "#speeddating",
            "#boardgame",
            "#gaymer",
            "#boston_events",
            "#clubcafe"
        ]
    },
    {
        "title": "Beginner Sewing - Apron",
        "date_time": "Thursday, May 1 · 5:30 - 7pm EDT",
        "location": "Craft Loft (Cambridge Store) 100 Cambridgeside Place #2nd floor Cambridge, MA 02141 Show map",
        "about": "New to sewing or would like to try your hand at a wearable project? This Apron sewing workshop is the perfect intro to sewing. Learn the basics of using a sewing machine, pattern and make your own stylish apron! The topics covered include: Fundamentals of using a sewing machine How to use a pattern What's seam allowance Right side vs. Wrong side of fabric Overstitch and reverse stitch Choose from a selection of fun fabric prints or bring your own. If you decide to bring your own fabric, please plan for 1.5yards of non-stretchy fabric. Cotton, canvas or flannel should all work well. Avoid anything extra thick or synthetic such as vinyl or faux leather. These will not work with our sewing machines and are also difficult to work with for beginners. Duration : 90min Minimum age : +13yrs (all minors need to be accompanied with an adult for the duration of the workshop) Location: Craft Loft 100 CambridgeSide Pl, 2nd floor near TJ Maxx Cambridge, MA 02141 *Please see our refund/reschedule policy here. Tipping is not expected but always appreciated!",
        "event_link": "https://www.eventbrite.com/e/beginner-sewing-apron-tickets-1256772342909",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Hobbies Classes",
            "#apron",
            "#sewing_class",
            "#sewing_workshop",
            "#beginner_sewing",
            "#sewing_project"
        ]
    }
]