[
    {
        "title": "Let's Go on a Seaside Adventure!",
        "date_time": "N/A",
        "location": "Bar Harbor Inn 1 Newport Drive Bar Harbor, ME 04609 Show map",
        "about": "Come join authors Heidi Chiavaroli, Amanda Dykes, and Melissa Tagg as they embark on a literary excursion to celebrate Maine and you—their readers! Experience lighthouses, quaint inns, breathtaking views, yummy food, hikes, author chats, and free time to read or explore. May 15-20, 2025 We’ll start our journey in historic Boston, where you can take a tour of Beacon Hill with our authors before settling in for a reception at the Omni-Parker Hotel. Our second day, we’ll take to the road for a coastal journey to breathtaking Acadia National Park where we’ll spend three days talking books, exploring nature, eating delicious food, cozying up with campfires, and simply relaxing. We’ll end our time in Portland, enjoying more lighthouses, more history, and more author time. Each part of the trip is customizable—participate in as many or as little of the planned activities as you’d like! We can’t wait to see you! For more information contact: mindelynn@readfarandwide.com",
        "event_link": "https://www.eventbrite.com/e/lets-go-on-a-seaside-adventure-tickets-1074880830499?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Retreats",
            "Boston Travel & Outdoor Retreats",
            "#maine",
            "#literature",
            "#lighthouse",
            "#acadia",
            "#readers_retreat",
            "#coastal_excursion",
            "#seaside_adventure",
            "#literary_travel"
        ]
    },
    {
        "title": "NEMBA Adventure Series - The Fells Opener",
        "date_time": "Sunday, June 1 · 9am - 3pm EDT",
        "location": "300 Elm St 300 Elm Street Medford, MA 02155 Show map",
        "about": "Overview Kickoff your mountain biking season in the Fells! Join Greater Boston NEMBA and the Massachusetts Department of Conservation and Recreation for an epic day of riding and good vibes! We'll have vendors, local bike shops, raffle, guided and self-paced rides, family rides, food, and fun at our Middlesex Fells fundraiser season opener! The Adventure Series is grateful for the generous support from our sponsor Conte's Bike Shop!",
        "event_link": "https://www.eventbrite.com/e/nemba-adventure-series-the-fells-opener-tickets-1224371400819?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Medford, MA",
            "Medford Races",
            "Medford Travel & Outdoor Races",
            "#biking",
            "#template",
            "#nemba",
            "#outdoor_activity",
            "#event_name",
            "#nemba_adventure_series"
        ]
    },
    {
        "title": "Mount Auburn Cemetery Bird Walk with Peter Alden - May 10th",
        "date_time": "Saturday, May 10 · 8 - 10:30am EDT",
        "location": "Mt Auburn Cemetery 580 Mt Auburn St Cambridge, MA 02138 Show map",
        "about": "Mt. Auburn Cemetery in Watertown is well-known for the many species of migrating birds that visit this attractive habitat found in a densely populated urban area. Warblers are the main attraction along with migrating thrushes and orioles. Join us for a morning of colorful spring foliage, warbler watching, and other birding discoveries! Location : Arrive at the entrance to the Mt Auburn Cemetery located at 580 Mt Auburn St., Cambridge. Parking : There is limited parking at Mt Auburn Cemetery. You can drive through the Cemetery and may park on any roads without a green line. More info . What to bring: binoculars, camera, warm clothes (if necessary), water bottle. NOTE about registration: Please register as soon as possible as the event is limited to 18 participants.",
        "event_link": "https://www.eventbrite.com/e/mount-auburn-cemetery-bird-walk-with-peter-alden-may-10th-registration-1329647805379?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Travel & Outdoor Networking",
            "#birds",
            "#birdwatching",
            "#birdingevent"
        ]
    },
    {
        "title": "BIRD SURVEY WALK IN MATTAPAN ALONG THE NEPONSET",
        "date_time": "Saturday, May 3 · 8:30 - 10am EDT",
        "location": "Mattapan 1674 Blue Hill Ave Boston, MA 02126 Show map",
        "about": "Come join us for a bird walk along Neponset River Greenway and green spaces in Mattapan along Boston’s southern border. This walk is MBTA accessible! Offered in partnership with the Brookline Bird Club and Walking City Trail. FREE! BEGINNERS WELCOME! LINK",
        "event_link": "https://www.eventbrite.com/e/bird-survey-walk-in-mattapan-along-the-neponset-tickets-1312107702459?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Travel & Outdoor Other",
            "#event",
            "#nature",
            "#conservation",
            "#wildlife",
            "#birdwatching",
            "#birding",
            "#greenspaces"
        ]
    },
    {
        "title": "Celebrate Native Plants at the Loring Greenough House!",
        "date_time": "Saturday, May 10 · 1 - 3pm EDT",
        "location": "Loring Greenough House 12 South Street Boston, MA 02130 Show map",
        "about": "The Loring-Greenough House will celebrate the completion of our Native Plant Border at an unveiling in May. Join us to tour the garden, support the project by 'sponsoring' a plant, and learn about the benefits of Native Plants! The bed along the south-facing border contains a robust variety of plants that are native to the eastern half of the US, bringing color, visual interest, and seasonal changes to an existing plant bed. Mostly shade-loving, this mix of perennials and shrubs, along with evergreen trees for screening, will help the public identify and become more familiar with native plants that play an important ecological role in our community. Native plants are beneficial because they are low-maintenance, require less water, and provide habitat for birds and beneficial insects. Bleeding Heart, Jacob's Ladder, and Goldenrod are just a few of the many perennials that will greet all creatures, great and small, throughout the seasons. Recently added to the border are a few trees - the beautiful Fringe tree and three Arborvitaes. Among the shrubs are Aronia, Clethra and Sweetspire. Join us on May 10th from 1:00 to 3:00 for our garden opening which includes a presentation by Shoma Haque in the parlor followed by refreshments and a tour of the native border. Join us at this celebration by buying a ticket for $10 or by sponsoring a plant! $25* Sponsors a Perennial | $50* Sponsors a Shrub | $100* Sponsors a Tree *plus donation processing fee (Both options are accessible under the \"select tickets\" button on the right.)",
        "event_link": "https://www.eventbrite.com/e/celebrate-native-plants-at-the-loring-greenough-house-tickets-1290310135349?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Festivals",
            "Boston Travel & Outdoor Festivals",
            "#boston",
            "#event",
            "#celebrate",
            "#native_plants",
            "#loring_greenough_house"
        ]
    },
    {
        "title": "Birding 101 at Mount Auburn Cemetery with the Brookline Bird Club",
        "date_time": "Wednesday, May 21 · 7 - 8:30am EDT",
        "location": "Mount Auburn Cemetery 580 Mount Auburn Street Cambridge, MA 02138 Show map",
        "about": "Cambridge's Mount Auburn Cemetery in May is often astonishing—not just for the variety of birds and the eye-popping rarities, but also for the sheer numbers of migrating warblers. This walk is designed for never-before birders, beginners, birders who just getting started and birders looking to hone their listening skills and ability to pick a Tennessee Warbler out of the canopy. We'll keep it small so you can ask questions! We're exciting to be partnering with the Brookline Bird Club for this one! Spaces limited. You must register in advance. Full details on our website .",
        "event_link": "https://www.eventbrite.com/e/birding-101-at-mount-auburn-cemetery-with-the-brookline-bird-club-tickets-1291292082379?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Other",
            "Cambridge Travel & Outdoor Other",
            "#event",
            "#nature",
            "#conservation",
            "#wildlife",
            "#birdwatching",
            "#birding",
            "#greenspaces"
        ]
    },
    {
        "title": "Conspiracy Scavenger Hunt in Boston",
        "date_time": "Sunday, April 27 · 11am - 12:30pm EDT",
        "location": "North Square North Square Boston, MA 02113 Show map",
        "about": "🧩 Get ready for possibly the most exciting outdoor scavenger hunt you'll ever experience! Step in the shoes of the assistent of a real detective and try to stop a powerful secret group from taking over the world. Work together with the Detective to find hidden clues scattered in the most iconic spots in your city , decipher encripted messages and piece together the evidence to reveal the secret plans of the Kingmakers and save the humanity. This isn't your typical scavenger hunt - it's half detective story , half puzzle adventure , and 100% fun . Bring your friends and see if you can work together without suspecting each other! WHAT MAKES IT SPECIAL❓ 🔎 Search for hidden clues through some of Boston 's most iconic spots . 🦹‍♂️ Piece together the evidence to unfold the story as you go. 🧠 Challenge your brain by solving puzzles that make you feel like a real detective. 👥 C hallenge your friends to see who's the smartest in your group ( we all know it's you ). 🎓 Learn fun facts about the biggest secret societies from around the world. 📷 Capture fun & long-lasting memories and share them with everyone directly from the app.",
        "event_link": "https://www.eventbrite.com/e/conspiracy-scavenger-hunt-in-boston-tickets-1308046635699?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#weekend",
            "#outdoor",
            "#competition",
            "#couples",
            "#walking",
            "#datenight",
            "#explore",
            "#escape",
            "#scavenger_hunt",
            "#family_friendly"
        ]
    },
    {
        "title": "Fenway Group Tour",
        "date_time": "Friday, June 13 · 2:30 - 3:30pm EDT",
        "location": "Boston Red Sox 4 Jersey Street Boston, MA 02215 Show map",
        "about": "Fenway Group Tour Join us for an exciting group tour at the iconic Boston Red Sox stadium! Get an exclusive behind-the-scenes look at one of the oldest ballparks in the country. Walk through the historic Fenway Park and learn about its rich history and legendary moments. This in-person event is perfect for sports fans and history buffs alike. Don't miss this unique opportunity to experience the magic of Fenway up close and personal!  No refunds after May 27th, 2025 since I have to make payment to the park.",
        "event_link": "https://www.eventbrite.com/e/fenway-group-tour-tickets-1267568685059?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Travel & Outdoor Tours",
            "#tour",
            "#boston",
            "#event",
            "#group",
            "#fenway"
        ]
    },
    {
        "title": "Beginner Listening (with and without Merlin) at Halls Pond",
        "date_time": "Wednesday, May 14 · 6:30 - 8am EDT",
        "location": "Halls Pond https: 3 Armory Street Brookline, MA 02446 Show map",
        "about": "Merlin can only get you so far. (But we'll show you some tweaks). Join us for a short pre-work slow walk around a small pond in Brookline for some close listening to bird song. Designed for people who are just getting started with songs and often feel confused (we totally get that). What's going on? Let's listen in. Free. Binoculars available.",
        "event_link": "https://www.eventbrite.com/e/beginner-listening-with-and-without-merlin-at-halls-pond-tickets-1312165876459?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Brookline, MA",
            "Brookline Other",
            "Brookline Travel & Outdoor Other",
            "#event",
            "#nature",
            "#birdwatching",
            "#birding",
            "#hull",
            "#hullabaloo",
            "#winter_birding"
        ]
    },
    {
        "title": "July 4th Sailabration on Boston's Charles River Esplanade",
        "date_time": "Friday, July 4 · 7 - 11:30pm EDT",
        "location": "Community Boating, Inc. 21 David G Mugar Way Boston, MA 02114 Show map",
        "about": "The Best Seat in Boston for the 4th of July! Escape the crowds on the Esplanade while still soaking in the electric atmosphere, breathtaking fireworks, and world-famous Boston Pops performance. Inside our gates, you’ll find a fun, festive, and family-friendly celebration with all the perks: Unobstructed waterfront seating under the fireworks Live DJ and a simulcast of the Boston Pops concert Three massive inflatable  Jumbotrons for the best concert views Ben & Jerry’s Ice Cream Unlimited Polar Beverages (water & seltzer) DJ, Face painting, & a photobooth Families and friends of all ages love our safe and comfortable setting, away from the overwhelming crowds but still in the heart of the action. Bring your own non-alcoholic drinks and snacks, relax, and enjoy an unforgettable Boston 4th of July experience! Location: Community Boating Boathouse, Esplanade – between the Hatch Shell and the Longfellow Bridge, next to the Charles Circle footbridge.",
        "event_link": "https://www.eventbrite.com/e/july-4th-sailabration-on-bostons-charles-river-esplanade-tickets-1302164020639?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Travel & Outdoor Parties",
            "#boston",
            "#fireworks",
            "#july4th",
            "#esplanade",
            "#charles_river",
            "#sailabration"
        ]
    },
    {
        "title": "Revolutionary Trails & Chowder Tales Audio Tour",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "24 Beacon St 24 Beacon Street Boston, MA 02108 Show map",
        "about": "Are you ready to embark on a wicked awesome audio tour through the historic streets of Boston? Join us for the most thrilling adventure in town! Get your team together and prepare to solve clues, uncover hidden gems, and explore iconic landmarks throughout this vibrant neighborhood. Whether you're a local or just visiting, our Boston walking tour guarantees a fun-filled day filled with laughter, excitement, and unforgettable memories. On this epic quest, you'll have the chance to discover the secrets of the Massachusetts State House, marvel at the beauty of King's Chapel, and immerse yourself in history at Old South Meeting House. But that's not all! You'll also visit Park Street Church, The Paul Revere House, Old North Church, and Faneuil Hall Marketplace. Each location holds its own unique story and charm that will leave you in awe of this incredible city. So grab your friends or family members and get ready for an adventure like no other. Some of what you'll see: Kings Chapel, Massachusetts State House, Faneuil Hall Marketplace Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com/",
        "event_link": "https://www.eventbrite.com/e/revolutionary-trails-chowder-tales-audio-tour-tickets-1313207582229?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Travel & Outdoor Tours",
            "#adventure",
            "#explore",
            "#audiotour",
            "#hiddengems",
            "#weekendfun",
            "#localhistory",
            "#selfguided",
            "#holidayhunt",
            "#mysteryhunt",
            "#cluehunt"
        ]
    },
    {
        "title": "The President's Conspiracy in Boston",
        "date_time": "Sunday, April 27 · 10 - 11:30am EDT",
        "location": "North Square North Square Boston, MA 02113 Show map",
        "about": "🤫 \"The President's Conspiracy\" unveils in a covert world where you are tasked with exposing The Kingmakers— a secret society that manipulated your president and other world leaders from the shadows and orchestrated global events for centuries. A whistleblower has come forward with alarming information, thrusting you into a high-stakes game of deceit. Your mission is to stay one step ahead , decode the secrets , and unmask the conspiracy before their next grand scheme is unleashed. Will you be the one to expose the truth and save the world from an invisible tyranny? WHAT WILL YOU DO❓ 🦹‍♂️ Piece together a Global Conspiracy while exploring the most iconic spots in your city. 🧠 Challenge your intellect by dissecting the web of lies and decoding cryptic messages to reveal the secret society's hidden agenda. 🌐 Engage in high-stakes d ecisions that can shape the future of the entire world. 👥 C hallenge your lover or your friends to a real roller-coaster of emotions: from skepticism to awe, from suspicions to real facts, from \"nah, there is no way\" to \"wow, that's actually crazy\" . 📁_.._._.._-.._. .. 📁",
        "event_link": "https://www.eventbrite.com/e/the-presidents-conspiracy-in-boston-tickets-1300545810529?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#outdoor",
            "#competition",
            "#couples",
            "#walking",
            "#datenight",
            "#explore",
            "#escape",
            "#scavenger_hunt",
            "#family_friendly",
            "#selfguided"
        ]
    },
    {
        "title": "Overnight Backpacking Trip for Ages 11-15",
        "date_time": "Starts on Saturday, June 7 · 9am EDT",
        "location": "Russell Commons 78-92 Chestnut St Arlington, MA 02474 Show map",
        "about": "Join Tim Swanson of Owl Eyes Wilderness Survival and Dave Fatula of Guineafowl Adventure Company in this camping and backpacking experience. Students will learn the basics of overnight backpacking in the wilderness. Topics will include how to plan a trip, emergency response plans, how to pack a backpack, set up a campsite, camp cooking, route planning, and more.  Depending on group ability and interest, we may summit a mountain, explore a waterfall, stay at camp to learn skills, swim, and/or fish. The hike will require hiking up to 5 miles or more on varied elevation and terrain each day and students are required to bring most of their own gear, however, some gear is available to rent. Guineafowl Adventure Company has tents, backpacks, sleeping pads, and sleeping bags available should students need to borrow anything for the trip. Food will be provided, please inform us of any dietary restrictions, preferences, or allergies. A shuttle service will be available from Arlington, MA to the Lincoln Woods Trailhead in the White Mountains of New Hampshire. You may meet us in Arlington to drop your child off, or bring them straight to the trailhead. We will make sure everyone has the right gear before we head out on our hike. A detailed gear list will be sent to students before the trip. This is an overnight trip in the backcountry with highly trained instructors who spend a lot of their days in the wilderness. We are excited to be offering this as a course, and try to be accomodating to everyone. We ask that you are realistic in the expectations with your child in regards to physical ability, homesickness, and getting alot with other people their age. Each individual impacts the group dynamic and there is a certain expectation that everyone will respect eachother and be able to make it to the campsite. We act as a group on backcountry trips and never leave anyone behind, however we have a plan and must make it to the campsite for the night. If there are any questions or concerns, please reach out to us. This trip will start Saturday morning and end Sunday evening. Exact times will be communicated before the expedition. This course is open to students ages 11-15.",
        "event_link": "https://www.eventbrite.com/e/overnight-backpacking-trip-for-ages-11-15-tickets-1138438493179?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Arlington, MA",
            "Arlington Retreats",
            "Arlington Travel & Outdoor Retreats",
            "#kids",
            "#camping",
            "#hiking",
            "#backpacking",
            "#mountains",
            "#teens",
            "#outdoor_adventure",
            "#white_mountains",
            "#overnight_trip",
            "#camping_experience"
        ]
    },
    {
        "title": "Epic Zombie Survival Scavenger Hunt in Boston by Zombie Scavengers",
        "date_time": "Starts on Sunday, April 27 · 9am EDT",
        "location": "1 Faneuil Hall Sq 1 Faneuil Hall Square Boston, MA 02109 Show map",
        "about": "Ready to survive? Zombie Scavengers plunges participants into a high-stakes, app-powered scavenger hunt, transforming familiar Boston city streets into a virtual, thrilling, post-apocalyptic battleground. Teams embark on a mission to survive by using their smartphone to navigate the city that is virtually turned into a post-apocalyptic wasteland. Teams must complete tricky challenges, solve riddles, and gather (take photos of) essential supplies to stave off the virtual undead horde roaming the city. Each mission the teams complete will earn them points on the app’s leaderboard where they can see how they have done compared to other surivival teams. Players must communicate and strategize as they work together to find essential items around the city that they need to survive. Zombie Scavengers is a dynamic and engaging activity that tests problem-solving skills, teamwork, and a healthy dose of survival instinct, making it a unique and memorable adventure through the streets of Boston.  Zombie Scavengers is priced per team. You can have up to 10 players per team. Each ticket gives one team access to participate in Zombie Scavengers.  After ticket purchase, Zombie Scavengers requires a redemption made on the website. Redemption can be made at https://www.zombiescavengers.com/reservations In addition to the Boston scavenger hunt, Zombie Scavengers has over 400 locations all over North America. Participants can choose where they’d like to participate when they redeem their ticket on the website. See locations at https://www.zombiescavengers.com/locations .  Locations include most major cities in the US & Canada.",
        "event_link": "https://www.eventbrite.com/e/epic-zombie-survival-scavenger-hunt-in-boston-by-zombie-scavengers-tickets-1332417138529?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#tour",
            "#activity",
            "#thingstodo",
            "#activities",
            "#tours",
            "#hunt",
            "#scavenger",
            "#scavengerhunt",
            "#things_to_do",
            "#family_friendly"
        ]
    },
    {
        "title": "Wonderful Winthrop Amazing Race & Tour",
        "date_time": "Sunday, April 27 · 11am - 1pm EDT",
        "location": "Adriana 19 Main Street Winthrop, MA 02152 Show map",
        "about": "Your creative, nontraditional scavenger hunt begins at a scenic spot that's a local favorite. You'll get your digital quest from your live and interactive remote host. Then you’ll take off on your own to experience a wide variety of carefully curated locations in town. You'll walk or drive to the various checkpoints as you interpret creative tasks, accept wacky challenges, and get outside your comfort zone! ONE TICKET PER PERSON. Both family and dog friendly, the game alternates between the indoors and outdoors, with plenty of bonus challenges too! You'll text photos and videos to your remote host, who cheers you on and assists, as you play - to document your progress. You can even interact with the locals to interpret the creative challenges. You won’t be able to avoid having fun, uncovering hidden gems and local secrets, making memories, laughing, and learning along the way! You’ll be part of the rich culture of this dynamic city! Every turn is full of surprises, so questions in advance are welcomed. Check out all 500 of our city hunts! Great for corporate groups, tourists, curious locals, bachelors(ettes), birthdays, families, friend trips, and other special groups! Ask us about our custom-designed experiences and virtual team builders too!",
        "event_link": "https://www.eventbrite.com/e/wonderful-winthrop-amazing-race-tour-tickets-1083405327499?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Winthrop Town, MA",
            "Winthrop Town Races",
            "Winthrop Town Travel & Outdoor Races",
            "#tour",
            "#adventure",
            "#challenge",
            "#amazing_race",
            "#wonderful_winthrop"
        ]
    },
    {
        "title": "Supreme Island x Sabor Saturday(Elite Affairs)",
        "date_time": "April 26 · 10pm - April 27 · 2am EDT",
        "location": "Icon Nightclub 100 Warrenton Street Boston, MA 02116 Show map",
        "about": "Supreme Island X Sabor Saturday (Elite Affairs) Prepare for a night at Icon Nightclub, Boston’s premier reggae, dancehall, Afrobeats, and hip-hop destination! Immerse yourself in island vibes as top DJs bring the hottest sounds to keep you moving all night. RSVP to secure your spot, and for those seeking an exclusive experience, VIP tables offer the ultimate party upgrade—skip the line, enjoy premium bottle service, and elevate your night with us at Icon! Don’t miss out— Supreme Island is where Boston comes alive every Saturday! MUSIC BY IMPERIAL X NIIC X HILLS VIP/FMI/BDAY TEXT 781.597.9889",
        "event_link": "https://www.eventbrite.com/e/supreme-island-x-sabor-saturdayelite-affairs-tickets-1267818592539?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Travel & Outdoor Parties",
            "#exclusive_event",
            "#vip_guests",
            "#luxury_experience",
            "#supreme_island",
            "#elite_affairs"
        ]
    },
    {
        "title": "Spring Has Sprung",
        "date_time": "N/A",
        "location": "N/A",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/spring-has-sprung-tickets-1304112859669?aff=ebdssbdestsearch",
        "tags": []
    },
    {
        "title": "Intro to Outdoor Top Rope Malden, MA",
        "date_time": "Saturday, May 3 · 10am - 2pm EDT",
        "location": "Waitts Mount Park Waitts Mount Park Malden, MA 02148 Show map",
        "about": "Intro to Outdoor Top Rope Malden, MA Saturday, May 3rd 10am-2pm Rain Date: Sunday, 5/4/25 Same Time $65 Rentals Included ​ Waitts Mount Park, Malden, MA ​ Ready to take your gym climbing skills outside? Join the Wellness Blueprint community at Malden’s Waitts Park. This four-hour session will be led by AMGA-certified Single Pitch Instructor Madi Scott. During this event, you will learn how to set up and climb your own top-rope routes on bolted anchors. Skill-building meets play and this workshop will give you lifelong tools for your climbing arsenal.",
        "event_link": "https://www.eventbrite.com/e/intro-to-outdoor-top-rope-malden-ma-tickets-1326111357769?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Malden, MA",
            "Malden Classes",
            "Malden Travel & Outdoor Classes",
            "#outdoors",
            "#climbing",
            "#beginner",
            "#malden_ma",
            "#intro_to_outdoor_top_rope"
        ]
    },
    {
        "title": "Awesome Scavenger Hunt - Cobblestone Capers: A North End Adventure in Time",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "221-223 Endicott St 221-223 Endicott Street Boston, MA 02113 Show map",
        "about": "Get ready to put your thinking caps on (and maybe your detective hats, if you're feeling fancy!) as you crack codes, solve riddles, and unearth the North End's fascinating secrets. Don't worry, laughter is built-in with our witty and informative clues. Plus, there's plenty of time to refuel with cannoli and pasta at local favorites along the way. So grab your crew, ditch the tourist traps, and get ready to unmask the mysteries of the North End in the most unforgettable way possible! Tickets are going fast, so don't miss out on this epic adventure. Some of what you'll see: The Boston Stone, Boston Historic North End Sign, Copps Hill Terrace Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com",
        "event_link": "https://www.eventbrite.com/e/awesome-scavenger-hunt-cobblestone-capers-a-north-end-adventure-in-time-tickets-1093725605729?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#adventure",
            "#teambuilding",
            "#outdooradventure",
            "#scavenger_hunt",
            "#photohunt",
            "#selfguided",
            "#puzzlehunt",
            "#mysteryhunt",
            "#cluehunt",
            "#cityhunt"
        ]
    },
    {
        "title": "GBNEMBA - Wednesday Middlesex Fells RIDE",
        "date_time": "Wednesday, May 14 · 6 - 8pm EDT",
        "location": "Flynn Rink 300 Elm Street Medford, MA 02155 Show map",
        "about": "Ride pace will have variations. Overtime you will learn the style/pace of each ride guide. Work your way up in speed over time and start on a slower paced ride than your instinct for your 1st group ride. Open to NEMBA members & non-members. 18+ and no dogs please",
        "event_link": "https://www.eventbrite.com/e/gbnemba-wednesday-middlesex-fells-ride-tickets-1269684443349?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Medford, MA",
            "Medford Races",
            "Medford Travel & Outdoor Races",
            "#recurring",
            "#template",
            "#outdoor_activity",
            "#bike_ride",
            "#group_ride"
        ]
    },
    {
        "title": "Let's Go on a Seaside Adventure!",
        "date_time": "N/A",
        "location": "Bar Harbor Inn 1 Newport Drive Bar Harbor, ME 04609 Show map",
        "about": "Come join authors Heidi Chiavaroli, Amanda Dykes, and Melissa Tagg as they embark on a literary excursion to celebrate Maine and you—their readers! Experience lighthouses, quaint inns, breathtaking views, yummy food, hikes, author chats, and free time to read or explore. May 15-20, 2025 We’ll start our journey in historic Boston, where you can take a tour of Beacon Hill with our authors before settling in for a reception at the Omni-Parker Hotel. Our second day, we’ll take to the road for a coastal journey to breathtaking Acadia National Park where we’ll spend three days talking books, exploring nature, eating delicious food, cozying up with campfires, and simply relaxing. We’ll end our time in Portland, enjoying more lighthouses, more history, and more author time. Each part of the trip is customizable—participate in as many or as little of the planned activities as you’d like! We can’t wait to see you! For more information contact: mindelynn@readfarandwide.com",
        "event_link": "https://www.eventbrite.com/e/lets-go-on-a-seaside-adventure-tickets-1074880830499",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Retreats",
            "Boston Travel & Outdoor Retreats",
            "#maine",
            "#literature",
            "#lighthouse",
            "#acadia",
            "#readers_retreat",
            "#coastal_excursion",
            "#seaside_adventure",
            "#literary_travel"
        ]
    },
    {
        "title": "NEMBA Adventure Series - The Fells Opener",
        "date_time": "Sunday, June 1 · 9am - 3pm EDT",
        "location": "300 Elm St 300 Elm Street Medford, MA 02155 Show map",
        "about": "Overview Kickoff your mountain biking season in the Fells! Join Greater Boston NEMBA and the Massachusetts Department of Conservation and Recreation for an epic day of riding and good vibes! We'll have vendors, local bike shops, raffle, guided and self-paced rides, family rides, food, and fun at our Middlesex Fells fundraiser season opener! The Adventure Series is grateful for the generous support from our sponsor Conte's Bike Shop!",
        "event_link": "https://www.eventbrite.com/e/nemba-adventure-series-the-fells-opener-tickets-1224371400819",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Medford, MA",
            "Medford Races",
            "Medford Travel & Outdoor Races",
            "#biking",
            "#template",
            "#nemba",
            "#outdoor_activity",
            "#event_name",
            "#nemba_adventure_series"
        ]
    },
    {
        "title": "Mount Auburn Cemetery Bird Walk with Peter Alden - May 10th",
        "date_time": "Saturday, May 10 · 8 - 10:30am EDT",
        "location": "Mt Auburn Cemetery 580 Mt Auburn St Cambridge, MA 02138 Show map",
        "about": "Mt. Auburn Cemetery in Watertown is well-known for the many species of migrating birds that visit this attractive habitat found in a densely populated urban area. Warblers are the main attraction along with migrating thrushes and orioles. Join us for a morning of colorful spring foliage, warbler watching, and other birding discoveries! Location : Arrive at the entrance to the Mt Auburn Cemetery located at 580 Mt Auburn St., Cambridge. Parking : There is limited parking at Mt Auburn Cemetery. You can drive through the Cemetery and may park on any roads without a green line. More info . What to bring: binoculars, camera, warm clothes (if necessary), water bottle. NOTE about registration: Please register as soon as possible as the event is limited to 18 participants.",
        "event_link": "https://www.eventbrite.com/e/mount-auburn-cemetery-bird-walk-with-peter-alden-may-10th-registration-1329647805379",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Travel & Outdoor Networking",
            "#birds",
            "#birdwatching",
            "#birdingevent"
        ]
    },
    {
        "title": "BIRD SURVEY WALK IN MATTAPAN ALONG THE NEPONSET",
        "date_time": "Saturday, May 3 · 8:30 - 10am EDT",
        "location": "Mattapan 1674 Blue Hill Ave Boston, MA 02126 Show map",
        "about": "Come join us for a bird walk along Neponset River Greenway and green spaces in Mattapan along Boston’s southern border. This walk is MBTA accessible! Offered in partnership with the Brookline Bird Club and Walking City Trail. FREE! BEGINNERS WELCOME! LINK",
        "event_link": "https://www.eventbrite.com/e/bird-survey-walk-in-mattapan-along-the-neponset-tickets-1312107702459",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Travel & Outdoor Other",
            "#event",
            "#nature",
            "#conservation",
            "#wildlife",
            "#birdwatching",
            "#birding",
            "#greenspaces"
        ]
    },
    {
        "title": "The President's Conspiracy in Boston",
        "date_time": "Sunday, April 27 · 10 - 11:30am EDT",
        "location": "North Square North Square Boston, MA 02113 Show map",
        "about": "🤫 \"The President's Conspiracy\" unveils in a covert world where you are tasked with exposing The Kingmakers— a secret society that manipulated your president and other world leaders from the shadows and orchestrated global events for centuries. A whistleblower has come forward with alarming information, thrusting you into a high-stakes game of deceit. Your mission is to stay one step ahead , decode the secrets , and unmask the conspiracy before their next grand scheme is unleashed. Will you be the one to expose the truth and save the world from an invisible tyranny? WHAT WILL YOU DO❓ 🦹‍♂️ Piece together a Global Conspiracy while exploring the most iconic spots in your city. 🧠 Challenge your intellect by dissecting the web of lies and decoding cryptic messages to reveal the secret society's hidden agenda. 🌐 Engage in high-stakes d ecisions that can shape the future of the entire world. 👥 C hallenge your lover or your friends to a real roller-coaster of emotions: from skepticism to awe, from suspicions to real facts, from \"nah, there is no way\" to \"wow, that's actually crazy\" . 📁_.._._.._-.._. .. 📁",
        "event_link": "https://www.eventbrite.com/e/the-presidents-conspiracy-in-boston-tickets-1300545810529",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#outdoor",
            "#competition",
            "#couples",
            "#walking",
            "#datenight",
            "#explore",
            "#escape",
            "#scavenger_hunt",
            "#family_friendly",
            "#selfguided"
        ]
    },
    {
        "title": "Supreme Island x Sabor Saturday(Elite Affairs)",
        "date_time": "April 26 · 10pm - April 27 · 2am EDT",
        "location": "Icon Nightclub 100 Warrenton Street Boston, MA 02116 Show map",
        "about": "Supreme Island X Sabor Saturday (Elite Affairs) Prepare for a night at Icon Nightclub, Boston’s premier reggae, dancehall, Afrobeats, and hip-hop destination! Immerse yourself in island vibes as top DJs bring the hottest sounds to keep you moving all night. RSVP to secure your spot, and for those seeking an exclusive experience, VIP tables offer the ultimate party upgrade—skip the line, enjoy premium bottle service, and elevate your night with us at Icon! Don’t miss out— Supreme Island is where Boston comes alive every Saturday! MUSIC BY IMPERIAL X NIIC X HILLS VIP/FMI/BDAY TEXT 781.597.9889",
        "event_link": "https://www.eventbrite.com/e/supreme-island-x-sabor-saturdayelite-affairs-tickets-1267818592539",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Travel & Outdoor Parties",
            "#exclusive_event",
            "#vip_guests",
            "#luxury_experience",
            "#supreme_island",
            "#elite_affairs"
        ]
    },
    {
        "title": "Revolutionary Trails & Chowder Tales Audio Tour",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "24 Beacon St 24 Beacon Street Boston, MA 02108 Show map",
        "about": "Are you ready to embark on a wicked awesome audio tour through the historic streets of Boston? Join us for the most thrilling adventure in town! Get your team together and prepare to solve clues, uncover hidden gems, and explore iconic landmarks throughout this vibrant neighborhood. Whether you're a local or just visiting, our Boston walking tour guarantees a fun-filled day filled with laughter, excitement, and unforgettable memories. On this epic quest, you'll have the chance to discover the secrets of the Massachusetts State House, marvel at the beauty of King's Chapel, and immerse yourself in history at Old South Meeting House. But that's not all! You'll also visit Park Street Church, The Paul Revere House, Old North Church, and Faneuil Hall Marketplace. Each location holds its own unique story and charm that will leave you in awe of this incredible city. So grab your friends or family members and get ready for an adventure like no other. Some of what you'll see: Kings Chapel, Massachusetts State House, Faneuil Hall Marketplace Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com/",
        "event_link": "https://www.eventbrite.com/e/revolutionary-trails-chowder-tales-audio-tour-tickets-1313207582229",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Travel & Outdoor Tours",
            "#adventure",
            "#explore",
            "#audiotour",
            "#hiddengems",
            "#weekendfun",
            "#localhistory",
            "#selfguided",
            "#holidayhunt",
            "#mysteryhunt",
            "#cluehunt"
        ]
    },
    {
        "title": "Awesome Scavenger Hunt - Cobblestone Capers: A North End Adventure in Time",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "221-223 Endicott St 221-223 Endicott Street Boston, MA 02113 Show map",
        "about": "Get ready to put your thinking caps on (and maybe your detective hats, if you're feeling fancy!) as you crack codes, solve riddles, and unearth the North End's fascinating secrets. Don't worry, laughter is built-in with our witty and informative clues. Plus, there's plenty of time to refuel with cannoli and pasta at local favorites along the way. So grab your crew, ditch the tourist traps, and get ready to unmask the mysteries of the North End in the most unforgettable way possible! Tickets are going fast, so don't miss out on this epic adventure. Some of what you'll see: The Boston Stone, Boston Historic North End Sign, Copps Hill Terrace Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com",
        "event_link": "https://www.eventbrite.com/e/awesome-scavenger-hunt-cobblestone-capers-a-north-end-adventure-in-time-tickets-1093725605729",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#adventure",
            "#teambuilding",
            "#outdooradventure",
            "#scavenger_hunt",
            "#photohunt",
            "#selfguided",
            "#puzzlehunt",
            "#mysteryhunt",
            "#cluehunt",
            "#cityhunt"
        ]
    },
    {
        "title": "Boston Murder Mystery: Death in the Shadows",
        "date_time": "Sunday, April 27 · 10 - 11:30am EDT",
        "location": "North Square North Square Boston, MA 02113 Show map",
        "about": "Highlights 🕵️‍♂️ Investigate a Chilling Mystery – Step into the shoes of a detective and uncover the truth behind Bella's murder. 🧩 Solve Puzzles & Follow Clues – Explore Boston’s historic streets, decipher hidden messages, and piece together the evidence. 🔎 Uncover a Deadly Secret – Explore famous landmarks and hidden corners as you piece together the truth behind Bella’s murder. 💀 Perfect for Date Night… Or a Killer Group Activity – Play with your partner, a group of friends, or even solo—just don’t end up the next victim! Storyline –❤️💀 Love in the Time of Murder You know the old saying, “The boyfriend did it” ? On an ill-fated night, love goes terribly wrong for Bella Wanderlust and Walter Bridges. Bella, a famous travel blogger, was found dead during a ghost tour led by the theatrical Percy Shadows . Now, it’s up to you to uncover the truth. Was it Walter, the obsessed boyfriend? Percy, the ghost tour guide with a flair for the dramatic? Or is someone else hiding in the shadows? 🔎 Gather clues, interrogate suspects, and expose the real murderer before they strike again. HOW IT WORKS Join the 20,000+ thrill-seekers who’ve ditched dinner and a movie for a night of mystery and intrigue! 🔎💀 Step into a real-life crime scene with an experience that combines the challenge of an outdoor escape room, the excitement of a scavenger hunt, and the suspense of a murder mystery! Can you crack the case before the killer gets away? 🕵️‍♂️ 1. Buy your tickets & check you email 🎫 2. Download the Questo app 📲 3. Head to the starting point & start your adventure📍 💡 New to Questo? Check out our Player’s Guide for everything you need to know before you start!",
        "event_link": "https://www.eventbrite.com/e/boston-murder-mystery-death-in-the-shadows-tickets-1229905944789?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#adventure",
            "#outdoor",
            "#dating",
            "#couples",
            "#walking",
            "#datenight",
            "#valentines",
            "#scavenger_hunt",
            "#murder_mystery",
            "#escape_room"
        ]
    },
    {
        "title": "Adventurous Scavenger Hunt - All Along the Charles River",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "Aesop's Fables, II 20 Vassar Street Cambridge, MA 02139 Show map",
        "about": "They say knowledge is power, and in Cambridge, Massachusetts, it’s also a whole lot of fun! Join us on an exhilarating Cambridge, Massachusetts scavenger hunt through the heart of Downtown, where academia meets adventure. As we unravel the mysteries of this storied city, you'll find yourself puzzling over timeless tales and indulging in delicious discoveries. From hidden gardens to architectural marvels that might just inspire your own eureka moment, each stop promises intrigue and excitement. Whether you're navigating through an artistic maze or deciphering clues as if they were equations at a prestigious institution, our scavenger hunt guarantees laughter and camaraderie. Ready to test your wits with this smartly crafted quest? Dive into the Cambridge, Massachusetts scavenger hunt experience today—where history whispers secrets and every corner offers a delightful surprise! Some of what you'll see: Martin Luther King Jr. Garden , Great Dome at MIT, Walker Memorial Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com",
        "event_link": "https://www.eventbrite.com/e/adventurous-scavenger-hunt-all-along-the-charles-river-tickets-1078275453909?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Races",
            "Cambridge Travel & Outdoor Races",
            "#adventure",
            "#explore",
            "#outdooradventure",
            "#team_building",
            "#scavenger_hunt",
            "#photohunt",
            "#selfguided",
            "#puzzlehunt",
            "#mysteryhunt",
            "#cityhunt"
        ]
    },
    {
        "title": "Adventurous Scavenger Hunt - Smashing Somerville Scavenger Hunt",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "1 Oxford St 1 Oxford Street Cambridge, MA 02138 Show map",
        "about": "Why did the chicken cross the road in Somerville? To join the Somerville, Massachusetts scavenger hunt, of course! Get ready to strut your stuff and explore the vibrant Downtown neighborhood on this thrilling and entertaining escapade. You‘ll unveil hidden gems, quirky attractions, and distinctive landmarks that make our beloved town genuinely one-of-a-kind. Uncover cryptic clues and solve riddles as you traverse great sites with a dash of humor and excitement. Our Somerville, Massachusetts scavenger hunt will have you chuckling by Poohs House, marveling at historic fountains, roaming around picturesque memorial grounds, and uncovering some Three Lies. Capture amusing snapshots with epic theater facades or find colorful surprises in various pigments. Who knows? By the end of this delightful experience, you might just develop a taste for a specific leafy symbol! So why wait? Cluck… er… click to get your tickets now and create memories that Some of what you'll see: Clover HSQ, Thomas Magliozzi Plaque, The Brattle Theatre Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com",
        "event_link": "https://www.eventbrite.com/e/adventurous-scavenger-hunt-smashing-somerville-scavenger-hunt-tickets-1074723439739?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Games",
            "Cambridge Travel & Outdoor Games"
        ]
    },
    {
        "title": "Which Island Does it Best Boat Cruise (Flag Party) Part 2",
        "date_time": "Saturday, June 14 · 6 - 9pm EDT",
        "location": "Boston Harbor 60 Rowes Wharf Boston, MA 02110 Show map",
        "about": "Welcome aboard the Which Island Does it Best Boat Cruise (Flag Party) Part 2 ! Join us for a fun-filled day out on the water in Boston Harbor as we celebrate the best of the islands in style. Get ready to dance, mingle, and show off your island pride with your favorite flag. This event is all about good vibes, great music, and even better company. Don't miss out on the opportunity to cruise around the harbor with fellow island enthusiasts and enjoy the scenic views. Come dressed to impress and ready to party - it's going to be an unforgettable experience!",
        "event_link": "https://www.eventbrite.com/e/which-island-does-it-best-boat-cruise-flag-party-part-2-tickets-1297271888139?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Travel & Outdoor Parties",
            "#party",
            "#cruise",
            "#boat",
            "#flag",
            "#island"
        ]
    },
    {
        "title": "Creative Cambridge Amazing Race & Tour",
        "date_time": "Sunday, April 27 · 11am - 1pm EDT",
        "location": "Blue Bottle Coffee 40 Bow Street Cambridge, MA 02138 Show map",
        "about": "Your creative, nontraditional scavenger hunt begins at a scenic spot that's a local favorite. You'll get your digital quest from your live and interactive remote host. Then you’ll take off on your own to experience a wide variety of carefully curated locations in town. You'll walk or drive to the various checkpoints as you interpret creative tasks, accept wacky challenges, and get outside your comfort zone! ONE TICKET PER PERSON. Both family and dog friendly, the game alternates between the indoors and outdoors, with plenty of bonus challenges too! You'll text photos and videos to your remote host, who cheers you on and assists, as you play - to document your progress. You can even interact with the locals to interpret the creative challenges. You won’t be able to avoid having fun, uncovering hidden gems and local secrets, making memories, laughing, and learning along the way! You’ll be part of the rich culture of this dynamic city! Every turn is full of surprises, so questions in advance are welcomed. Check out all 500 of our city hunts! Great for corporate groups, tourists, curious locals, bachelors(ettes), birthdays, families, friend trips, and other special groups! Ask us about our custom-designed experiences and virtual team builders too!",
        "event_link": "https://www.eventbrite.com/e/creative-cambridge-amazing-race-tour-tickets-1082440200779?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Races",
            "Cambridge Travel & Outdoor Races",
            "#tour",
            "#creative",
            "#event",
            "#cambridge",
            "#amazing_race"
        ]
    },
    {
        "title": "The Boston Bash Scavenger Hunt",
        "date_time": "Sunday, April 27 · 11am - 1pm EDT",
        "location": "Boston Common Carousel 45 Beacon Street Boston, MA 02108 Show map",
        "about": "Your creative, nontraditional scavenger hunt begins at a scenic spot that's a local favorite. You'll get your digital quest from your live and interactive remote host. Then you’ll take off on your own to experience a wide variety of carefully curated locations in town. You'll walk or drive to the various checkpoints as you interpret creative tasks, accept wacky challenges, and get outside your comfort zone! ONE TICKET PER PERSON. Both family and dog friendly, the game alternates between the indoors and outdoors, with plenty of bonus challenges too! You'll text photos and videos to your remote host, who cheers you on and assists, as you play - to document your progress. You can even interact with the locals to interpret the creative challenges. You won’t be able to avoid having fun, uncovering hidden gems and local secrets, making memories, laughing, and learning along the way! You’ll be part of the rich culture of this dynamic city! Every turn is full of surprises, so questions in advance are welcomed. Check out all 500 of our city hunts! Great for corporate groups, tourists, curious locals, bachelors(ettes), birthdays, families, friend trips, and other special groups! Ask us about our custom-designed experiences and virtual team builders too!",
        "event_link": "https://www.eventbrite.com/e/the-boston-bash-scavenger-hunt-tickets-657833657177?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#boston",
            "#event",
            "#bash",
            "#hunt",
            "#scavenger",
            "#team_building",
            "#family_friendly",
            "#family_fun"
        ]
    },
    {
        "title": "Amazing Scavenger Hunt! - Chelsea Chasers Treasure Hunt",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "Porter Street Porter Street Boston, MA 02128 Show map",
        "about": "Prepare to chel-sea the best of this vibrant Massachusetts city on our exciting Chelsea, Massachusetts scavenger hunt! Immerse yourself in the storied past and charming culture of Chelsea‘s Downtown neighborhood as you embark on a thrilling adventure filled with discovery, laughter, and unforgettable memories. Search for hidden gems within the picturesque downtown area, like the Logan Airport 9/11 Memorial honoring the sacrifices of countless heroes, or soak up views from Belmont Square. Stand in awe of incredible public art at Portal and Stelae by Carlos Dorrien while learning quirky tidbits about the city‘s history. Take a moment to remember beloved community figures at touching memorials around town, and marvel at how old meets new through unique revitalization projects like ReCap - all these surprises await you during your Chelsea, Massachusetts scavenger hunt journey! Secure your tickets to enjoy an unparalleled experience exploring this diverse and enchanting city. Some of what you'll see: Portal and Stelae by Carlos Dorrien, 1973: Massport, ReCap Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com",
        "event_link": "https://www.eventbrite.com/e/amazing-scavenger-hunt-chelsea-chasers-treasure-hunt-tickets-1085890330209?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#teambuilding",
            "#hiddengems",
            "#outdooradventure",
            "#scavenger_hunt",
            "#photohunt",
            "#selfguided",
            "#puzzlehunt",
            "#mysteryhunt",
            "#cluehunt",
            "#cityhunt"
        ]
    },
    {
        "title": "Boston Outdoor Escape Game: The Mysterious Porcellian Club",
        "date_time": "Starts on Sunday, April 27 · 11am EDT",
        "location": "Johnston Gate 1465-1483 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "Harvard University is synonymous with academic excellence and integrity. Discover Harvard Yard, a stomping ground for intellectuals and innovators, a hub of culture, science, and politics. You will see how students give back to their communities, write about important issues, and celebrate key traditions. But you can also learn a few truths about Harvard that students don’t like to acknowledge-Harvard has quite a few myths. Ready to discover them? The route you’re going to follow in the city is sprinkled with unique places, fun clues and challenges, and incredible stories . The experience will play out like you’re the main characters of a movie, only that you’re experiencing everything in first person! Fun dialogue, intrigue, and unexpected interactions are guaranteed. HOW IT WORKS❓ 1. Book your tickets 🎫 2. Download the Questo app - it's free 📲 3. Head to the starting point📍 Available 24/7 Pause and resume anytime. WHAT YOU’LL DO The game is an interactive activity where you are guided by a mobile app through the city. With it, you follow directions and solve very fun puzzles, riddles, and cryptic codes. During the game, you will also visit popular and hidden places in the city while learning fun (and we mean it) stories about them. This is a storytelling experience just as much. The people doing these city exploration games gave them an average rating of 4.7/5 around the world. Join the playground too! ------------------ More about Questo 🚶‍♀️ Questo is an urban entertainment platform offering thematic real-world exploration games. It is currently available in over 150 cities 🌎 and has entertained hundreds of thousands of players already. As of today, the app offers more than 400 different experiences created by a growing network of local content creators and event organizers.",
        "event_link": "https://www.eventbrite.com/e/boston-outdoor-escape-game-the-mysterious-porcellian-club-tickets-654567929297?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Games",
            "Cambridge Travel & Outdoor Games",
            "#outdoors",
            "#outdoor",
            "#urban",
            "#couples",
            "#walking",
            "#group",
            "#escape",
            "#walkingtour",
            "#walking_tour",
            "#treasure_hunt"
        ]
    },
    {
        "title": "Boston Outdoor Escape Game: Mafia Mission",
        "date_time": "Starts on Sunday, April 27 · 11am EDT",
        "location": "The Rose Kennedy Rose Garden Atlantic Avenue Boston, MA 02110 Show map",
        "about": "Go on a walking tour to discover the best hidden locations in Boston’s North End, the city’s oldest neighborhood. You’ll explore the skinniest house in Boston, lush gardens, and the site where the “crime of the century” once took place, all while walking Boston’s most historic and charming streets. Are you ready to get in on some of Boston’s best-kept secrets? The route you’re going to follow in the city is sprinkled with unique places, fun clues and challenges, and incredible stories . The experience will play out like you’re the main characters of a movie, only that you’re experiencing everything in first person! Fun dialogue, intrigue, and unexpected interactions are guaranteed. Be ready to have a full immersion into the past and present of Portland. So grab your walking shoes, and join this adventure through the streets of Portland! HOW IT WORKS❓ 1. Book your tickets 🎫 2. Download the Questo app - it's free 📲 3. Head to the starting point📍 Available 24/7 Pause and resume anytime. WHAT YOU’LL DO The game is an interactive activity where you are guided by a mobile app through the city. With it, you follow directions and solve very fun puzzles, riddles, and cryptic codes. During the game, you will also visit popular and hidden places in the city while learning fun (and we mean it) stories about them. This is a storytelling experience just as much. The people doing these city exploration games gave them an average rating of 4.7/5 around the world. Join the playground too! ------------------ More about Questo 🚶‍♀️ Questo is an urban entertainment platform offering thematic real-world exploration games. It is currently available in over 150 cities 🌎 and has entertained hundreds of thousands of players already. As of today, the app offers more than 400 different experiences created by a growing network of local content creators and event organizers.",
        "event_link": "https://www.eventbrite.com/e/boston-outdoor-escape-game-mafia-mission-tickets-655619855637?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#outdoors",
            "#outdoor",
            "#urban",
            "#couples",
            "#walking",
            "#group",
            "#escape",
            "#walkingtour",
            "#walking_tour",
            "#treasure_hunt"
        ]
    },
    {
        "title": "Boston Murder Mystery: Death in the Shadows",
        "date_time": "Sunday, April 27 · 10 - 11:30am EDT",
        "location": "North Square North Square Boston, MA 02113 Show map",
        "about": "Highlights 🕵️‍♂️ Investigate a Chilling Mystery – Step into the shoes of a detective and uncover the truth behind Bella's murder. 🧩 Solve Puzzles & Follow Clues – Explore Boston’s historic streets, decipher hidden messages, and piece together the evidence. 🔎 Uncover a Deadly Secret – Explore famous landmarks and hidden corners as you piece together the truth behind Bella’s murder. 💀 Perfect for Date Night… Or a Killer Group Activity – Play with your partner, a group of friends, or even solo—just don’t end up the next victim! Storyline –❤️💀 Love in the Time of Murder You know the old saying, “The boyfriend did it” ? On an ill-fated night, love goes terribly wrong for Bella Wanderlust and Walter Bridges. Bella, a famous travel blogger, was found dead during a ghost tour led by the theatrical Percy Shadows . Now, it’s up to you to uncover the truth. Was it Walter, the obsessed boyfriend? Percy, the ghost tour guide with a flair for the dramatic? Or is someone else hiding in the shadows? 🔎 Gather clues, interrogate suspects, and expose the real murderer before they strike again. HOW IT WORKS Join the 20,000+ thrill-seekers who’ve ditched dinner and a movie for a night of mystery and intrigue! 🔎💀 Step into a real-life crime scene with an experience that combines the challenge of an outdoor escape room, the excitement of a scavenger hunt, and the suspense of a murder mystery! Can you crack the case before the killer gets away? 🕵️‍♂️ 1. Buy your tickets & check you email 🎫 2. Download the Questo app 📲 3. Head to the starting point & start your adventure📍 💡 New to Questo? Check out our Player’s Guide for everything you need to know before you start!",
        "event_link": "https://www.eventbrite.com/e/boston-murder-mystery-death-in-the-shadows-tickets-1229905944789",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#adventure",
            "#outdoor",
            "#dating",
            "#couples",
            "#walking",
            "#datenight",
            "#valentines",
            "#scavenger_hunt",
            "#murder_mystery",
            "#escape_room"
        ]
    },
    {
        "title": "Adventurous Scavenger Hunt - All Along the Charles River",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "Aesop's Fables, II 20 Vassar Street Cambridge, MA 02139 Show map",
        "about": "They say knowledge is power, and in Cambridge, Massachusetts, it’s also a whole lot of fun! Join us on an exhilarating Cambridge, Massachusetts scavenger hunt through the heart of Downtown, where academia meets adventure. As we unravel the mysteries of this storied city, you'll find yourself puzzling over timeless tales and indulging in delicious discoveries. From hidden gardens to architectural marvels that might just inspire your own eureka moment, each stop promises intrigue and excitement. Whether you're navigating through an artistic maze or deciphering clues as if they were equations at a prestigious institution, our scavenger hunt guarantees laughter and camaraderie. Ready to test your wits with this smartly crafted quest? Dive into the Cambridge, Massachusetts scavenger hunt experience today—where history whispers secrets and every corner offers a delightful surprise! Some of what you'll see: Martin Luther King Jr. Garden , Great Dome at MIT, Walker Memorial Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com",
        "event_link": "https://www.eventbrite.com/e/adventurous-scavenger-hunt-all-along-the-charles-river-tickets-1078275453909",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Races",
            "Cambridge Travel & Outdoor Races",
            "#adventure",
            "#explore",
            "#outdooradventure",
            "#team_building",
            "#scavenger_hunt",
            "#photohunt",
            "#selfguided",
            "#puzzlehunt",
            "#mysteryhunt",
            "#cityhunt"
        ]
    },
    {
        "title": "Adventurous Scavenger Hunt - Smashing Somerville Scavenger Hunt",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "1 Oxford St 1 Oxford Street Cambridge, MA 02138 Show map",
        "about": "Why did the chicken cross the road in Somerville? To join the Somerville, Massachusetts scavenger hunt, of course! Get ready to strut your stuff and explore the vibrant Downtown neighborhood on this thrilling and entertaining escapade. You‘ll unveil hidden gems, quirky attractions, and distinctive landmarks that make our beloved town genuinely one-of-a-kind. Uncover cryptic clues and solve riddles as you traverse great sites with a dash of humor and excitement. Our Somerville, Massachusetts scavenger hunt will have you chuckling by Poohs House, marveling at historic fountains, roaming around picturesque memorial grounds, and uncovering some Three Lies. Capture amusing snapshots with epic theater facades or find colorful surprises in various pigments. Who knows? By the end of this delightful experience, you might just develop a taste for a specific leafy symbol! So why wait? Cluck… er… click to get your tickets now and create memories that Some of what you'll see: Clover HSQ, Thomas Magliozzi Plaque, The Brattle Theatre Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com",
        "event_link": "https://www.eventbrite.com/e/adventurous-scavenger-hunt-smashing-somerville-scavenger-hunt-tickets-1074723439739",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Games",
            "Cambridge Travel & Outdoor Games"
        ]
    },
    {
        "title": "Amazing Scavenger Hunt! - Chelsea Chasers Treasure Hunt",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "Porter Street Porter Street Boston, MA 02128 Show map",
        "about": "Prepare to chel-sea the best of this vibrant Massachusetts city on our exciting Chelsea, Massachusetts scavenger hunt! Immerse yourself in the storied past and charming culture of Chelsea‘s Downtown neighborhood as you embark on a thrilling adventure filled with discovery, laughter, and unforgettable memories. Search for hidden gems within the picturesque downtown area, like the Logan Airport 9/11 Memorial honoring the sacrifices of countless heroes, or soak up views from Belmont Square. Stand in awe of incredible public art at Portal and Stelae by Carlos Dorrien while learning quirky tidbits about the city‘s history. Take a moment to remember beloved community figures at touching memorials around town, and marvel at how old meets new through unique revitalization projects like ReCap - all these surprises await you during your Chelsea, Massachusetts scavenger hunt journey! Secure your tickets to enjoy an unparalleled experience exploring this diverse and enchanting city. Some of what you'll see: Portal and Stelae by Carlos Dorrien, 1973: Massport, ReCap Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com",
        "event_link": "https://www.eventbrite.com/e/amazing-scavenger-hunt-chelsea-chasers-treasure-hunt-tickets-1085890330209",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#teambuilding",
            "#hiddengems",
            "#outdooradventure",
            "#scavenger_hunt",
            "#photohunt",
            "#selfguided",
            "#puzzlehunt",
            "#mysteryhunt",
            "#cluehunt",
            "#cityhunt"
        ]
    },
    {
        "title": "Birthday Game Idea in Boston: Investigate the veiled mafia secrets!",
        "date_time": "Starts on Sunday, April 27 · 11am EDT",
        "location": "The Rose Kennedy Rose Garden Atlantic Avenue Boston, MA 02110 Show map",
        "about": "Searching for an unforgettable last-minute birthday party idea that will leave your friends thrilled and amazed? Look no further! Embark on an epic outdoor exploration journey that spark your spirit of competition and ignite your sense of adventure. Go on a walking tour to discover the best hidden locations in Boston’s North End , the city’s oldest neighborhood. You’ll explore the skinniest house in Boston , lush gardens , and the site where the “crime of the century” once took place, all while walking Boston’s most historic and charming streets . You’re a local investigative reporter hoping to land your first big piece in The Boston Globe. You’ve discovered a scandal in the North End, where a famous Italian mafia family is allegedly in cahoots with a well-known local politician. But the proof lies in several incriminating documents the mafia hid in the neighborhood. Follow the trails, solve intricate mysteries, and conquer challenging tasks that will test your intellect, creativity, and teamwork. Your journey will lead you to explore iconic & unique places , each with its own unique significance and puzzles to solve. Book your adventure now and treat yourself, your friends, or your loved ones to a birthday celebration that transcends time and sparks the spirit of exploration! Are you skilled enough to investigate Boston Mafia's best-kept secrets?",
        "event_link": "https://www.eventbrite.com/e/birthday-game-idea-in-boston-investigate-the-veiled-mafia-secrets-tickets-695482686437?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#party",
            "#friends",
            "#event",
            "#outdoor",
            "#games",
            "#competition",
            "#birthday",
            "#group",
            "#roleplaying",
            "#group_activities"
        ]
    },
    {
        "title": "Boston: The Record Breaker Outdoor Escape Game",
        "date_time": "Starts on Sunday, April 27 · 5am EDT",
        "location": "Boston Public Library 700 Boylston Street Boston, MA 02116 Show map",
        "about": "‘Dinner and a movie’ is so 2021! Especially when the movie is now played out in the real-world. Let us explain! The route you’re going to follow in the city is sprinkled with charming and picturesque places, fun clues and challenges, and romantic stories of past and present. The experience will play out like you’re the main characters of a movie, only that you’re experiencing everything in first person! Fun dialogue, intrigue, and unexpected interactions are guaranteed. Boston has played a central role in U.S. history - being a financial center in the country in the 19th century, when the English came and settled here. You can all probably remember from history class that the American Revolution erupted here. Learn about historical Boston and its standing in the U.S history of being “first in the nation” to build and enact many things. You’ll see the architecturally beautiful Public Library, historic State House, lush Boston Common, and many more historical sites in Boston. Don’t worry, you don’t need to be a historian or have any knowledge of historical Boston to play the game. Anyone up for the adventure can do it – all that’s needed is to download our award-winning app and explore beautiful parts of town at your own pace, chosen to delight and entertain. Do you prefer adventures without tag-alongs? You’ll get complete freedom and privacy, as there aren’t any guides involved in our games. Ready for a break? Take one! You can have a coffee or an ice cream break whenever you want with no pressure to keep going if you need a moment to relax. Ready to continue playing after your break? Just pick up where you left off and get right back into it! A historical Boston walking tour has never been this much fun! HOW IT WORKS❓ 1. Book your tickets 🎫 2. Download the Questo app - it's free 📲 3. Head to the starting point📍 Available 24/7 Pause and resume anytime. WHAT YOU’LL DO The game is an interactive activity where you are guided by a mobile app through the city. With it, you follow directions and solve very fun puzzles, riddles, and cryptic codes. During the game, you will also visit popular and hidden places in the city while learning fun (and we mean it) stories about them. This is a storytelling experience just as much. The people doing these city exploration games gave them an average rating of 4.7/5 around the world. Join the playground too! ------------------ More about Questo 🚶‍♀️ Questo is an urban entertainment platform offering thematic real-world exploration games. It is currently available in over 130 cities 🌎 and has entertained hundreds of thousands of players already. As of today, the app offers more than 300 different experiences created by a growing network of local content creators and event organizers.",
        "event_link": "https://www.eventbrite.com/e/boston-the-record-breaker-outdoor-escape-game-tickets-477497567077?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#outdoors",
            "#outdoor",
            "#urban",
            "#couples",
            "#walking",
            "#group",
            "#escape",
            "#walkingtour",
            "#walking_tour",
            "#treasure_hunt"
        ]
    },
    {
        "title": "Boston Scavenger Hunt Escape: The Golden Shamrock",
        "date_time": "Sunday, April 27 · 10 - 11:30am EDT",
        "location": "North Square North Square Boston, MA 02113 Show map",
        "about": "Boston 's fortune has faltered with the mysterious disappearance of the Golden Shamrock , the city's lucky charm , during the Annual Founders’ Day festival. The city has fallen into chaos: the clocks stopped , the signs fell , the bakery’s bread won’t rise , and the town’s prized fountain ( which flows green every spring ) has dried up . Legend says that when the shamrock is stolen, its power fractures into seven pieces of luck – each hidden in a different part of town , guarded by tricky puzzles, mischievous riddles, and enchanted objects. The only way to restore the balance in the city is to recover all seven pieces before sunset , reassemble the shamrock, and find out who took it… and why! HIGHLIGHTS : 🕵️‍♂️ - YOU are the detective and the phone is your only tool 🎮 - P lay alone or invite all your friends 🏎️ - Start any day, any hour 📍 - Explore 12 locations in Boston and retrieve all the seven pieces of luck 🧩 - Solve intriguing puzzles , decipher c ryptic messages and fix broken mechanisms ⌛ - You have exactly 2 hours to find the Golden Shamrock and save the city 🎟️ - Finish the game and enter the contest for a GOLDEN TICKET to all Questo events in 2025 , anywhere in the world!",
        "event_link": "https://www.eventbrite.com/e/boston-scavenger-hunt-escape-the-golden-shamrock-tickets-1267937468099?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#fun",
            "#kids",
            "#outdoor",
            "#dating",
            "#couples",
            "#walking",
            "#escape",
            "#scavenger_hunt",
            "#family_friendly",
            "#puzzlehunt"
        ]
    },
    {
        "title": "An Exciting Scavenger Hunt! - Back Bay & Beyond",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "95 Clarendon St 95 Clarendon Street Boston, MA 02116 Show map",
        "about": "Get ready to embark on a wicked awesome adventure through the vibrant streets of Boston, Massachusetts! Our scavenger hunt in the Copley/South End neighborhood is the perfect way to explore this historic city while having a blast with your friends and family. From iconic landmarks to hidden gems, this experience will leave you laughing, learning, and craving more. Join us as we journey through time and history, searching for clues at various locations throughout the city. You'll discover quirky sculptures like \"The Tortoise and the Hare,\" explore beautiful green spaces like Frieda Garcia Park, and even visit prestigious institutions like the Benjamin Franklin Institute of Technology and Boston Public Library. With each step, you'll uncover fascinating stories and tidbits about Boston's rich culture and heritage. So what are you waiting for? Grab your tickets now for an unforgettable Boston, Massachusetts scavenger hunt that will have you feeling like a true local. Don't miss out on this exciting opportunity to explore one of America's most historic cities Some of what you'll see: Harriet Tubman Square, Frieda Garcia Park, Franklin Cummings Tech Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com",
        "event_link": "https://www.eventbrite.com/e/an-exciting-scavenger-hunt-back-bay-beyond-tickets-1025595693327?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games"
        ]
    },
    {
        "title": "An Epic, Fun-Filled Scavenger Hunt! - Historic Harvard Hunt",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "1515 Massachusetts Ave 1515 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "Massachusetts is home to the world's most famous school. On this fun-filled Harvard scavenger hunt, explore the school's iconic campus and the grand sights around Cambridge. How much does it cost for honors at Harvard Yard? Will the stunning John F Kennedy Park leave you speechless or speeches? Find out on this scavenger hunt of Harvard, in Cambridge, Massachusetts! **Let's Roam is not affiliated with Harvard University. Let's Roam does not encourage participants to enter school buildings.** Some of what you'll see: Austin Hall, Cambridge Savings Bank, Massachusetts Hall Explore The City: Discover the best sights in your city with your group and answer questions that can only be found in person, hidden on plaques, statues, art, and more. Photo Challenges and Activities: Each person will have an interactive role and will receive texted photo challenges and fun activities to enjoy with the rest of the group. Earn points for the best photos! How it works: 1. You can start at any time you wish – this is a self-guided scavenger hunt. 2. The duration of each hunt is 1.5 to 2 hours. 3. Visit our website to purchase tickets. 4. Download our Let's Roam app from the Play Store or App Store. Register and redeem the tickets there to get started. 5. The app will guide you throughout the tour and the challenges you need to accomplish! 6. For any help or concerns, contact our customer service, and we'll be more than happy to assist you! This scavenger hunt is app-led, allowing you to start at any time without the need for a tour guide or reservation. Are you ready for a fun-filled and epic adventure? Compete with your friends and family, purchase some tickets, download our app to get started, and... ROAM ON!! Find more scavenger hunts near you! Visit https://www.letsroam.com",
        "event_link": "https://www.eventbrite.com/e/an-epic-fun-filled-scavenger-hunt-historic-harvard-hunt-tickets-1028454012637?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Games",
            "Cambridge Travel & Outdoor Games"
        ]
    },
    {
        "title": "Scavenger Hunt Cambridge",
        "date_time": "Starts on Saturday, April 26 · 2pm EDT",
        "location": "Cambridge 1525 Massachusetts Ave Cambridge, MA 02138 Show map",
        "about": "What is It's a Scavenger Hunt!? This Scavenger Hunt is a family friendly activity played by following instructions provided on your mobile device by the in-game host. Fill your virtual scavenger sack with the items you help choose through riddle-like clues! Explore your surroundings, attempting to quickly locate a variety of items as they are revealed one at a time by your game master. What time does this start and finish? Because this game is self-guided by the in-app game master, you can play almost anywhere and at any time on any day - no reservations required! Most groups complete the scavenger hunt in around 90 minutes. Where do we play? You choose where to play! This Scavenger Hunt is designed to be played in a busy populated area like a shopping mall. However, anywhere with a variety of publicly accessible businesses and outdoor spaces is a potential location to play. What is the registration process? After purchasing your ticket you MUST follow the registration instructions in your confirmation e-mail to validate your ticket. Please register online immediately after you purchase. What is the refund policy? All tickets are valid for 12 months and are not time or location specific. All sales are final. Questions? Please visit the Help Page on our web site at https://itsascavengerhunt.com/faq.php",
        "event_link": "https://www.eventbrite.com/e/scavenger-hunt-cambridge-tickets-358913047587?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Games",
            "Cambridge Travel & Outdoor Games",
            "#family",
            "#kids",
            "#games",
            "#scavengerhunt",
            "#scavenge",
            "#scavenger_hunt",
            "#family_friendly",
            "#family_fun",
            "#kids_event",
            "#kids_activities"
        ]
    },
    {
        "title": "Participate in a Fun Scavenger Hunt in Boston by Operation City Quest",
        "date_time": "Starts on Sunday, April 27 · 9am EDT",
        "location": "Faneuil Hall 1 Faneuil Hall Square Boston, MA 02109 Show map",
        "about": "Boston! Are you looking for a fun, family-friendly activity in Boston? We can help you explore Boston with our fun photo scavenger hunt service! Get a team together, purchase tickets, then redeem your tickets on our website. You'll get your instructions for your epic scavenger hunt delivered to your email. Once at your location, use the instructions to get set up on the app and then the app will give you a list of items to find. The items come in the form of riddles! First figure out the riddle to determine what item you're looking for, then you'll set out to look for the item described in the riddle, complete the accompanying challenge, and send in a photo to get points. Your points will show up on the app's leaderboard so you can see how you're doing compared to other teams who have played in Boston! Looking for more info? Visit our website at operationcityquest.com. The scavenger hunt is priced per person. Each ticket gives one person 13 or older access to participate in the scavenger hunt. Children 12 and under are free and do not need a ticket. After ticket purchase, Operation City Quest requires a redemption made on our website.  Redemption can be made at https://www.operationcityquest.com/redeem-tickets.   In addition to our Boston scavenger hunt, Operation City Quest has over 400 locations all over North America. Participants can choose where they'd like to participate when they redeem their ticket on our website. See locations at https://www.operationcityquest.com/locations. Locations include most major cities in the US & Canada.",
        "event_link": "https://www.eventbrite.com/e/participate-in-a-fun-scavenger-hunt-in-boston-by-operation-city-quest-tickets-1269728745859?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#tour",
            "#activity",
            "#thingstodo",
            "#activities",
            "#tours",
            "#hunt",
            "#scavenger",
            "#scavengerhunt",
            "#things_to_do",
            "#family_friendly"
        ]
    },
    {
        "title": "Self Guided Classic Freedom Trail Location Aware (GPS) Walking Audio Tour",
        "date_time": "Sunday, April 27 · 6am - 7pm EDT",
        "location": "Boston Common Visitors Center 139 Tremont Street Boston, MA 02111 Show map",
        "about": "Go at your own pace, anytime. The tour is all on the WalknTours app and you'll be guided step by step through the city as you hear the stories of each spot told by our theatircal narrator. To take this tour you will need the WalknTours app, available on the App Store and Google Play (The Green W) The tour is all outside and you can go anytime, 24/7/365. The tour never expires. You can go anytime and as many times as you want. To note, the tour does not include entrance to any sites, this is an outdoor walking tour. You are free to pause the tour and enter (paying your own fee) to enter any of the sites. Just press play when you are ready to continue. On the Tour you'll see: Boston Common Visitors CenterSee address & details Massachusetts State House Boston Common Freedom TrailStop: Granary Burying Ground King's Chapel Old City Hall Park Street Church Old State House Faneuil Hall Marketplace Union Oyster House Haymarket Old South Meeting House The Paul Revere House St. Stephen's Episcopal Church Paul Revere Statue Copp's Hill Burying Ground Prince Street Boston Parking Old North Church & Historic Site Training Field Bunker Hill Monument USS Constitution City Square Park Salumeria Italiana Boston Massacre And much more!",
        "event_link": "https://www.eventbrite.com/e/self-guided-classic-freedom-trail-location-aware-gps-walking-audio-tour-tickets-1115774534669?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Travel & Outdoor Tours",
            "#classic",
            "#self_guided",
            "#walking_tour",
            "#freedom_trail",
            "#location_aware"
        ]
    },
    {
        "title": "A Date Night Adventure! - Back Bay & Beyond",
        "date_time": "April 26 · 8am - April 27 · 12am EDT",
        "location": "95 Clarendon St 95 Clarendon Street Boston, MA 02116 Show map",
        "about": "Get ready to embark on a wicked awesome adventure through the vibrant streets of Boston, Massachusetts! Our scavenger hunt in the Copley/South End neighborhood is the perfect way to explore this historic city while having a blast with your friends and family. From iconic landmarks to hidden gems, this experience will leave you laughing, learning, and craving more. Join us as we journey through time and history, searching for clues at various locations throughout the city. You'll discover quirky sculptures like \"The Tortoise and the Hare,\" explore beautiful green spaces like Frieda Garcia Park, and even visit prestigious institutions like the Benjamin Franklin Institute of Technology and Boston Public Library. With each step, you'll uncover fascinating stories and tidbits about Boston's rich culture and heritage. So what are you waiting for? Grab your tickets now for an unforgettable Boston, Massachusetts scavenger hunt that will have you feeling like a true local. Don't miss out on this exciting opportunity to explore one of America's most historic cities Some of what you'll see: Harriet Tubman Square, Frieda Garcia Park, Franklin Cummings Tech",
        "event_link": "https://www.eventbrite.com/e/a-date-night-adventure-back-bay-beyond-tickets-1067371299289?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Travel & Outdoor Tours",
            "#adventure",
            "#date_night",
            "#couples_night",
            "#back_bay",
            "#couplesdate",
            "#holidaydate",
            "#holidayhunt",
            "#date_adventure",
            "#outdoordate",
            "#weekenddate"
        ]
    },
    {
        "title": "Cambridge Quest Experience: MIT Mysterious Intelligence Tour",
        "date_time": "Starts on Sunday, April 27 · 11am EDT",
        "location": "Kendall Square Kendall Square Cambridge, MA 02142 Show map",
        "about": "Take a tour of MIT, visiting numerous areas around the campus and gaining insight into arguably the world's most innovative university. You'll learn about the school's storied history, technological prowess and how students live their lives. In the process become enthralled in a thrilling story about spies and secrets. Ready for a little espionage? The route you’re going to follow in the city is sprinkled with unique places, fun clues and challenges, and incredible stories of past and present. The experience will play out like you’re the main characters of a movie, only that you’re experiencing everything in first person! Fun dialogue, intrigue, and unexpected interactions are guaranteed. HOW IT WORKS❓ 1. Book your tickets 🎫 2. Download the Questo app - it's free 📲 3. Head to the starting point📍 Available 24/7 Pause and resume anytime. WHAT YOU’LL DO The game is an interactive activity where you are guided by a mobile app through the city. With it, you follow directions and solve very fun puzzles, riddles, and cryptic codes. During the game, you will also visit popular and hidden places in the city while learning fun (and we mean it) stories about them. This is a storytelling experience just as much. The people doing these city exploration games gave them an average rating of 4.7/5 around the world. Join the playground too! ------------------ More about Questo 🚶‍♀️ Questo is an urban entertainment platform offering thematic real-world exploration games. It is currently available in over 130 cities 🌎 and has entertained hundreds of thousands of players already. As of today, the app offers more than 300 different experiences created by a growing network of local content creators and event organizers.",
        "event_link": "https://www.eventbrite.com/e/cambridge-quest-experience-mit-mysterious-intelligence-tour-tickets-956958166637?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Games",
            "Cambridge Travel & Outdoor Games",
            "#outdoors",
            "#outdoor",
            "#urban",
            "#couples",
            "#walking",
            "#group",
            "#escape",
            "#walkingtour",
            "#walking_tour",
            "#treasure_hunt"
        ]
    },
    {
        "title": "Boston Historical Adventure: Echoes of the Past",
        "date_time": "Starts on Sunday, April 27 · 11am EDT",
        "location": "Boston Public Library - Central Library 700 Boylston Street Boston, MA 02116 Show map",
        "about": "Highlights 📍 Explore Boston's Historic Sites : Visit landmarks such as the Boston Public Library, the Massachusetts State House, and Boston Common, each showcasing the city's rich history. 🧩 Solve Mysteries : Engage in interactive challenges that reveal Boston's pioneering achievements and \"firsts\" in the nation. 🏛️ Discover Architectural Marvels : Admire the design and significance of sites like the Boston Public Library and the Massachusetts State House, reflecting the city's architectural heritage. 👥 For History Enthusiasts and Adventure Seekers : Ideal for those eager to delve into Boston's past through an engaging, interactive experience. Storyline – The Record Breaker As a professional record setter aiming to be the first in everything you do, embark on a journey through Boston to uncover the city's numerous pioneering achievements. Navigate the historic streets, solve puzzles, and learn about Boston's significant \"firsts,\" from its public library to its state constitution, all while striving to set your own record. HOW IT WORKS This isn’t your typical tour — it’s a journey through time. Follow clues, piece together history, and uncover the city’s most fascinating stories. Part treasure hunt, part historical quest, all adventure. Ready to explore? 🧭 1. Buy your tickets & check you email 🎫 2. Download the Questo app 📲 3. Head to the starting point & start your adventure📍 💡 New to Questo? Check out our Player’s Guide for everything you need to know before you start!",
        "event_link": "https://www.eventbrite.com/e/boston-historical-adventure-echoes-of-the-past-tickets-1218945782649?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#outdoor",
            "#couples",
            "#walking",
            "#group",
            "#city",
            "#escape",
            "#scavenger_hunt",
            "#walking_tour",
            "#treasure_hunt",
            "#escape_room"
        ]
    },
    {
        "title": "You Sleuth Augmented Reality Detective Experience",
        "date_time": "Starts on Saturday, April 26 · 1pm EDT",
        "location": "Cambridge Your neighborhood 1525 Massachusetts Ave Cambridge, MA 02138 Show map",
        "about": "What is You Sleuth? You Sleuth™ is an all age activity that can be done on your own schedule and in your own neighborhood. This is a self-guided experience played using your smartphones to interact with the virtual characters in the game. Put on your detective hat and shoes and explore your own neighborhood on foot as you gather information about your case and receive phone calls from the Chief of Police. Use the in-game real-world map to find your way to the physical locations of the victim and the suspects so you can interview them. When you have enough facts to eliminate everybody except the crook, make your accusation and receive feedback on your investigation. Where and when does this start? You choose where and when to play! Because You Sleuth™ is a self-guided activity you can play any time on any day and almost anywhere - no reservations required! We recommend going out during daylight hours. Duration averages between 90 minutes and 2 hours. Do I have to bring my ticket? You will only need a mobile device with an Internet connection. All registration is done via our website and you will not have to check in with anyone before you begin as the activity is self-guided. What is the registration process? After purchasing your ticket you MUST follow the registration instructions in your confirmation e-mail to validate your ticket. Please register immediately after you purchase. What is the refund policy? Tickets are valid for 12 months at any location. All sales are final. Questions? Please visit the Help Page on our web site at https://yousleuth.com/faq.php",
        "event_link": "https://www.eventbrite.com/e/you-sleuth-augmented-reality-detective-experience-tickets-130489005127?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Games",
            "Cambridge Travel & Outdoor Games",
            "#family",
            "#outdoors",
            "#outdoor",
            "#games",
            "#walking",
            "#virtual",
            "#things_to_do",
            "#augmented_reality",
            "#virtual_event",
            "#virtual_things_to_do"
        ]
    },
    {
        "title": "Amazing Scavenger Hunt Adventure-Boston Freedom Trail",
        "date_time": "Sunday, April 27 · 8am - 7pm EDT",
        "location": "Boston Commons Visitors Center 139 Tremont St Boston, MA 02108 Show map",
        "about": "Turn Boston into a giant game board with this fun scavenger hunt adventure. Combine the excitement of the Amazing Race with a three-hour city tour . Guided from any smart phone, teams make their way among well-known and overlooked gems of the city, solving clues and completing challenges while learning local history. Start when you want and play at your pace. Price is per team, not per person. Find details and Redeem your ticket as a Prepaid Code online at www.UrbanAdventureQuest.com .",
        "event_link": "https://www.eventbrite.com/e/amazing-scavenger-hunt-adventure-boston-freedom-trail-tickets-15234897990?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Travel & Outdoor Events"
        ]
    },
    {
        "title": "GBNEMBA - BEGINNER/NOVICE RIDE - BEAVER BROOK, BELMONT Group Ride",
        "date_time": "Monday, May 12 · 6 - 8pm EDT",
        "location": "Beaver Brook Reservation 66 Mill Street Belmont, MA 02478 Show map",
        "about": "Come learn the basic skills to ride singletrack - bike handling, shifting, body position, trail etiquette, & basic, trailside bike maintenance in a relaxed, supportive setting. Helmet required, bring water, wear appropriate footwear. Must be 18+ yrs.",
        "event_link": "https://www.eventbrite.com/e/gbnemba-beginnernovice-ride-beaver-brook-belmont-group-ride-tickets-1268144637749?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Belmont, MA",
            "Belmont Races",
            "Belmont Travel & Outdoor Races",
            "#mtb",
            "#greaterboston",
            "#recurring",
            "#template",
            "#outdoor_activity",
            "#bike_ride",
            "#group_ride",
            "#gbnemba"
        ]
    },
    {
        "title": "A Walking City Trail Survey Birdwalk  at Stony Brook Reservation",
        "date_time": "Sunday, April 27 · 8 - 10am EDT",
        "location": "Stony Brook Reservation, Boston MA 95 Turtle Pond Parkway Hyde Park, MA 02136 Show map",
        "about": "For this walk, we'll explore the eastern side of Stony Brook Reservation and see what new migrants and resident birds we can find. We'll keep a careful count and add the data to the evolving checklist for the Walking City Trail survey project. Details on our website. LINK",
        "event_link": "https://www.eventbrite.com/e/a-walking-city-trail-survey-birdwalk-at-stony-brook-reservation-tickets-1298347736029?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Travel & Outdoor Other",
            "#event",
            "#nature",
            "#conservation",
            "#wildlife",
            "#birdwatching",
            "#birding",
            "#greenspaces"
        ]
    },
    {
        "title": "GBNEMBA Kid's/Teen's Ride (Recurring)",
        "date_time": "Sunday, June 22 · 10am - 2pm EDT",
        "location": "Beaver Brook Reservation 66 Mill Street Belmont, MA 02478 Show map",
        "about": "This kids & teen mtb ride will traverse assorted cross-country terrain.  No training wheels, balance bikes welcome.",
        "event_link": "https://www.eventbrite.com/e/gbnemba-kidsteens-ride-recurring-tickets-1307518305449?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Belmont, MA",
            "Belmont Races",
            "Belmont Travel & Outdoor Races",
            "#mtb",
            "#teens",
            "#recurring",
            "#template",
            "#kids_events",
            "#outdoor_activity",
            "#bike_ride",
            "#group_ride"
        ]
    },
    {
        "title": "Boston Outdoor Escape Game: Mafia Mission",
        "date_time": "Starts on Sunday, April 27 · 11am EDT",
        "location": "The Rose Kennedy Rose Garden Atlantic Avenue Boston, MA 02110 Show map",
        "about": "Go on a walking tour to discover the best hidden locations in Boston’s North End, the city’s oldest neighborhood. You’ll explore the skinniest house in Boston, lush gardens, and the site where the “crime of the century” once took place, all while walking Boston’s most historic and charming streets. Are you ready to get in on some of Boston’s best-kept secrets? The route you’re going to follow in the city is sprinkled with unique places, fun clues and challenges, and incredible stories . The experience will play out like you’re the main characters of a movie, only that you’re experiencing everything in first person! Fun dialogue, intrigue, and unexpected interactions are guaranteed. Be ready to have a full immersion into the past and present of Portland. So grab your walking shoes, and join this adventure through the streets of Portland! HOW IT WORKS❓ 1. Book your tickets 🎫 2. Download the Questo app - it's free 📲 3. Head to the starting point📍 Available 24/7 Pause and resume anytime. WHAT YOU’LL DO The game is an interactive activity where you are guided by a mobile app through the city. With it, you follow directions and solve very fun puzzles, riddles, and cryptic codes. During the game, you will also visit popular and hidden places in the city while learning fun (and we mean it) stories about them. This is a storytelling experience just as much. The people doing these city exploration games gave them an average rating of 4.7/5 around the world. Join the playground too! ------------------ More about Questo 🚶‍♀️ Questo is an urban entertainment platform offering thematic real-world exploration games. It is currently available in over 150 cities 🌎 and has entertained hundreds of thousands of players already. As of today, the app offers more than 400 different experiences created by a growing network of local content creators and event organizers.",
        "event_link": "https://www.eventbrite.com/e/boston-outdoor-escape-game-mafia-mission-tickets-655619855637",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#outdoors",
            "#outdoor",
            "#urban",
            "#couples",
            "#walking",
            "#group",
            "#escape",
            "#walkingtour",
            "#walking_tour",
            "#treasure_hunt"
        ]
    },
    {
        "title": "Birthday Game Idea in Boston: Investigate the veiled mafia secrets!",
        "date_time": "Starts on Sunday, April 27 · 11am EDT",
        "location": "The Rose Kennedy Rose Garden Atlantic Avenue Boston, MA 02110 Show map",
        "about": "Searching for an unforgettable last-minute birthday party idea that will leave your friends thrilled and amazed? Look no further! Embark on an epic outdoor exploration journey that spark your spirit of competition and ignite your sense of adventure. Go on a walking tour to discover the best hidden locations in Boston’s North End , the city’s oldest neighborhood. You’ll explore the skinniest house in Boston , lush gardens , and the site where the “crime of the century” once took place, all while walking Boston’s most historic and charming streets . You’re a local investigative reporter hoping to land your first big piece in The Boston Globe. You’ve discovered a scandal in the North End, where a famous Italian mafia family is allegedly in cahoots with a well-known local politician. But the proof lies in several incriminating documents the mafia hid in the neighborhood. Follow the trails, solve intricate mysteries, and conquer challenging tasks that will test your intellect, creativity, and teamwork. Your journey will lead you to explore iconic & unique places , each with its own unique significance and puzzles to solve. Book your adventure now and treat yourself, your friends, or your loved ones to a birthday celebration that transcends time and sparks the spirit of exploration! Are you skilled enough to investigate Boston Mafia's best-kept secrets?",
        "event_link": "https://www.eventbrite.com/e/birthday-game-idea-in-boston-investigate-the-veiled-mafia-secrets-tickets-695482686437",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#party",
            "#friends",
            "#event",
            "#outdoor",
            "#games",
            "#competition",
            "#birthday",
            "#group",
            "#roleplaying",
            "#group_activities"
        ]
    },
    {
        "title": "Boston: The Record Breaker Outdoor Escape Game",
        "date_time": "Starts on Sunday, April 27 · 5am EDT",
        "location": "Boston Public Library 700 Boylston Street Boston, MA 02116 Show map",
        "about": "‘Dinner and a movie’ is so 2021! Especially when the movie is now played out in the real-world. Let us explain! The route you’re going to follow in the city is sprinkled with charming and picturesque places, fun clues and challenges, and romantic stories of past and present. The experience will play out like you’re the main characters of a movie, only that you’re experiencing everything in first person! Fun dialogue, intrigue, and unexpected interactions are guaranteed. Boston has played a central role in U.S. history - being a financial center in the country in the 19th century, when the English came and settled here. You can all probably remember from history class that the American Revolution erupted here. Learn about historical Boston and its standing in the U.S history of being “first in the nation” to build and enact many things. You’ll see the architecturally beautiful Public Library, historic State House, lush Boston Common, and many more historical sites in Boston. Don’t worry, you don’t need to be a historian or have any knowledge of historical Boston to play the game. Anyone up for the adventure can do it – all that’s needed is to download our award-winning app and explore beautiful parts of town at your own pace, chosen to delight and entertain. Do you prefer adventures without tag-alongs? You’ll get complete freedom and privacy, as there aren’t any guides involved in our games. Ready for a break? Take one! You can have a coffee or an ice cream break whenever you want with no pressure to keep going if you need a moment to relax. Ready to continue playing after your break? Just pick up where you left off and get right back into it! A historical Boston walking tour has never been this much fun! HOW IT WORKS❓ 1. Book your tickets 🎫 2. Download the Questo app - it's free 📲 3. Head to the starting point📍 Available 24/7 Pause and resume anytime. WHAT YOU’LL DO The game is an interactive activity where you are guided by a mobile app through the city. With it, you follow directions and solve very fun puzzles, riddles, and cryptic codes. During the game, you will also visit popular and hidden places in the city while learning fun (and we mean it) stories about them. This is a storytelling experience just as much. The people doing these city exploration games gave them an average rating of 4.7/5 around the world. Join the playground too! ------------------ More about Questo 🚶‍♀️ Questo is an urban entertainment platform offering thematic real-world exploration games. It is currently available in over 130 cities 🌎 and has entertained hundreds of thousands of players already. As of today, the app offers more than 300 different experiences created by a growing network of local content creators and event organizers.",
        "event_link": "https://www.eventbrite.com/e/boston-the-record-breaker-outdoor-escape-game-tickets-477497567077",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#outdoors",
            "#outdoor",
            "#urban",
            "#couples",
            "#walking",
            "#group",
            "#escape",
            "#walkingtour",
            "#walking_tour",
            "#treasure_hunt"
        ]
    },
    {
        "title": "Creative Cambridge Amazing Race & Tour",
        "date_time": "Sunday, April 27 · 11am - 1pm EDT",
        "location": "Blue Bottle Coffee 40 Bow Street Cambridge, MA 02138 Show map",
        "about": "Your creative, nontraditional scavenger hunt begins at a scenic spot that's a local favorite. You'll get your digital quest from your live and interactive remote host. Then you’ll take off on your own to experience a wide variety of carefully curated locations in town. You'll walk or drive to the various checkpoints as you interpret creative tasks, accept wacky challenges, and get outside your comfort zone! ONE TICKET PER PERSON. Both family and dog friendly, the game alternates between the indoors and outdoors, with plenty of bonus challenges too! You'll text photos and videos to your remote host, who cheers you on and assists, as you play - to document your progress. You can even interact with the locals to interpret the creative challenges. You won’t be able to avoid having fun, uncovering hidden gems and local secrets, making memories, laughing, and learning along the way! You’ll be part of the rich culture of this dynamic city! Every turn is full of surprises, so questions in advance are welcomed. Check out all 500 of our city hunts! Great for corporate groups, tourists, curious locals, bachelors(ettes), birthdays, families, friend trips, and other special groups! Ask us about our custom-designed experiences and virtual team builders too!",
        "event_link": "https://www.eventbrite.com/e/creative-cambridge-amazing-race-tour-tickets-1082440200779",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Races",
            "Cambridge Travel & Outdoor Races",
            "#tour",
            "#creative",
            "#event",
            "#cambridge",
            "#amazing_race"
        ]
    },
    {
        "title": "A Date Night Adventure! - Back Bay & Beyond",
        "date_time": "April 26 · 8am - April 27 · 12am EDT",
        "location": "95 Clarendon St 95 Clarendon Street Boston, MA 02116 Show map",
        "about": "Get ready to embark on a wicked awesome adventure through the vibrant streets of Boston, Massachusetts! Our scavenger hunt in the Copley/South End neighborhood is the perfect way to explore this historic city while having a blast with your friends and family. From iconic landmarks to hidden gems, this experience will leave you laughing, learning, and craving more. Join us as we journey through time and history, searching for clues at various locations throughout the city. You'll discover quirky sculptures like \"The Tortoise and the Hare,\" explore beautiful green spaces like Frieda Garcia Park, and even visit prestigious institutions like the Benjamin Franklin Institute of Technology and Boston Public Library. With each step, you'll uncover fascinating stories and tidbits about Boston's rich culture and heritage. So what are you waiting for? Grab your tickets now for an unforgettable Boston, Massachusetts scavenger hunt that will have you feeling like a true local. Don't miss out on this exciting opportunity to explore one of America's most historic cities Some of what you'll see: Harriet Tubman Square, Frieda Garcia Park, Franklin Cummings Tech",
        "event_link": "https://www.eventbrite.com/e/a-date-night-adventure-back-bay-beyond-tickets-1067371299289",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Travel & Outdoor Tours",
            "#adventure",
            "#date_night",
            "#couples_night",
            "#back_bay",
            "#couplesdate",
            "#holidaydate",
            "#holidayhunt",
            "#date_adventure",
            "#outdoordate",
            "#weekenddate"
        ]
    },
    {
        "title": "You Sleuth Augmented Reality Detective Experience",
        "date_time": "Starts on Saturday, April 26 · 1pm EDT",
        "location": "Cambridge Your neighborhood 1525 Massachusetts Ave Cambridge, MA 02138 Show map",
        "about": "What is You Sleuth? You Sleuth™ is an all age activity that can be done on your own schedule and in your own neighborhood. This is a self-guided experience played using your smartphones to interact with the virtual characters in the game. Put on your detective hat and shoes and explore your own neighborhood on foot as you gather information about your case and receive phone calls from the Chief of Police. Use the in-game real-world map to find your way to the physical locations of the victim and the suspects so you can interview them. When you have enough facts to eliminate everybody except the crook, make your accusation and receive feedback on your investigation. Where and when does this start? You choose where and when to play! Because You Sleuth™ is a self-guided activity you can play any time on any day and almost anywhere - no reservations required! We recommend going out during daylight hours. Duration averages between 90 minutes and 2 hours. Do I have to bring my ticket? You will only need a mobile device with an Internet connection. All registration is done via our website and you will not have to check in with anyone before you begin as the activity is self-guided. What is the registration process? After purchasing your ticket you MUST follow the registration instructions in your confirmation e-mail to validate your ticket. Please register immediately after you purchase. What is the refund policy? Tickets are valid for 12 months at any location. All sales are final. Questions? Please visit the Help Page on our web site at https://yousleuth.com/faq.php",
        "event_link": "https://www.eventbrite.com/e/you-sleuth-augmented-reality-detective-experience-tickets-130489005127",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Games",
            "Cambridge Travel & Outdoor Games",
            "#family",
            "#outdoors",
            "#outdoor",
            "#games",
            "#walking",
            "#virtual",
            "#things_to_do",
            "#augmented_reality",
            "#virtual_event",
            "#virtual_things_to_do"
        ]
    },
    {
        "title": "Scavenger Hunt Cambridge",
        "date_time": "Starts on Saturday, April 26 · 2pm EDT",
        "location": "Cambridge 1525 Massachusetts Ave Cambridge, MA 02138 Show map",
        "about": "What is It's a Scavenger Hunt!? This Scavenger Hunt is a family friendly activity played by following instructions provided on your mobile device by the in-game host. Fill your virtual scavenger sack with the items you help choose through riddle-like clues! Explore your surroundings, attempting to quickly locate a variety of items as they are revealed one at a time by your game master. What time does this start and finish? Because this game is self-guided by the in-app game master, you can play almost anywhere and at any time on any day - no reservations required! Most groups complete the scavenger hunt in around 90 minutes. Where do we play? You choose where to play! This Scavenger Hunt is designed to be played in a busy populated area like a shopping mall. However, anywhere with a variety of publicly accessible businesses and outdoor spaces is a potential location to play. What is the registration process? After purchasing your ticket you MUST follow the registration instructions in your confirmation e-mail to validate your ticket. Please register online immediately after you purchase. What is the refund policy? All tickets are valid for 12 months and are not time or location specific. All sales are final. Questions? Please visit the Help Page on our web site at https://itsascavengerhunt.com/faq.php",
        "event_link": "https://www.eventbrite.com/e/scavenger-hunt-cambridge-tickets-358913047587",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Games",
            "Cambridge Travel & Outdoor Games",
            "#family",
            "#kids",
            "#games",
            "#scavengerhunt",
            "#scavenge",
            "#scavenger_hunt",
            "#family_friendly",
            "#family_fun",
            "#kids_event",
            "#kids_activities"
        ]
    },
    {
        "title": "Boston Scavenger Hunt Escape: The Golden Shamrock",
        "date_time": "Sunday, April 27 · 10 - 11:30am EDT",
        "location": "North Square North Square Boston, MA 02113 Show map",
        "about": "Boston 's fortune has faltered with the mysterious disappearance of the Golden Shamrock , the city's lucky charm , during the Annual Founders’ Day festival. The city has fallen into chaos: the clocks stopped , the signs fell , the bakery’s bread won’t rise , and the town’s prized fountain ( which flows green every spring ) has dried up . Legend says that when the shamrock is stolen, its power fractures into seven pieces of luck – each hidden in a different part of town , guarded by tricky puzzles, mischievous riddles, and enchanted objects. The only way to restore the balance in the city is to recover all seven pieces before sunset , reassemble the shamrock, and find out who took it… and why! HIGHLIGHTS : 🕵️‍♂️ - YOU are the detective and the phone is your only tool 🎮 - P lay alone or invite all your friends 🏎️ - Start any day, any hour 📍 - Explore 12 locations in Boston and retrieve all the seven pieces of luck 🧩 - Solve intriguing puzzles , decipher c ryptic messages and fix broken mechanisms ⌛ - You have exactly 2 hours to find the Golden Shamrock and save the city 🎟️ - Finish the game and enter the contest for a GOLDEN TICKET to all Questo events in 2025 , anywhere in the world!",
        "event_link": "https://www.eventbrite.com/e/boston-scavenger-hunt-escape-the-golden-shamrock-tickets-1267937468099",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Travel & Outdoor Games",
            "#fun",
            "#kids",
            "#outdoor",
            "#dating",
            "#couples",
            "#walking",
            "#escape",
            "#scavenger_hunt",
            "#family_friendly",
            "#puzzlehunt"
        ]
    }
]