[
    {
        "title": "HBS-MIT LatAm Conference",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "Harvard Business School Klarman Hall Boston, MA 02163 Show map",
        "about": "The HBS-MIT LatAm Conference is the premier student-led event bringing together visionary leaders, entrepreneurs, and changemakers shaping the future of Latin America. This year's theme, \"LatAm Unscripted: Turning Potential into Global Power,\" explores how the region’s immense talent, innovation, and resilience are redefining its role on the world stage. Through thought-provoking panels, fireside chats, and networking opportunities, we will challenge conventional narratives and highlight the untapped opportunities in sectors such as technology, finance, sustainability, and creative industries. Join us as we engage with trailblazers who are breaking barriers, scaling businesses, and driving Latin America’s transformation into a global powerhouse. Date: April 27th, 2025 Location: Harvard Business School & MIT Who Should Attend: Students, professionals, investors, entrepreneurs, and anyone passionate about the future of Latin America. Come be part of the conversation that will shape the next chapter of Latin America’s growth! For more information visit: www.latambc2025.com/tickets",
        "event_link": "https://www.eventbrite.com/e/hbs-mit-latam-conference-tickets-1259772015009?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Business Conferences",
            "#education",
            "#sustainability",
            "#fintech",
            "#mit",
            "#harvard",
            "#openbanking",
            "#latinoamerica",
            "#latinamerica",
            "#private_equity",
            "#harvard_business_school"
        ]
    },
    {
        "title": "A Publishing Industry Community Event!",
        "date_time": "Wednesday, May 7 · 5:30 - 7:30pm EDT",
        "location": "Cambridge Public Library 449 Broadway Cambridge, MA 02138 Show map",
        "about": "Come join the Women's National Book Association-Boston Chapter for an event to learn about the publishing field and network with publishing professionals! The Bookstore as a Community Space In the past few years, Boston has welcomed several new bookstores. Our panelists, from three of these stores will discuss how the stores came to be, how they serve their communities, who they hope to reach, and how authors and publishers work with bookstores to further their goals. Our panel includes: Moderator: Perpetua Cannistraro, Publicist at Beacon Press & WNBA-Boston Publishing Chair Panelists: Christina Pascucci-Ciampa, Owner, All She Wrote Books Franchesca Viaud, Store Manager, Just Book-ish Kayla Januchowski, General Manager, Lovestruck Books The Literary Magazine as Publisher Pangyrus literary magazine publishes online and in print with anthologies and special topic issues. This presentation will share how Pangyrus came to be, what they hope to achieve, and the space they hold in Boston’s publishing community. Presented by Greg Harris, Founding Editor, and Amanda Lewis, Managing Editor. Registration is required. Our last publishing industry event sold out. Attendance is FREE! Register today!",
        "event_link": "https://www.eventbrite.com/e/a-publishing-industry-community-event-tickets-1312337660269?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conventions",
            "Cambridge Business Conventions",
            "#networking",
            "#workshops",
            "#collaboration",
            "#publishing_event",
            "#industry_community"
        ]
    },
    {
        "title": "Above & Beyond Conference 2025",
        "date_time": "May 2 · 7pm - May 3 · 3pm EDT",
        "location": "Reggie Lewis Center 1350 Tremont Street Roxbury Crossing, MA 02120 Show map",
        "about": "Join us in Boston, Massachusetts on May 2 & 3 at the Reggie Lewis Center for this year’s  Above & Beyond Youth Conference. Join youth and young adults from across the United States for two days filled with the power and presence of God. Get your tickets now! Ticket Info: General Admission: $25 - Weekend Access VIP Admission $100 - Weekend Admission - Early Access to all Sessions - Reserved Seating - Welcome Party & Meet & Greet - Gift Bag filled with Limited Edition Merch - Memorial Wristband",
        "event_link": "https://www.eventbrite.com/e/above-beyond-conference-2025-tickets-1031621586937?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Business Conferences",
            "#inspiration",
            "#innovation",
            "#leadership",
            "#above_beyond",
            "#conference_2025"
        ]
    },
    {
        "title": "Networking Night for Boston's Young Professionals",
        "date_time": "Tuesday, April 29 · 6 - 8:30pm EDT",
        "location": "Beehive Restaurant 541 Tremont Street Boston, MA 02116 Show map",
        "about": "Our Networking Night for Young Professionals is where we meet and make new connections with Young Professionals in Boston. Meet other young professionals like yourself to collaborate, exchange ideas, find clients or referrals, learn about a job opening, and most importantly build your network. What to expect: BostonYPA is providing bites to keep you fueled Preprinted name tags, with your name, company and job title Private space just for our event - we have the Mezzanine reserved Registration: Guest Tickets are available $16 in advance, $20 Last Call. This venue does sell out! BostonYPA members attend for free, use the link in your eNewsletter to RSVP A portion of capacity is reserved for Members until the night before. Remaining space will be released to those on the waitlist first, if applicable. This is the right event for you if you want to: Find New Clients or Referrals, or meet other professionals to align with Increase your visibility in the Boston Community Meet with recruiters to learn about their job openings, or network with candidates and job seekers. Connect with key members of BostonYPA and learn more about the Boston Young Professionals Association.",
        "event_link": "https://www.eventbrite.com/e/networking-night-for-bostons-young-professionals-tickets-1296820277359?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#networking",
            "#small_business",
            "#boston_events"
        ]
    },
    {
        "title": "2025 NEWIEE Annual Awards Gala",
        "date_time": "Thursday, May 8 · 6 - 9pm EDT",
        "location": "The Westin Copley Place, Boston 10 Huntington Avenue Boston, MA 02116 Show map",
        "about": "Join us for NEWIEE’s 14th Annual Awards Gala celebrating the accomplishments of women in the energy and environment fields! The Gala draws professionals from across New England for an inspirational evening celebrating distinguished women from New England who have driven change. The evening begins with a networking cocktail hour, followed by a seated dinner during the Gala program, and will conclude with a dessert reception to provide additional networking opportunities. This is an evening not to be missed! Sponsorship opportunities are available. Please contact us at newiee@newiee.org with any questions.",
        "event_link": "https://www.eventbrite.com/e/2025-newiee-annual-awards-gala-tickets-1200311486969?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Galas",
            "Boston Business Galas",
            "#newengland",
            "#womeninenergy",
            "#womeninenvironment"
        ]
    },
    {
        "title": "ProductCamp Boston 2025",
        "date_time": "Friday, May 9 · 9am - 5pm EDT",
        "location": "Hult International Business School 1 Education Street Cambridge, MA 02141 Show map",
        "about": "ProductCamp Boston returns for 2025! Join us for an entire day filled with exciting sessions, networking opportunities, and discussions centered around product management. This in-person event will be held at Hult International Business School , bringing together the grassroots vibe that we always had. Industry professionals, thought leaders, and enthusiasts to share their knowledge and insights. Whether you're a seasoned product manager or just starting out in the field, ProductCamp Boston offers something for everyone. Don't miss out on this fantastic opportunity to learn, connect, and grow in the world of product management. ProductCamp is lead by you, the community. You propose sessions, you vote on them, you lead them and you attend them. Session proposals are now open. You can propose a session here .",
        "event_link": "https://www.eventbrite.com/e/productcamp-boston-2025-tickets-1300060418709?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Business Conferences",
            "#product",
            "#boston",
            "#event",
            "#unconference",
            "#productcamp"
        ]
    },
    {
        "title": "Sponsor the UXPA Boston 2025 Conference",
        "date_time": "Friday, May 9 · 8am - 7pm EDT",
        "location": "Sheraton Boston Hotel 39 Dalton Street Boston, MA 02199 Show map",
        "about": "Sponsor the 23rd Annual UXPA Boston Conference! Our conference is May 9, 2025 , at the Sheraton Boston Hotel . This years conference will have room for even more sponsors - giving attendees the opportunity to network and discover companies that are hiring, meet local design and usability organizations, and try out new technologies and products. Sponsors have more options than ever before to see and be seen, including a Keynote Speaker sponsorship and support for a Local Artist designig the conference materials. Our annual conference attracts over 600 researchers, designers, strategists, managers, product managers, developers, and C-Level executive atendees from all across New England. Theme of the Conference: Shaping Change: Design for a Dynamic World Have a product to demonstrate? Looking to hire? Be hired? Thought leadership to share? Make a splash at the conference with a booth, high visibility, presentation, and/or the emotional kick participants will get from seeing the food, fun swag, helpful information (and more) that you provide on site! All paid sponsorships include: Logo Inclusion in conference materials, conference website, on-site digital signage and/or printed materials when received prior to established publication dates Online exposure through conference website, emails, & social media Access to conference attendee opt-in email list. For booth sponsorship levels: Booth staff are welcome to attend sessions, have lunch, and participate fully in the event as their booth schedules allow. For booth sponsorship levels: Sponsors may substitute the provided exhibit tables for their own similarly sized booths or exhibit space decorations with notice to the conference team and subsequent coordination with the hotel logistics team. Title Sponsorship : $10,000 (Limit 1) Exhibit table in vendor area with linens, wi-fi access, electricity, and exclusive size logo (largest) on signage, including printed and online materials Opportunity to display banner in the main lobby area (Banner not provided) Eight (8) complementary passes for booth staff and attendees to participate in the event Discount code for additional colleague registrations at the early bird rate past the early bird registration deadline Priority logo placement on all physical and digital conference materials (provided we receive them in advance of printing deadlines) Keynote Speaker Sponsorship : $10,000 (Limit 1) Exhibit table in vendor area with linens, wi-fi access, and exclusive size logo (largest) on signage/printed and online materials Opportunity to display banner on main stage (Banner not provided) Eight (8) complementary passes, which includes four (4) expo passes (for people staffing the expo booth) and eight (8) complimentary registrations (to attend the event) Discount code for additional colleague registrations at the early bird rate past the early bird registration deadline Priority logo placement on all conference materials physical and digital conference materials (provided we receive them in advance of printing deadlines) Design Sponsorship : $7,500 Support a local artist designing of all conference materials including the event logo, print and digital content, nametags, event signage, and other materials. Have your company logo on the back of the official conference shirt worn by conference volunteers to identify you as a patron of the arts Six (6) complementary passes Platinum : $5,000 (Limit 6) Exhibit table in vendor area with linens, wi-fi access, electricity Large size logo on signage/printed and online materials Six (6) complementary passes Discount code for additional registrations for colleagues & clients at early bird rate Gold : $2,500 Exhibit table in vendor area with linens, wi-fi access, electricity Medium size logo on signage/printed and online materials Four (4) complementary passes Discount code for additional registrations for colleagues & clients at early bird rate Silver : $1,250 Exhibit table in vendor area with linens, wi-fi access, electricity Small size logo on signage/printed and online materials Two (2) complementary passes Bronze : $500 Small size logo on signage/printed and online materials One (1) complementary pass Charging Station : $1,900 Your logo on the phone/device charging station provided by the hotel Two (2) complementary passes Session Sponsorships : $2,500 A sponsored session allows your organization to use a presentation room for up to 45 minutes during the conference. The room may be set up lecture style, for product demonstration, or with tables for collaboration as you prefer. Cost includes permission to record the session and mention the UXPA Boston conference name [SOLD] Lanyard Sponsorship : $1,000 plus production costs Have your company logo on the conference lanyard worn by every presenter, sponsor, attendee, and volunteer at the conference [HALF SOLD] Coffee Sleeve/Beverage Sponsorship : $1,000 plus production costs (Limit 2, Morning & Afternoon) Your company’s logo on the coffee cup sleeves provided for attendees’ coffee cups . That’s a lot of caffeinated visibility! In-Kind Donations We accept donations of software, discounts, online tools, books, T-shirts, and other items to serve as giveaways during the conference. Companies who wish to give away physical items must handle shipping logistics themselves. In-kind donations are typically raffled off in-person via announcements, social media challenges, and other on-site engagements. Companies that donate items to the conference will get their logo on our online schedule page and a special thank you during the event. Code of Conduct Anyone attending a UXPA Boston event is expected to review and adhere to our code of conduct .",
        "event_link": "https://www.eventbrite.com/e/sponsor-the-uxpa-boston-2025-conference-tickets-1048790770427?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Business Conferences",
            "#boston",
            "#design",
            "#conference",
            "#research",
            "#ux",
            "#sponsor",
            "#uxresearch",
            "#uxpa",
            "#ux_design",
            "#uxui_design"
        ]
    },
    {
        "title": "TECHSPO Boston 2025 Technology Expo (Internet ~ AdTech ~ MarTech)",
        "date_time": "June 9 · 9am - June 10 · 4pm EDT",
        "location": "The Westin Copley Place Boston Hotel 10 Huntington Ave Boston, MA 02116 Show map",
        "about": "About TECHSPO Boston 2025 Where Business, Tech and Innovation Collide in Boston! TECHSPO Boston 2025 is your chance to … – Check out exhibitors showcasing the next generation of technology & innovation. – Be inspired, amazed and educated on how these evolving technologies will impact your business for greater growth. – Interact with technology enthusiasts, build your network and reunite with your peers. The 4th annual TECHSPO Boston, two-day technology expo returns June 9th and 10th, 2025 to the luxurious Westin Copley Place Boston Hotel in Boston, Massachusetts. TECHSPO Boston brings together some of the best developers, brands, marketers, technology providers, designers, innovators and evangelists looking to set the pace in our advanced world of technology. Watch exhibitors showcase the next generation of advances in technology & innovation, including; Internet, Mobile, AdTech, MarTech and SaaS technologies. Be prepared to be inspired, amazed and educated on how these evolving technologies will impact your business for greater growth. As part of TECHSPO Boston is a limited attendance paid event, DigiMarCon New England 2025 Digital Marketing, Media and Advertising Conference ( https://digimarconnewengland.com ). If the conference is where the learning, theory and inspiration happens, then the TECHSPO floor is where the testing, networking and product interaction takes place. For complete details visit https://techspoboston.com .",
        "event_link": "https://www.eventbrite.com/e/techspo-boston-2025-technology-expo-internet-adtech-martech-tickets-1002112564657?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Expos",
            "Boston Business Expos",
            "#marketing",
            "#tech",
            "#technology",
            "#boston",
            "#saas",
            "#expo",
            "#internet",
            "#tradeshow",
            "#martech",
            "#adtech"
        ]
    },
    {
        "title": "Developing Boston: 2025 & Beyond",
        "date_time": "Wednesday, May 7 · 8 - 11am EDT",
        "location": "Federal Reserve Plaza 600 Atlantic Avenue Boston, MA 02210 Show map",
        "about": "Developing Boston: 2025 & Beyond Wednesday May 7, 2025 8:00 AM - 11:00 AM Boston Federal Reserve Plaza Montgomery Room, 4th Floor 600 Atlantic Avenue, Boston, MA Join us for an exclusive real estate and urban development forum, “Developing Boston: 2025 & Beyond,” featuring expert insights from top industry leaders. This event will explore Boston’s future urban planning, investment opportunities, and challenges in the current high-interest rate environment. Engage in discussions with city planners, investment executives, and real estate professionals as they share their perspectives on upcoming projects shaping the city’s future. Ticket Price & Membership Benefits This is a members-only event , and the $100 ticket fee serves as the membership fee . As a member, you’ll receive free access to four quarterly events in New York and free or discounted access to the remaining three quarterly events in Boston in 2025 . Apply for membership here: Membership Application — AREPA Save on Event Fees: To avoid paying the Eventbrite transaction fee, sign up for an AREPA membership and you’ll receive a promotional code for free registration. Registration Deadline: April 25th Limited tickets available—secure yours before they sell out. Industry Partners We are proud to be supported by the following industry partners: Boston Appraisal & Consulting Brookline Bank Colliers Eagle Bank East West Bank Hinckley Allen HYM Landvest Consulting Legal 1031 Exchange Needham Bank NT Development Stewart Title Program Agenda 8:00 to 8:30 AM – Registration/Breakfast/Networking 8:30 AM – Welcome Introduction (Paul Briggs, CRE New England Chapter President; Thomas Jensen, CRE Chapter Program Committee Co-Chair) 8:35 AM – Introduction to the Counselors of Real Estate (John Hentschel, 2025 CRE Global Chair; Mary Fleischmann, CRE Global President/CEO) 8:55 AM – Introduction to the Asian Real Estate Professionals Association (Margaret Ling AREPA NY BOD Member) 9:05 AM – Kairos Shen, Chief of Planning, City of Boston Planning Department will provide an overview of the City of Boston Planning Department, the permitting process, and the goals of the department. 9:30 AM - Douglas Manz, Partner & Chief Investment Officer, HYM Investment Group will provide an overview of their Government Center Garage and Suffolk Downs projects as well as discuss the challenges currently facing new development in Boston. 10:10 AM –Thomas Welch, Executive VP, Colliers Capital Markets Group will discuss how new development projects obtain construction financing in the current high interest rate environment. 10:30 AM – There will be roundtable discussion with the speakers taking questions from attendees. 11:00 AM Closing Comments",
        "event_link": "https://www.eventbrite.com/e/developing-boston-2025-beyond-tickets-1292874595719?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Business Conferences",
            "#boston",
            "#innovation",
            "#future",
            "#development",
            "#2025"
        ]
    },
    {
        "title": "Our Kind of Investing: Cooperative Finance in the Hands of Black Women",
        "date_time": "Monday, May 5 · 6 - 8pm EDT",
        "location": "Frugal Bookstore 57 Warren Street Boston, MA 02119 Show map",
        "about": "Join us for a book talk with Dr. Caroline Hossein, Boston Ujima Project's 2024-25 Black Feminist Economics Fellow, as she discusses her book, The Banker Ladies: Vanguards of Solidarity Economics and Community-Based Banks . Dr. Hossein examines how Black and racialized women have long been at the forefront of informal banking systems, building collective wealth through mutual aid and cooperative finance. This talk will explore the power of community-based banking, its role in economic justice, and how these historical practices continue to shape solidarity economies today. This event is free and open to the public. Seating is available on a first-come, first-served basis, so we encourage you to arrive early. About the Speaker Caroline Shenaz Hossein is an associate professor of Global Development and Political Economy at the University of Toronto Scarborough; Canada Research Chair, Tier 2 of Africana Development and Feminist Political Economy; and Founder of the Diverse Solidarity Economies (DISE) Collective. In 2024, Dr. Hossein was named Boston Ujima Project's 2024-25 Black Feminist Economics fellow. About the Boston Ujima Project THE BOSTON UJIMA PROJECT is a democratic, member-run organization building cooperative business, arts and investment ecosystem in Boston, with a mission to return wealth to working class communities of color. Ujima is bringing together neighbors, workers, business owners, investors, grassroots organizers, and culture-makers, to create a community-controlled economy in our city.",
        "event_link": "https://www.eventbrite.com/e/our-kind-of-investing-cooperative-finance-in-the-hands-of-black-women-tickets-1295848420509?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Business Seminars",
            "#event",
            "#discussion",
            "#talk",
            "#banker_ladies",
            "#dr_caroline_hossein"
        ]
    },
    {
        "title": "Annual Arabian Gulf Conference at Harvard 2025",
        "date_time": "N/A",
        "location": "Harvard University Massachusetts Hall Cambridge, MA 02138 Show map",
        "about": "The Arabian Gulf Conference at Harvard 2025, organized by Harvard Arabian Gulf Student Association (HAGSA), will take place from May 1-3, 2025 on the Harvard University campus. Designed to spark meaningful conversations, drive innovation, and encourage collaboration among professionals, students, subject matter experts and industry leaders from the region and beyond. With the theme “Honoring Heritage, Inspiring Innovation,” the conference celebrates the region’s cultural and historical while tackling modern challenges in Entrepreneurship & Investment, Non-Profit & Public Policy, Science & Technology, Law, Energy, Healthcare, Sports and Arts & Culture. The conference aims to establish itself as a leading annual forum to delve into conversations around the Arabian Gulf at Harvard, attracting top-tier speakers and stakeholders committed to shaping the region’s future. Beyond the event, HAGSA seeks to build stronger ties between Harvard and the region and create a sustained intellectual and professional network. Another key objective is to reshape global perceptions of the Arabian Gulf, showcasing its contributions to innovation, economic development, and cultural diplomacy. Panels: Sports Segment Transforming Sports in the Arabian Gulf: From Regional Leagues to Global Recognition Arts & Culture Segment The Landscape of Cultural Production in the Gulf: Institutions and Intangible Heritage Contemporary Gulf Art: Music, Theatre, and Film Entrepreneurship & Inestment Segment GCC Visions: Driving Business Innovation in the Region Family business: Firm strategy and multigenerational wealth management Non Profit & Public Policy Segment Future-proofing the Gulf: Climate Change and Urban Design Empowering Youth: Social Policy in the Gulf States Sustainability of Non Profit Organizations Innovating Social Impact: Nonprofit Strategies Education Policy in the Gulf: Opportunities and Outcomes Healthcare Segment AI in Healthcare: Revolutionizing Diagnosis and Treatment in the GCC Powering healthcare: Access, efficacy and inclusion The Future of Healthcare at Home: Redefining Patient Care in the GCC Bridging Borders: Advancing Word-Class Healthcare in the GCC through Global Collaboration Science & Technology Segment Research Across Borders: Collaboration between GCC and International Partners Powering the Future: Al and Data Centers in Energy Transition",
        "event_link": "https://www.eventbrite.com/e/annual-arabian-gulf-conference-at-harvard-2025-tickets-1284268725329?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Business Conferences",
            "#harvard",
            "#2025",
            "#academic_conference",
            "#annual_event",
            "#arabian_gulf_conference"
        ]
    },
    {
        "title": "14th Annual Jobs Rebuild Boston: Community Conference and Career Fair",
        "date_time": "Thursday, June 5 · 10am - 4pm EDT",
        "location": "Reggie Lewis Track and Athletic Center 1350 Tremont St. Roxbury, MA 02119 Show map",
        "about": "Join The Urban League of Eastern Massachusetts for our 14th Annual Jobs Rebuild Boston: Community Conference and Career Fair. This signature event attracts employers in high-demand industries who are seeking diverse and skilled talent in Boston and throughout Eastern Massachusetts. The Career Fair and Community Conference provides a strategic venue for companies to make direct contact with prospective employees. It's also an opportunity for colleges and training programs to recruit potential students for advanced education and certification programs in high demand industries. REGISTER TODAY! Registration for Job Seekers is FREE Registration is required EMPLOYER EARLY BIRD SALE through May 15th SCHEDULE: 10 AM - 12 PM: Community Conference -Networking opportunities with industry leaders and organizations. Opportunity to participate in workshops and experience panel discussions focused on key issues in workforce development. 12 PM - 1 PM: Employer Luncheon with Keynote Speaker, Ron Marlow 1 - 4 PM: Job Fair -Job Seekers have the opportunity to meet commonwealth companies seeking candidates for employment opportunities. EMPLOYER EARLY BIRD SALE THROUGH MAY 15, 2025 Corporate Tables $695 -- NOW ONLY $300 Non-profit/Government Tables $395 -- NOW ONLY $150 For more information about partnerships, please contact William Watkins at wwatkins@ulem.org. To learn more about The Urban League of Eastern Massachusetts, visit www.ULEM.org",
        "event_link": "https://www.eventbrite.com/e/14th-annual-jobs-rebuild-boston-community-conference-and-career-fair-tickets-1254860544669?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Business Conferences"
        ]
    },
    {
        "title": "Fieldday 2025: New England's Conference on Landscape Architecture",
        "date_time": "Friday, May 23 · 8:30am - 8pm EDT",
        "location": "Northeastern University Interdisciplinary Science and Engineering Complex 805 Columbus Avenue Boston, MA 02120 Show map",
        "about": "Welcome to Fieldday! We invite the landscape architecture community of New England and beyond to gather for a robust day of education, inspiration, and connection. Fieldday is the annual, in-person conference for landscape architects and design and construction professionals across our region. Horticulturalists, arborists, architects, engineers, planners, developers, policy makers, academics, green industry leaders; practitioners who create residential gardens to regional parks, outdoor spaces large to small; urban to rural, forest to meadow, river to coast… All who design, make, and care for landscape architecture in New England: this is for you. The Fieldday conference will be followed by a series of outdoor, on-site walking tours at a variety of locations throughout New England. . FRIDAY, MAY 23 : The Conference 8:30 Registration and Coffee 9:00 Kickoff (also livestreamed) 9:30 Climate Action Lightning Talks (also livestreamed) 11:15 Workshops 1 ( all talks + sessions are listed here ) 12:15 Lunch 1:00 Workshops 2 2:00 Workshops 3 3:30 Closing Session (also livestreamed) 5:00 Reception . Immediately following the conference 6:00 New England Chapter dinners and/or BSLA Design Awards celebration Attendees are invited to keep the spirit going through evening meetups with others from the New England chapters or by staying for the 2025 BSLA Design Awards. Chapter dinners will be ticketed or paid for separately. All recent New England design awards will be recognized during the conference. . SATURDAY, MAY 24 in the Boston area and throughout the summer across the region : \"Inside/Out\" Site Tours Site Tours are FREE but tickets are separate and pre-registration will be required. Exact locations and sign up link coming soon. Rain or shine! . . . Fieldday 2025 is happening in-person at Northeastern University with the New England Climate Action Lighting Talks also livestreamed. The day is expected to offer 6.5 LACES HSW. (Status: pending). Most sessions have been submitted for AIA CES credit too. For Workshop + Site Tour descriptions, speakers, continuing ed credit details + more, visit BSLAnow.org/fieldday . More info is added daily! Conference tickets are all-inclusive and include all educational sessions PLUS lunch, coffee, and the end-of-day reception , with great food and drinks (21+). DISCOUNT: Buying three or more tickets? Contact conference@bslanow.org for a multi-ticket discount and skip the eventbrite fees, too. If you prefer to be invoiced directly (rather than eventbrite) email gretchen@bslanow.org. \"Early Bird\" rates through May 9.",
        "event_link": "https://www.eventbrite.com/e/fieldday-2025-new-englands-conference-on-landscape-architecture-tickets-1296872804469?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Business Conferences",
            "#architecture",
            "#conference",
            "#landscape",
            "#fieldday",
            "#newengland",
            "#landscape_design",
            "#landscape_architecture",
            "#climate_action",
            "#climate_solutions",
            "#green_industry"
        ]
    },
    {
        "title": "BVS' Showcase in Partnership with Related Beal-Seaport District",
        "date_time": "Thursday, June 5 · 11am - 1:30pm EDT",
        "location": "Boston Design Center (BDC), 4th Floor 17 Drydock Avenue Boston, MA 02210 Show map",
        "about": "BVS in partnership with Related Beal, LLC inviting you to our Biotech Community Event in the heart of Boston's Seaport district. Mark your calendars for a great opportunity to connect with industry leaders, explore innovative products, and mingle with fellow professionals in the biotech community. We are inviting all research scientists from the institutes, biotech/pharma, and other companies in the Seaport district and surrounding areas to attend this event. ✨ What to Expect: Vendor Exhibits : Discover a diverse range of exhibitors showcasing cutting-edge technology and services in the biotech space. Networking Opportunities : Engage with fellow industry experts, forge new connections, and exchange ideas that could shape the future of biotech. Delicious Food & Drinks : Enjoy delicious refreshments as you network and explore the vendor exhibits. FREE to life science job-related employees (including executives, purchasing, scientists, clinical, manufacturing, etc.) at life science companies and research institutes. Product and Service providers that sell to the life science community, BVS and non-BVS suppliers, lawyers, consultants, etc. will pay a $200.00 fee to attend, which doesn’t include an exhibitor table. We are looking forward to seeing everyone.",
        "event_link": "https://www.eventbrite.com/e/bvs-showcase-in-partnership-with-related-beal-seaport-district-tickets-1292797394809?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking"
        ]
    },
    {
        "title": "Sunset Soiree Network Event",
        "date_time": "Sunday, April 27 · 1:30 - 5pm EDT.Doors at 1:30pm",
        "location": "Boloco - 50 Congress Street 50 Congress Street Boston, MA 02109 Show map",
        "about": "Join us on Saturday, April 27th at 1:30 PM for Sunset Soirée, An all-women’s spring brunch Whether you’re looking to network, promote your business, or just vibe with amazing women over mimosas and good music — this is the space for you. Come dressed to impress, ready to laugh, sip, share stories, and spark new opportunities. What to expect: Delicious brunch bites & unlimited mimosa A beautiful, Instagram-worthy setup Business promo opportunities & networking Good vibes, great music, and even better company This is more than a brunch — it’s a celebration of womanhood, ambition, and joy. Grab your girls (or come solo and leave with new friends) — either way, you don’t want to miss this!",
        "event_link": "https://www.eventbrite.com/e/sunset-soiree-network-event-tickets-1247777549239?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Business Parties",
            "#brunch",
            "#party",
            "#boston",
            "#cocktails",
            "#socializing",
            "#brunchparty",
            "#business_connections",
            "#boston_events",
            "#network_event",
            "#sunset_soiree"
        ]
    },
    {
        "title": "Design to Sell: Enhancing Home Value Through Interior Design",
        "date_time": "Wednesday, May 7 · 6 - 9pm EDT",
        "location": "Minotti Boston 210 Stuart Street Boston, MA 02116 Show map",
        "about": "Join IFDA New England for an insightful panel discussion on how interior design can play a crucial role in the home-selling process. Whether you're a designer, real estate professional, or homeowner, this event will explore strategies for staging, renovations, and design investments that maximize a home's appeal and market value.",
        "event_link": "https://www.eventbrite.com/e/design-to-sell-enhancing-home-value-through-interior-design-tickets-1307522387659?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Business Seminars",
            "#socialmedia"
        ]
    },
    {
        "title": "PIOW ERG Leadership Summit at the Boston Spirit Networking Night",
        "date_time": "Wednesday, May 14 · 5 - 6:30pm EDT",
        "location": "Boston Marriott Copley Place 110 Huntington Avenue Boston, MA 02116 Show map",
        "about": "Welcome to the PIOW ERG Leadership Summit at the Boston Spirit Networking Night ! Join us for an exciting in-person event at the Boston Marriott Copley Place from 5-6:30pm and then join the Boston Spirit Networking Night event with keynote panel with panelists from GLAD Law, HRC, and ACLU. Registration to both events is included in this ticket. The summit will include 2 compelling sessions for the PIOW community: 🔹 Navigating the Changing DEI & LGBTQ+ Workplace Landscape How ERGs Can Stay Resilient Amid Legislative Rollbacks and Corporate DEI Cutbacks 🔹 Making the Business Case for LGBTQ+ Inclusion - How to Align ERG Goals with Company Priorities to Secure Leadership Buy-In and Funding This summit is your chance to connect with ERG leaders and DEIB professionals, learn best practices, and grow your network. Don't miss out on this opportunity to elevate your leadership skills and make valuable connections. See you there!",
        "event_link": "https://www.eventbrite.com/e/piow-erg-leadership-summit-at-the-boston-spirit-networking-night-tickets-1267476158309?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#boston",
            "#leadership",
            "#spirit",
            "#summit",
            "#erg",
            "#piowerg",
            "#piow"
        ]
    },
    {
        "title": "Tech Networking Event by Startup Valley  in Boston",
        "date_time": "Wednesday, April 30 · 7 - 10pm EDT",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Hi there! 🚀 Dear Participants! Join our event in Boston! Meet and network with Tech & Business Proffesionals, Influencers and AI experts. Pitch to the audience with your Startup and seize your chance to dive into the world of business, technology, and venture capital. 💡 Why You Can't-Miss It: Engage with leading experts and founders in the Tech & Business, and top investors to gain deep insights and valuable networking. This event is a must-attend for those looking to gain ideas, experience, and valuable connections. 📈 Present Your Startup in the Tech & Business: Showcase your startup in the Tech & Business! Email your pitch deck to contact.us@startupvalley.club and seize the opportunity to impress both the audience and investors! Also, you need to fill out the application to participate as a pitcher/speaker at the event. Apply now! 💼 We Welcome New Investors: We invite investors to our event to expand their network, get acquainted with new startups, evaluate them, provide their feedback, participate in discussions, and gain access to a database of fresh startups from around the world. 🎤Startup Presentations in the Tech & Business and Expert Evaluations: Startups from various industries, prepare for your moment of glory with a 5-minute presentation scheduled for 07:30 PM, followed by invaluable feedback from our panel of venture capitalists and angel investors. The startup that is deemed \"Most Investment-Worthy\" will receive special recognition on our social media channels and will be featured in a newsletter for our investor base for consideration. 🏆 Who will you meet at the event: Founders Investors or VC companies Marketers, Salespeople, Business Advisers Game changers AI Experts Entrepreneurs from Europe, Asia, and the United Kingdom Requirements to attendants: 21+ years old Neat appearance Good mood 1 drink bought at the bar (non-alcohol works too) 🤝The venue where we host our events is our partner. To continue hosting events at this location, please consider purchasing 1-2 drinks at the bar. Thank you. Time: Event time: 7:00 -10:00 PM Pitch time: 8:40 -9:20 PM 🎟Join our event, and secure your ticket today!✨ Sincerely, Startup Valley Team",
        "event_link": "https://www.eventbrite.com/e/tech-networking-event-by-startup-valley-in-boston-tickets-1303515713589?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#career",
            "#tech",
            "#technology",
            "#boston",
            "#entrepreneurship",
            "#startup",
            "#investors",
            "#funding",
            "#pitch",
            "#meetnewpeople"
        ]
    },
    {
        "title": "Fashion and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Fashion and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in fashion and business? Want to elevate your career? Meet Consultants, Analysts, Designers, Entrepreneurs, and more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/fashion-and-business-networking-elevating-your-potential-boston-tickets-1256783777109?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "Impact Investing Club Membership Dues 2024-25",
        "date_time": "Saturday, May 31 · 10am - 12pm EDT",
        "location": "Harvard Business School 117 Western Ave Boston, MA 02163 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/impact-investing-club-membership-dues-2024-25-tickets-1008321455617?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#impact_investing",
            "#sustainable_finance",
            "#financial_inclusion",
            "#club_membership",
            "#dues_2024_25"
        ]
    },
    {
        "title": "A Publishing Industry Community Event!",
        "date_time": "Wednesday, May 7 · 5:30 - 7:30pm EDT",
        "location": "Cambridge Public Library 449 Broadway Cambridge, MA 02138 Show map",
        "about": "Come join the Women's National Book Association-Boston Chapter for an event to learn about the publishing field and network with publishing professionals! The Bookstore as a Community Space In the past few years, Boston has welcomed several new bookstores. Our panelists, from three of these stores will discuss how the stores came to be, how they serve their communities, who they hope to reach, and how authors and publishers work with bookstores to further their goals. Our panel includes: Moderator: Perpetua Cannistraro, Publicist at Beacon Press & WNBA-Boston Publishing Chair Panelists: Christina Pascucci-Ciampa, Owner, All She Wrote Books Franchesca Viaud, Store Manager, Just Book-ish Kayla Januchowski, General Manager, Lovestruck Books The Literary Magazine as Publisher Pangyrus literary magazine publishes online and in print with anthologies and special topic issues. This presentation will share how Pangyrus came to be, what they hope to achieve, and the space they hold in Boston’s publishing community. Presented by Greg Harris, Founding Editor, and Amanda Lewis, Managing Editor. Registration is required. Our last publishing industry event sold out. Attendance is FREE! Register today!",
        "event_link": "https://www.eventbrite.com/e/a-publishing-industry-community-event-tickets-1312337660269",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conventions",
            "Cambridge Business Conventions",
            "#networking",
            "#workshops",
            "#collaboration",
            "#publishing_event",
            "#industry_community"
        ]
    },
    {
        "title": "Above & Beyond Conference 2025",
        "date_time": "May 2 · 7pm - May 3 · 3pm EDT",
        "location": "Reggie Lewis Center 1350 Tremont Street Roxbury Crossing, MA 02120 Show map",
        "about": "Join us in Boston, Massachusetts on May 2 & 3 at the Reggie Lewis Center for this year’s  Above & Beyond Youth Conference. Join youth and young adults from across the United States for two days filled with the power and presence of God. Get your tickets now! Ticket Info: General Admission: $25 - Weekend Access VIP Admission $100 - Weekend Admission - Early Access to all Sessions - Reserved Seating - Welcome Party & Meet & Greet - Gift Bag filled with Limited Edition Merch - Memorial Wristband",
        "event_link": "https://www.eventbrite.com/e/above-beyond-conference-2025-tickets-1031621586937",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Business Conferences",
            "#inspiration",
            "#innovation",
            "#leadership",
            "#above_beyond",
            "#conference_2025"
        ]
    },
    {
        "title": "2025 NEWIEE Annual Awards Gala",
        "date_time": "Thursday, May 8 · 6 - 9pm EDT",
        "location": "The Westin Copley Place, Boston 10 Huntington Avenue Boston, MA 02116 Show map",
        "about": "Join us for NEWIEE’s 14th Annual Awards Gala celebrating the accomplishments of women in the energy and environment fields! The Gala draws professionals from across New England for an inspirational evening celebrating distinguished women from New England who have driven change. The evening begins with a networking cocktail hour, followed by a seated dinner during the Gala program, and will conclude with a dessert reception to provide additional networking opportunities. This is an evening not to be missed! Sponsorship opportunities are available. Please contact us at newiee@newiee.org with any questions.",
        "event_link": "https://www.eventbrite.com/e/2025-newiee-annual-awards-gala-tickets-1200311486969",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Galas",
            "Boston Business Galas",
            "#newengland",
            "#womeninenergy",
            "#womeninenvironment"
        ]
    },
    {
        "title": "ProductCamp Boston 2025",
        "date_time": "Friday, May 9 · 9am - 5pm EDT",
        "location": "Hult International Business School 1 Education Street Cambridge, MA 02141 Show map",
        "about": "ProductCamp Boston returns for 2025! Join us for an entire day filled with exciting sessions, networking opportunities, and discussions centered around product management. This in-person event will be held at Hult International Business School , bringing together the grassroots vibe that we always had. Industry professionals, thought leaders, and enthusiasts to share their knowledge and insights. Whether you're a seasoned product manager or just starting out in the field, ProductCamp Boston offers something for everyone. Don't miss out on this fantastic opportunity to learn, connect, and grow in the world of product management. ProductCamp is lead by you, the community. You propose sessions, you vote on them, you lead them and you attend them. Session proposals are now open. You can propose a session here .",
        "event_link": "https://www.eventbrite.com/e/productcamp-boston-2025-tickets-1300060418709",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Business Conferences",
            "#product",
            "#boston",
            "#event",
            "#unconference",
            "#productcamp"
        ]
    },
    {
        "title": "HBS-MIT LatAm Conference",
        "date_time": "Sunday, April 27 · 8am - 5pm EDT",
        "location": "Harvard Business School Klarman Hall Boston, MA 02163 Show map",
        "about": "The HBS-MIT LatAm Conference is the premier student-led event bringing together visionary leaders, entrepreneurs, and changemakers shaping the future of Latin America. This year's theme, \"LatAm Unscripted: Turning Potential into Global Power,\" explores how the region’s immense talent, innovation, and resilience are redefining its role on the world stage. Through thought-provoking panels, fireside chats, and networking opportunities, we will challenge conventional narratives and highlight the untapped opportunities in sectors such as technology, finance, sustainability, and creative industries. Join us as we engage with trailblazers who are breaking barriers, scaling businesses, and driving Latin America’s transformation into a global powerhouse. Date: April 27th, 2025 Location: Harvard Business School & MIT Who Should Attend: Students, professionals, investors, entrepreneurs, and anyone passionate about the future of Latin America. Come be part of the conversation that will shape the next chapter of Latin America’s growth! For more information visit: www.latambc2025.com/tickets",
        "event_link": "https://www.eventbrite.com/e/hbs-mit-latam-conference-tickets-1259772015009",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Business Conferences",
            "#education",
            "#sustainability",
            "#fintech",
            "#mit",
            "#harvard",
            "#openbanking",
            "#latinoamerica",
            "#latinamerica",
            "#private_equity",
            "#harvard_business_school"
        ]
    },
    {
        "title": "Sunset Soiree Network Event",
        "date_time": "Sunday, April 27 · 1:30 - 5pm EDT.Doors at 1:30pm",
        "location": "Boloco - 50 Congress Street 50 Congress Street Boston, MA 02109 Show map",
        "about": "Join us on Saturday, April 27th at 1:30 PM for Sunset Soirée, An all-women’s spring brunch Whether you’re looking to network, promote your business, or just vibe with amazing women over mimosas and good music — this is the space for you. Come dressed to impress, ready to laugh, sip, share stories, and spark new opportunities. What to expect: Delicious brunch bites & unlimited mimosa A beautiful, Instagram-worthy setup Business promo opportunities & networking Good vibes, great music, and even better company This is more than a brunch — it’s a celebration of womanhood, ambition, and joy. Grab your girls (or come solo and leave with new friends) — either way, you don’t want to miss this!",
        "event_link": "https://www.eventbrite.com/e/sunset-soiree-network-event-tickets-1247777549239",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Business Parties",
            "#brunch",
            "#party",
            "#boston",
            "#cocktails",
            "#socializing",
            "#brunchparty",
            "#business_connections",
            "#boston_events",
            "#network_event",
            "#sunset_soiree"
        ]
    },
    {
        "title": "Networking Night for Boston's Young Professionals",
        "date_time": "Tuesday, April 29 · 6 - 8:30pm EDT",
        "location": "Beehive Restaurant 541 Tremont Street Boston, MA 02116 Show map",
        "about": "Our Networking Night for Young Professionals is where we meet and make new connections with Young Professionals in Boston. Meet other young professionals like yourself to collaborate, exchange ideas, find clients or referrals, learn about a job opening, and most importantly build your network. What to expect: BostonYPA is providing bites to keep you fueled Preprinted name tags, with your name, company and job title Private space just for our event - we have the Mezzanine reserved Registration: Guest Tickets are available $16 in advance, $20 Last Call. This venue does sell out! BostonYPA members attend for free, use the link in your eNewsletter to RSVP A portion of capacity is reserved for Members until the night before. Remaining space will be released to those on the waitlist first, if applicable. This is the right event for you if you want to: Find New Clients or Referrals, or meet other professionals to align with Increase your visibility in the Boston Community Meet with recruiters to learn about their job openings, or network with candidates and job seekers. Connect with key members of BostonYPA and learn more about the Boston Young Professionals Association.",
        "event_link": "https://www.eventbrite.com/e/networking-night-for-bostons-young-professionals-tickets-1296820277359",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#networking",
            "#small_business",
            "#boston_events"
        ]
    },
    {
        "title": "Tech Networking Event by Startup Valley  in Boston",
        "date_time": "Wednesday, April 30 · 7 - 10pm EDT",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Hi there! 🚀 Dear Participants! Join our event in Boston! Meet and network with Tech & Business Proffesionals, Influencers and AI experts. Pitch to the audience with your Startup and seize your chance to dive into the world of business, technology, and venture capital. 💡 Why You Can't-Miss It: Engage with leading experts and founders in the Tech & Business, and top investors to gain deep insights and valuable networking. This event is a must-attend for those looking to gain ideas, experience, and valuable connections. 📈 Present Your Startup in the Tech & Business: Showcase your startup in the Tech & Business! Email your pitch deck to contact.us@startupvalley.club and seize the opportunity to impress both the audience and investors! Also, you need to fill out the application to participate as a pitcher/speaker at the event. Apply now! 💼 We Welcome New Investors: We invite investors to our event to expand their network, get acquainted with new startups, evaluate them, provide their feedback, participate in discussions, and gain access to a database of fresh startups from around the world. 🎤Startup Presentations in the Tech & Business and Expert Evaluations: Startups from various industries, prepare for your moment of glory with a 5-minute presentation scheduled for 07:30 PM, followed by invaluable feedback from our panel of venture capitalists and angel investors. The startup that is deemed \"Most Investment-Worthy\" will receive special recognition on our social media channels and will be featured in a newsletter for our investor base for consideration. 🏆 Who will you meet at the event: Founders Investors or VC companies Marketers, Salespeople, Business Advisers Game changers AI Experts Entrepreneurs from Europe, Asia, and the United Kingdom Requirements to attendants: 21+ years old Neat appearance Good mood 1 drink bought at the bar (non-alcohol works too) 🤝The venue where we host our events is our partner. To continue hosting events at this location, please consider purchasing 1-2 drinks at the bar. Thank you. Time: Event time: 7:00 -10:00 PM Pitch time: 8:40 -9:20 PM 🎟Join our event, and secure your ticket today!✨ Sincerely, Startup Valley Team",
        "event_link": "https://www.eventbrite.com/e/tech-networking-event-by-startup-valley-in-boston-tickets-1303515713589",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#career",
            "#tech",
            "#technology",
            "#boston",
            "#entrepreneurship",
            "#startup",
            "#investors",
            "#funding",
            "#pitch",
            "#meetnewpeople"
        ]
    },
    {
        "title": "Tech and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Tech and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in tech and business? Want to elevate your career? Meet Consultants, Analysts of all types, Bankers, Software Engineers, Entrepreneurs, and more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/tech-and-business-networking-elevating-your-potential-boston-tickets-1256783957649?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "Healthcare and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Healthcare and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in healthcare and business? Want to elevate your career? Meet Medical Professionals, Consultants, Researchers, Pioneers in the Field, and more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/healthcare-and-business-networking-elevating-your-potential-boston-tickets-1256783937589?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "GBNEMBA May Chapter Meeting - Seven Cycles Watertown",
        "date_time": "Tuesday, May 6 · 6:30 - 8pm EDT",
        "location": "Seven Cycles 125 Walnut Street ## 101 Watertown, MA 02472 Show map",
        "about": "GBNEMBA's monthly chapter meeting to meet up with friends - old and new - learn about upcoming engagement opportunities, rides, trail work, and volunteer activities.",
        "event_link": "https://www.eventbrite.com/e/gbnemba-may-chapter-meeting-seven-cycles-watertown-tickets-1269678706189?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Watertown Town, MA",
            "Watertown Town Networking",
            "Watertown Town Business Networking",
            "#event",
            "#agenda",
            "#greaterboston",
            "#template",
            "#meeting_room",
            "#chapter_meeting",
            "#great_boston_nemba"
        ]
    },
    {
        "title": "Etiquette with Amy:  Personal Branding and the Baby-Sitters Club",
        "date_time": "Monday, May 5 · 6:30 - 8pm EDT",
        "location": "The College Club of Boston 44 Commonwealth Avenue Boston, MA 02116 Show map",
        "about": "Join Read Far & Wide and Mrs Meyers Etiquette for a discussion of personal branding through the lens of classic Baby Sitters’ Club series. How do we develop a personal brand and why is it important? Having a “brand” projects confidence, professionalism and authenticity which help professional and personal relationships flourish. If you were a child of the 90’s think of Kristy, Mary Ann, Claudia and Stacey, the members of the Baby Sitters’ Club. Their personal brands allowed them to build a successful business. Amy Meyers will discuss the importance of curating your on-line image, the importance of presence, the first 7 seconds, and all the non-verbal and verbal signals that make you approachable and trustworthy. As the girls of the Baby Sitters’ Club each had distinctive characteristics, you too can and should be a brand. All are welcome regardless of Baby Sitters' Club knowledge!",
        "event_link": "https://www.eventbrite.com/e/etiquette-with-amy-personal-branding-and-the-baby-sitters-club-tickets-1328505257989?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Business Classes",
            "#boston",
            "#etiquette",
            "#personal_branding",
            "#baby_sitters_club"
        ]
    },
    {
        "title": "CoWorking Day (Seaport)",
        "date_time": "Wednesday, May 7 · 9am - 5pm EDT",
        "location": "Capital One Café 57 Seaport Boulevard Boston, MA 02210 Show map",
        "about": "Work from home, but not at home! We supply the coffee (your choice of any coffee on the cafe menu) and well appointed work space while you work side by side with other professionals that want a break from isolation or a refreshing alternative to their apartment. In the Seaport, we have the second floor reserved with work tables and 2 small rooms to share for phone calls or a quick collab. What's included: Any coffee on the cafe menu for all attendees Lunch provided for BostonYPA members who arrive by 11am Meeting rooms that can be reserved for 30 or 60 minutes You might make a new friend to have lunch with, a new contact to collaborate with, or keep your head down and headphones in while you plug away. Attend for the full day, part of the day, leave for a meeting and come back - your choice, we'll have a seat for you. Capacity is limited, advance RSVP is required. No cost for BostonYPA Members (rsvp in advance, your ticket is unlocked with the link in your newsletter)",
        "event_link": "https://www.eventbrite.com/e/coworking-day-seaport-tickets-1313263700079?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#networking",
            "#boston",
            "#event",
            "#coworking",
            "#workspace"
        ]
    },
    {
        "title": "DigiMarCon New England 2025 - Digital Marketing Conference & Exhibition",
        "date_time": "June 9 · 9am - June 10 · 7pm EDT",
        "location": "The Westin Copley Place Boston Hotel 10 Huntington Ave Brooklyn Boston, MA 02116 Show map",
        "about": "DigiMarCon New England 2025 is your chance to ... – Hear from some of the most audacious and thought-provoking speakers in the digital marketing, media and advertising industry. – Gain insight into emerging strategies, the latest innovative technologies, and best practices to move your business to the next level. – Network with thought leaders, reunite with your peers, and build your professional network. The 5th annual DigiMarCon New England, the Premier Digital Marketing, Media and Advertising Conference & Exhibition in the New England Region, returns June 9th and 10th, 2025 to The Westin Copley Place Boston Hotel in Boston, Massachusetts. Join your peers in-person or online for 2-days jam-packed with digital marketing best practices, latest trends, practical solutions, strategy, and networking, also check out the next generation of technology & innovation; Internet, Mobile, AdTech, MarTech & SaaS Technology. Expand your knowledge on the following topics: Artificial Intelligence & ChatGPT, Marketing Automation, Account-Based Marketing, Behavioral & Neuromarketing, Content Marketing, Conversational Marketing, Conversion Rate Optimization, Data Science & Big Data, Email Marketing, Geo-Targeting & Proximity Marketing, Growth Hacking, Inbound & Outbound Marketing, Influencer Marketing, Mobile Marketing, Native & Contextual Advertising, Omnichannel Marketing, Paid Search Marketing, Personalization & Privacy. You’ll also learn the following: Podcast & Webinar Marketing, PR & Cause Marketing, Predictive Analytics & Attribution, Programmatic Advertising, Sales & Marketing Automation, Search Engine Optimization, Shopper Marketing, Marketing & Customer Experience, Social Commerce, Social Media Marketing, UI / UX Design, User-Generated Content, Video Marketing, Viral & Buzz Marketing, Visual & Voice Search, Web Analytics, and much more! At DigiMarCon New England 2025, you will receive all the elements you need to achieve digital marketing success! Conventional thoughts will be challenged, and new ways of thinking will emerge. You will leave with your head, notebooks, and professional toolkit full of action items and ideas to lead and supercharge your agency/team/account to even greater success. Be a part of DigiMarCon New England 2025 and discover how to thrive and succeed as a marketer in a rapidly evolving digital world. Top keynotes, case studies, strategy sessions, and networking! See why people keep coming back year after year to this must-attend event! Register and secure your seat today. For more details visit https://digimarconnewengland.com .",
        "event_link": "https://www.eventbrite.com/e/digimarcon-new-england-2025-digital-marketing-conference-exhibition-tickets-997378785797?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Business Conferences",
            "#marketing",
            "#boston",
            "#sales",
            "#digitalmarketing",
            "#internet",
            "#socialmedia",
            "#videomarketing",
            "#onlinemarketing",
            "#contentmarketing",
            "#searchmarketing"
        ]
    },
    {
        "title": "Mix & Mingle Career Connections",
        "date_time": "Monday, April 28 · 6 - 9pm EDT.Doors at 6:45pm",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Mix & Mingle Career Connections: Build Your Future, One Conversation at a Time! Step into a night of opportunity at Mix & Mingle Career Connections ! This event is designed for professionals, job seekers, and entrepreneurs eager to expand their networks, explore new opportunities, and exchange ideas in a welcoming and dynamic atmosphere. Whether you're looking for career growth, valuable partnerships, or meaningful connections, this is your chance to engage with like-minded individuals and take the next step in your professional journey. Expect engaging conversations, potential collaborations, and a room filled with motivated individuals ready to connect and grow together. Why Attend? Expand your network by meeting professionals, recruiters, and entrepreneurs eager to collaborate. This is a great opportunity to exchange ideas, discuss industry trends, and make valuable connections that can support your career or business. Discover new opportunities that could lead to career advancements, business partnerships, or personal growth. Whether you're actively looking for a job, seeking new clients, or just wanting to expand your network, this event is the perfect place to find what you need. Boost your visibility in Boston’s thriving business and career community. Making the right connections can open doors to exciting opportunities and new professional relationships to help you achieve your goals. Engage and learn from key members of The Boston Business Hub dedicated to supporting business and professional success. Gain insights, share your expertise, and leave with valuable takeaways. What to Expect Check-in at the entrance and receive your name tag to make introductions easier. Meet professionals across various industries and engage in meaningful conversations that could create exciting new opportunities. Food and drinks are available for purchase at the bar, so you can keep the energy up as you network. Enjoy a lively, collaborative atmosphere where motivated individuals come together to share ideas, build relationships, and create new possibilities. This isn’t just another networking event—it’s an opportunity to build meaningful connections, spark new collaborations, and take your career or business to the next level. Reserve your spot today and make every conversation count! Bar Moxy 240 Tremont Street Boston, MA 02116 6:00PM – Business Professionals The Boston Business Hub The Boston Business Hub connects entrepreneurs and young professionals with a network of 27,500 people across the Boston area. Our platform is designed to foster genuine connections and provide valuable training opportunities for those looking to grow their businesses or advance their careers. Founded in 2016, we’ve spent years building a trusted space where ideas are shared, skills are sharpened, and collaborations thrive. Whether you’re starting out or scaling up, The Boston Business Hub is here to support your journey. https://bostonbh.com/",
        "event_link": "https://www.eventbrite.com/e/mix-mingle-career-connections-tickets-1316456519889?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#career",
            "#business",
            "#networking",
            "#sales",
            "#connection",
            "#mixandmingle",
            "#career_development",
            "#career_change"
        ]
    },
    {
        "title": "Engineering and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Engineering and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in engineering and business? Want to elevate your career? Meet Consultants, Analysts, Engineers of all types, and more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/engineering-and-business-networking-elevating-your-potential-boston-tickets-1256714279239?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "Boston Area Craft Business Meetup",
        "date_time": "Thursday, May 29 · 2 - 4pm EDT",
        "location": "Arts Collaborative Medford 162 Mystic Avenue #1 Medford, MA 02155 Show map",
        "about": "Welcome to the Boston Area Craft Business Meetup ! Join us at Arts Collaborative Medford for a fun and informative event where craft business owners from the Boston area can connect, learn, and grow together. Whether you're just starting out or have been in the business for years, this meetup is the perfect place to network and share ideas with fellow craft business owners. Jenny Rushmore of Cashmerette Patterns will share some inspiring words about her business journey. Then there will be plenty of time to hang out and chat. We can't wait to see you there!",
        "event_link": "https://www.eventbrite.com/e/boston-area-craft-business-meetup-tickets-1237831650789?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Medford, MA",
            "Medford Networking",
            "Medford Business Networking",
            "#business",
            "#boston",
            "#meetup",
            "#craft",
            "#area"
        ]
    },
    {
        "title": "Startup Pitch & Networking Boston",
        "date_time": "Wednesday, April 30 · 7 - 10pm EDT",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Hi there! 🚀 Dear Participants! Join our event in Boston! Meet and get acquainted with Startup Founders, Business Professionals and Investors. Pitch to the audience with your project and seize your chance to dive into the world of business, technology, and venture capital. 💡 Why You Can't-Miss It: Engage with leading experts and founders in the Tech & Business, and top investors to gain deep insights and valuable networking. This event is a must-attend for those looking to gain ideas, experience, and valuable connections. 📈 Present Your Startup in the Tech & Business: Showcase your startup in the Tech & Business! Email your pitch deck to contact.us@startupvalley.club and seize the opportunity to impress both the audience and investors! Also, you need to fill out the application to participate as a pitcher/speaker at the event. Apply now! 💼 We Welcome New Investors: We invite investors to our event to expand their network, get acquainted with new startups, evaluate them, provide their feedback, participate in discussions, and gain access to a database of new and promising startups from around the world. If you're interested in attending our event as an investor, please register through this link If you'd like access to a database of promising startup projects and additional benefits from Startup Valley, please fill out this application, and our team will contact you: this link 🎤Startup Presentations in the Tech & Business and Expert Evaluations: Startups from various industries, prepare for your moment of glory with a 5-minute presentation scheduled for 07:30 PM, followed by invaluable feedback from our panel of venture capitalists and angel investors. Who will you meet at the event: Founders Investors or VC companies Marketers, Salespeople, Business Advisers Game changers AI Experts Entrepreneurs from Europe, Asia, and the United Kingdom Requirements to attendants: Neat appearance Good mood 1 drink bought at the bar (non-alcohol works too) 🤝The venue where we host our events is our partner. To continue hosting events at this location, please consider purchasing 1-2 drinks at the bar. Thank you. Time: Event time: 7:00 -10:00 PM Pitch time: 8:40 -9:20 PM 🎟Join our event, and secure your ticket today!✨ Sincerely, Startup Valley",
        "event_link": "https://www.eventbrite.com/e/startup-pitch-networking-boston-tickets-1303515783799?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#career",
            "#networking",
            "#marketing",
            "#investment",
            "#boston",
            "#startup",
            "#entrepreneur",
            "#pitch",
            "#inperson",
            "#business_growth"
        ]
    },
    {
        "title": "Finance and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Finance and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in finance and business? Want to elevate your career? Meet Consultants, Analysts of all types, Bankers, Accountants, Lenders, Entrepreneurs, and more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/finance-and-business-networking-elevating-your-potential-boston-tickets-1256710186999?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "Scaling Up Workshop - Boston, MA\t  -MB",
        "date_time": "Tuesday, May 6 · 8am - 5pm EDT",
        "location": "Boston Boston Boston, MA Show map",
        "about": "Join our exclusive workshop designed for CEOs and senior leaders, presented by Assured Strategy! This intensive session offers a unique opportunity for growth-focused executives to gain insights and practical tools for driving company success. Led by distinguished business coaches Michele Barry and Jeff Oskin , participants will engage in challenging discussions and learn the tactics that have been proven effective in hundreds of companies. Key Benefits Enhance team accountability and operational efficiency Master the art of effective leadership and coaching Identify and cater to your core customer base Develop actionable goals for measurable results Foster a culture of accountability and financial acumen This is not just a theoretical session; expect to leave with actionable insights and the confidence to implement immediate changes. Our guarantee is simple: tangible value or your money back. Event Details Target Audience: Senior Leadership Teams Format: Interactive, hands-on approach with tools for immediate application Refund Policy: Full refund available (conditions apply) Includes: Breakfast, lunch, and potential SHRM Certification Join us for a transformative experience that promises real results for your business! www.assuredstrategy.com SHRM Certification Assured Strategy is a SHRM (Society for Human Resource Management) Certified Organization. If you require a SHRM Certification for the completion of this event, one will be provided upon request. CPE Credited About Coach and Speaker Michele Barry Michele brings 30 years of diverse experience, including over 13,000 hours of coaching as well as expert facilitation to C-level executives, leadership teams, Boards of Directors, and other leaders. She specializes in leadership development, executive coaching, and organizational culture and business strategy consulting.",
        "event_link": "https://www.eventbrite.com/e/scaling-up-workshop-boston-ma-mb-tickets-1000370594377?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Business Classes",
            "#workshop",
            "#event",
            "#leadership",
            "#business_growth",
            "#business_development",
            "#business_coaching",
            "#business_strategy",
            "#business_plan",
            "#business_professional"
        ]
    },
    {
        "title": "Young Professional Moonlight Mixer — Boston Business Hub",
        "date_time": "Monday, April 28 · 6 - 9pm EDT.Doors at 5:50pm",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Make sure you don't miss our biggest event of the month! Join us for an evening dedicated to connecting Boston’s most ambitious and driven young professionals. Whether you're scaling your career, growing your business, or looking to expand your circle of influence, this is the place to make it happen. Set in the chic and energetic bar space, the event provides the perfect backdrop to transition from casual introductions to impactful conversations. Network with like-minded individuals, exchange ideas and discover opportunities to collaborate—all while enjoying a vibrant and sophisticated atmosphere. Are you seeking fresh connections, exciting collaborations, or engaging discussions with like-minded individuals? In a warm and welcoming environment, you’ll feel right at home as you cultivate relationships that could shape your future. Step out of the daily grind, immerse yourself in the energy of the evening, and let this night be the start of something extraordinary. Your next breakthrough connection is waiting—don’t miss it! What Awaits You: Check in at the entrance to grab your name tag. Food and drinks available for purchase at the bar. A room filled with ambitious professionals eager to connect, grow, and collaborate. Perfect For You If You Want To: Find new clients, referrals, or professional partners. Strengthen your presence in Boston’s professional scene. Meet recruiters, explore job opportunities, or connect with candidates. Engage with key members of The Boston Business Hub and discover resources to elevate your business. Mark your calendar and join us for an unforgettable night of networking, inspiration, and growth. See you there! Bar Moxy 240 Tremont Street Boston, MA 02116 6:00PM – Business Professionals The Boston Business Hub The Boston Business Hub connects entrepreneurs and young professionals with a network of 27,500 people across the Boston area. Our platform is designed to foster genuine connections and provide valuable training opportunities for those looking to grow their businesses or advance their careers. Founded in 2016, we’ve spent years building a trusted space where ideas are shared, skills are sharpened, and collaborations thrive. Whether you’re starting out or scaling up, The Boston Business Hub is here to support your journey. https://bostonbh.com/",
        "event_link": "https://www.eventbrite.com/e/young-professional-moonlight-mixer-boston-business-hub-tickets-1230502308529?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#social",
            "#networking",
            "#marketing",
            "#event",
            "#socialevents",
            "#career_growth",
            "#young_professional",
            "#networking_night",
            "#boston_business_hub"
        ]
    },
    {
        "title": "Boynton Yards' Biotech Community Block Party in Somerville",
        "date_time": "Thursday, May 29 · 4 - 6:30pm EDT",
        "location": "Boynton Yards 808 Windsor Street Somerville, MA 02143 Show map",
        "about": "We are very excited to invite you to the Boynton Yards' Biotech Community Block Party! Mark your calendars for a great opportunity to connect with industry leaders, explore innovative products, and mingle with fellow professionals in the biotech community. We are inviting all research scientists from the institutes, biotech/pharma, and other companies in Somerville, and surrounding areas to attend this event. ✨ What to Expect: Vendor Exhibits : Discover a diverse range of exhibitors showcasing cutting-edge technology and services in the biotech space. Networking Opportunities : Engage with fellow industry experts, forge new connections, and exchange ideas that could shape the future of biotech. Delicious Food & Drinks : Enjoy delicious refreshments along with local beer and seltzer, as you network and explore the vendor exhibits. Building Tours at 808 Windsor: Get a behind-the-scenes look at 808 Windsor, a state-of-the-art, 370,000-square-foot R&D building that’s now ready for lease. Discover the spaces built to support the future of biotech. This is a wonderful chance for everyone to come together, share insights, and celebrate the vibrant biotech landscape. FREE to life science job-related employees (including executives, purchasing, scientists, clinical, manufacturing, etc.) at life science companies and research institutes. Product and Service Providers that sell to the life science community, BVS suppliers, lawyers, consultants, etc. will pay a $200.00 fee to attend , which doesn’t include an exhibitor table. Exhibitor tables can be purchased separately . Please feel free to invite others in the community who could benefit from attending. We look forward to seeing you there!",
        "event_link": "https://www.eventbrite.com/e/boynton-yards-biotech-community-block-party-in-somerville-tickets-1329071983079?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Networking",
            "Somerville Business Networking"
        ]
    },
    {
        "title": "General Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'General Business Networking', Boston's hottest networking event! We are set in the perfect central location for all to join. Are you interested in business? Want to elevate your career? Meet Consultants, Analysts of all types, Bankers, Software Engineers, Entrepreneurs, and more who are active in the space or are eager to get started. **This will be a multi-vertical event** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/general-business-networking-elevating-your-potential-boston-tickets-1256714309329?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "After 5 Social @ The Point",
        "date_time": "Tuesday, May 13 · 6 - 8pm EDT",
        "location": "The Point 147 Hanover Street Boston, MA 02109 Show map",
        "about": "Come out to unwind after a long day at work (or WFH) to reconnect and meet new friends This month we're meeting at The Point, with the 2nd Floor reserved just for us. What's included at the event: Light Appetizers Mix and Mingle with BostonYPA members, and Boston's best young professionals The 2nd floor is reserved just for us at 6PM We can stay to enjoy the comedy show (starts at 9) with our new friends! Everyone else in the room is there to meet you! Get up...move around...MINGLE and you'll meet and make great friends and connections. Registration Members: This event is included in BostonYPA Membership; please RSVP in advance using the member ticket so we can plan properly. Guests: Guest fee is $15 in advance, $20 Last Call & At the Door Wondering how to become a paid member? Visit www.BostonYPA.com to learn more about our Membership options!",
        "event_link": "https://www.eventbrite.com/e/after-5-social-the-point-tickets-1313261724169?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Business Parties",
            "#bostonnightlife",
            "#boston_events"
        ]
    },
    {
        "title": "(WIN) at Apex Industry Network Night",
        "date_time": "Monday, May 19 · 6 - 11:59pm EDT",
        "location": "Apex Noire 150 state street boston, MA 02215 Show map",
        "about": "(WIN) at Apex Industry Network Night ⭐️ Join us for an exciting night of networking and celebration at Apex Noire- Boston's FIRST black-owned dispensary, owned by former city councilman Tito Jackson! 🌐 At a 30-person capacity, this event is intentionally designed to be small and exclusive to create the perfect environment for making solid connections. 🍺 🍴🥘 We would like to bring together women in the food, beverage, nightlife, hospitality, bar, distillery, and brewery industries to network, share, and grow. Whether you’re a restaurant owner, manager, Sioux chef, sommelier, bartender, mixologist, distributor, server, or hostess, this space is for you! 🌆 From 6 to 9 PM, enjoy a curated networking experience downstairs with catered bites from a featured female-owned restaurant and a live DJ setting the vibe. 🌃 At 9 PM, we’ll take the party to the rooftop for a fun, energetic vibe with music, drinks, and city views—without the chaos. What to expect: A curated networking experience from 6–9 PM in the lounge Rooftop afterparty from 9 PM–12 AM with city views DJs in both spaces to keep the energy flowing Catered bites to keep you fueled while you mingle A supportive and uplifting environment for women-led businesses",
        "event_link": "https://www.eventbrite.com/e/win-at-apex-industry-network-night-tickets-1309747232229?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#industry"
        ]
    },
    {
        "title": "Entrepreneur Networking Boston",
        "date_time": "Monday, April 28 · 6 - 9pm EDT.Doors at 1pm",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Entrepreneur Networking Boston – Build Connections, Create Opportunities Join Entrepreneur Networking Boston , where business owners, entrepreneurs, and professionals come together to connect, collaborate, and grow. This event is designed for those eager to expand their networks, share insights, and explore new business opportunities in a dynamic and engaging setting. Whether you're looking for strategic partnerships, career opportunities, or industry insights, this is the perfect space to meet like-minded professionals and strengthen your presence in Boston’s thriving business community. Why Attend? ✅ Expand Your Network – Connect with ambitious entrepreneurs and professionals ready to collaborate. ✅ Discover Opportunities – Find potential clients, business partners, and career prospects. ✅ Increase Visibility – Build credibility and establish stronger industry connections. ✅ Gain Valuable Insights – Access resources and support from Boston Business Hub to drive success. What to Expect 🔹 Check-in upon arrival and receive your name tag for seamless networking. 🔹 A vibrant atmosphere filled with motivated professionals ready to exchange ideas. 🔹 A welcoming space designed to foster collaboration and lasting relationships. Seats are limited—reserve your spot today and start building meaningful connections! Bar Moxy 240 Tremont Street Boston, MA 02116 6:00PM – Business Professionals The Boston Business Hub The Boston Business Hub connects entrepreneurs and young professionals with a network of 27,500 people across the Boston area. Our platform is designed to foster genuine connections and provide valuable training opportunities for those looking to grow their businesses or advance their careers. Founded in 2016, we’ve spent years building a trusted space where ideas are shared, skills are sharpened, and collaborations thrive. Whether you’re starting out or scaling up, The Boston Business Hub is here to support your journey. https://bostonbh.com/",
        "event_link": "https://www.eventbrite.com/e/entrepreneur-networking-boston-tickets-1316454373469?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#networking",
            "#entrepreneurs",
            "#boston",
            "#startup_business"
        ]
    },
    {
        "title": "D'LUX: Guided Tour and Luxury Business Mixer",
        "date_time": "Saturday, May 3 · 6:30 - 9:30pm EDT",
        "location": "Hibernian Hall 184 Dudley Street #200 Boston, MA 02119 Show map",
        "about": "Visionary Acts presents a completely unique event featuring a guided tour with Live Like A Local Tours Boston . Following the tour, attendees will be whisked away via a charter bus to an exclusive D'LUX Networking Mixer hosted in partnership with 1 Hour Party at the beautiful, historical Hiberian Hall located in the heart of Roxbury. Unwind at the lively mixer which is the perfect setting to network, socialize and enjoy Boston’s vibrant nightlife. This exclusive experience combines cultural discovery with exciting opportunities to meet new people and build connections, making it an unforgettable day in Western Mass and Boston! What to expect on the Full Tour: Once you're on the tour, all you have to do is sit back and enjoy the activities (w ear comfortable shoes) . Games & Raffles will happen throughout the tour. Refreshments and light appetizers will be served before the tour begins A walkthrough the National Center for Afro-American Artists to learn and view wonderful and impactful art. After, We'll stop and grab some light patties from P&R Jamaican Restaurant Quick spirit experience with Boston's brewery and distiller, Long Live Roxbury & Boston Harbor Distillery . Before heading to the Mixer, we'll stop at The Mix and enjoy a variety of appetizers, such as: lobster sliders, salmon sliders, wings, and more! Lastly, you'll have an hour before the mixer to get ready! What to expect at the D'LUX Mixer: The room is industry-agnostic . Meeting talent from other industries inspires a new perspective. No name tags . First and foremost, we focus on real connections. Connections happen when the vibe is right. Drinks and food will be served . Adult beverages available and bar bites are always a staple. Media: Photos, Video, and 360 Spinner Booth Live Music by Motivate Merren Raffles, & More! For Sponsorships, contact visionaryacts1@gmail.com",
        "event_link": "https://www.eventbrite.com/e/dlux-guided-tour-and-luxury-business-mixer-tickets-1114665607839?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Business Tours",
            "#networking",
            "#tour",
            "#mixer",
            "#boston",
            "#massachusetts",
            "#springfield"
        ]
    },
    {
        "title": "Tech and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Tech and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in tech and business? Want to elevate your career? Meet Consultants, Analysts of all types, Bankers, Software Engineers, Entrepreneurs, and more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/tech-and-business-networking-elevating-your-potential-boston-tickets-1256783957649",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "Healthcare and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Healthcare and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in healthcare and business? Want to elevate your career? Meet Medical Professionals, Consultants, Researchers, Pioneers in the Field, and more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/healthcare-and-business-networking-elevating-your-potential-boston-tickets-1256783937589",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "GBNEMBA May Chapter Meeting - Seven Cycles Watertown",
        "date_time": "Tuesday, May 6 · 6:30 - 8pm EDT",
        "location": "Seven Cycles 125 Walnut Street ## 101 Watertown, MA 02472 Show map",
        "about": "GBNEMBA's monthly chapter meeting to meet up with friends - old and new - learn about upcoming engagement opportunities, rides, trail work, and volunteer activities.",
        "event_link": "https://www.eventbrite.com/e/gbnemba-may-chapter-meeting-seven-cycles-watertown-tickets-1269678706189",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Watertown Town, MA",
            "Watertown Town Networking",
            "Watertown Town Business Networking",
            "#event",
            "#agenda",
            "#greaterboston",
            "#template",
            "#meeting_room",
            "#chapter_meeting",
            "#great_boston_nemba"
        ]
    },
    {
        "title": "Etiquette with Amy:  Personal Branding and the Baby-Sitters Club",
        "date_time": "Monday, May 5 · 6:30 - 8pm EDT",
        "location": "The College Club of Boston 44 Commonwealth Avenue Boston, MA 02116 Show map",
        "about": "Join Read Far & Wide and Mrs Meyers Etiquette for a discussion of personal branding through the lens of classic Baby Sitters’ Club series. How do we develop a personal brand and why is it important? Having a “brand” projects confidence, professionalism and authenticity which help professional and personal relationships flourish. If you were a child of the 90’s think of Kristy, Mary Ann, Claudia and Stacey, the members of the Baby Sitters’ Club. Their personal brands allowed them to build a successful business. Amy Meyers will discuss the importance of curating your on-line image, the importance of presence, the first 7 seconds, and all the non-verbal and verbal signals that make you approachable and trustworthy. As the girls of the Baby Sitters’ Club each had distinctive characteristics, you too can and should be a brand. All are welcome regardless of Baby Sitters' Club knowledge!",
        "event_link": "https://www.eventbrite.com/e/etiquette-with-amy-personal-branding-and-the-baby-sitters-club-tickets-1328505257989",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Business Classes",
            "#boston",
            "#etiquette",
            "#personal_branding",
            "#baby_sitters_club"
        ]
    },
    {
        "title": "Mix & Mingle Career Connections",
        "date_time": "Monday, April 28 · 6 - 9pm EDT.Doors at 6:45pm",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Mix & Mingle Career Connections: Build Your Future, One Conversation at a Time! Step into a night of opportunity at Mix & Mingle Career Connections ! This event is designed for professionals, job seekers, and entrepreneurs eager to expand their networks, explore new opportunities, and exchange ideas in a welcoming and dynamic atmosphere. Whether you're looking for career growth, valuable partnerships, or meaningful connections, this is your chance to engage with like-minded individuals and take the next step in your professional journey. Expect engaging conversations, potential collaborations, and a room filled with motivated individuals ready to connect and grow together. Why Attend? Expand your network by meeting professionals, recruiters, and entrepreneurs eager to collaborate. This is a great opportunity to exchange ideas, discuss industry trends, and make valuable connections that can support your career or business. Discover new opportunities that could lead to career advancements, business partnerships, or personal growth. Whether you're actively looking for a job, seeking new clients, or just wanting to expand your network, this event is the perfect place to find what you need. Boost your visibility in Boston’s thriving business and career community. Making the right connections can open doors to exciting opportunities and new professional relationships to help you achieve your goals. Engage and learn from key members of The Boston Business Hub dedicated to supporting business and professional success. Gain insights, share your expertise, and leave with valuable takeaways. What to Expect Check-in at the entrance and receive your name tag to make introductions easier. Meet professionals across various industries and engage in meaningful conversations that could create exciting new opportunities. Food and drinks are available for purchase at the bar, so you can keep the energy up as you network. Enjoy a lively, collaborative atmosphere where motivated individuals come together to share ideas, build relationships, and create new possibilities. This isn’t just another networking event—it’s an opportunity to build meaningful connections, spark new collaborations, and take your career or business to the next level. Reserve your spot today and make every conversation count! Bar Moxy 240 Tremont Street Boston, MA 02116 6:00PM – Business Professionals The Boston Business Hub The Boston Business Hub connects entrepreneurs and young professionals with a network of 27,500 people across the Boston area. Our platform is designed to foster genuine connections and provide valuable training opportunities for those looking to grow their businesses or advance their careers. Founded in 2016, we’ve spent years building a trusted space where ideas are shared, skills are sharpened, and collaborations thrive. Whether you’re starting out or scaling up, The Boston Business Hub is here to support your journey. https://bostonbh.com/",
        "event_link": "https://www.eventbrite.com/e/mix-mingle-career-connections-tickets-1316456519889",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#career",
            "#business",
            "#networking",
            "#sales",
            "#connection",
            "#mixandmingle",
            "#career_development",
            "#career_change"
        ]
    },
    {
        "title": "Young Professional Moonlight Mixer — Boston Business Hub",
        "date_time": "Monday, April 28 · 6 - 9pm EDT.Doors at 5:50pm",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Make sure you don't miss our biggest event of the month! Join us for an evening dedicated to connecting Boston’s most ambitious and driven young professionals. Whether you're scaling your career, growing your business, or looking to expand your circle of influence, this is the place to make it happen. Set in the chic and energetic bar space, the event provides the perfect backdrop to transition from casual introductions to impactful conversations. Network with like-minded individuals, exchange ideas and discover opportunities to collaborate—all while enjoying a vibrant and sophisticated atmosphere. Are you seeking fresh connections, exciting collaborations, or engaging discussions with like-minded individuals? In a warm and welcoming environment, you’ll feel right at home as you cultivate relationships that could shape your future. Step out of the daily grind, immerse yourself in the energy of the evening, and let this night be the start of something extraordinary. Your next breakthrough connection is waiting—don’t miss it! What Awaits You: Check in at the entrance to grab your name tag. Food and drinks available for purchase at the bar. A room filled with ambitious professionals eager to connect, grow, and collaborate. Perfect For You If You Want To: Find new clients, referrals, or professional partners. Strengthen your presence in Boston’s professional scene. Meet recruiters, explore job opportunities, or connect with candidates. Engage with key members of The Boston Business Hub and discover resources to elevate your business. Mark your calendar and join us for an unforgettable night of networking, inspiration, and growth. See you there! Bar Moxy 240 Tremont Street Boston, MA 02116 6:00PM – Business Professionals The Boston Business Hub The Boston Business Hub connects entrepreneurs and young professionals with a network of 27,500 people across the Boston area. Our platform is designed to foster genuine connections and provide valuable training opportunities for those looking to grow their businesses or advance their careers. Founded in 2016, we’ve spent years building a trusted space where ideas are shared, skills are sharpened, and collaborations thrive. Whether you’re starting out or scaling up, The Boston Business Hub is here to support your journey. https://bostonbh.com/",
        "event_link": "https://www.eventbrite.com/e/young-professional-moonlight-mixer-boston-business-hub-tickets-1230502308529",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#social",
            "#networking",
            "#marketing",
            "#event",
            "#socialevents",
            "#career_growth",
            "#young_professional",
            "#networking_night",
            "#boston_business_hub"
        ]
    },
    {
        "title": "Entrepreneur Networking Boston",
        "date_time": "Monday, April 28 · 6 - 9pm EDT.Doors at 1pm",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Entrepreneur Networking Boston – Build Connections, Create Opportunities Join Entrepreneur Networking Boston , where business owners, entrepreneurs, and professionals come together to connect, collaborate, and grow. This event is designed for those eager to expand their networks, share insights, and explore new business opportunities in a dynamic and engaging setting. Whether you're looking for strategic partnerships, career opportunities, or industry insights, this is the perfect space to meet like-minded professionals and strengthen your presence in Boston’s thriving business community. Why Attend? ✅ Expand Your Network – Connect with ambitious entrepreneurs and professionals ready to collaborate. ✅ Discover Opportunities – Find potential clients, business partners, and career prospects. ✅ Increase Visibility – Build credibility and establish stronger industry connections. ✅ Gain Valuable Insights – Access resources and support from Boston Business Hub to drive success. What to Expect 🔹 Check-in upon arrival and receive your name tag for seamless networking. 🔹 A vibrant atmosphere filled with motivated professionals ready to exchange ideas. 🔹 A welcoming space designed to foster collaboration and lasting relationships. Seats are limited—reserve your spot today and start building meaningful connections! Bar Moxy 240 Tremont Street Boston, MA 02116 6:00PM – Business Professionals The Boston Business Hub The Boston Business Hub connects entrepreneurs and young professionals with a network of 27,500 people across the Boston area. Our platform is designed to foster genuine connections and provide valuable training opportunities for those looking to grow their businesses or advance their careers. Founded in 2016, we’ve spent years building a trusted space where ideas are shared, skills are sharpened, and collaborations thrive. Whether you’re starting out or scaling up, The Boston Business Hub is here to support your journey. https://bostonbh.com/",
        "event_link": "https://www.eventbrite.com/e/entrepreneur-networking-boston-tickets-1316454373469",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#networking",
            "#entrepreneurs",
            "#boston",
            "#startup_business"
        ]
    },
    {
        "title": "Startup Pitch & Networking Boston",
        "date_time": "Wednesday, April 30 · 7 - 10pm EDT",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Hi there! 🚀 Dear Participants! Join our event in Boston! Meet and get acquainted with Startup Founders, Business Professionals and Investors. Pitch to the audience with your project and seize your chance to dive into the world of business, technology, and venture capital. 💡 Why You Can't-Miss It: Engage with leading experts and founders in the Tech & Business, and top investors to gain deep insights and valuable networking. This event is a must-attend for those looking to gain ideas, experience, and valuable connections. 📈 Present Your Startup in the Tech & Business: Showcase your startup in the Tech & Business! Email your pitch deck to contact.us@startupvalley.club and seize the opportunity to impress both the audience and investors! Also, you need to fill out the application to participate as a pitcher/speaker at the event. Apply now! 💼 We Welcome New Investors: We invite investors to our event to expand their network, get acquainted with new startups, evaluate them, provide their feedback, participate in discussions, and gain access to a database of new and promising startups from around the world. If you're interested in attending our event as an investor, please register through this link If you'd like access to a database of promising startup projects and additional benefits from Startup Valley, please fill out this application, and our team will contact you: this link 🎤Startup Presentations in the Tech & Business and Expert Evaluations: Startups from various industries, prepare for your moment of glory with a 5-minute presentation scheduled for 07:30 PM, followed by invaluable feedback from our panel of venture capitalists and angel investors. Who will you meet at the event: Founders Investors or VC companies Marketers, Salespeople, Business Advisers Game changers AI Experts Entrepreneurs from Europe, Asia, and the United Kingdom Requirements to attendants: Neat appearance Good mood 1 drink bought at the bar (non-alcohol works too) 🤝The venue where we host our events is our partner. To continue hosting events at this location, please consider purchasing 1-2 drinks at the bar. Thank you. Time: Event time: 7:00 -10:00 PM Pitch time: 8:40 -9:20 PM 🎟Join our event, and secure your ticket today!✨ Sincerely, Startup Valley",
        "event_link": "https://www.eventbrite.com/e/startup-pitch-networking-boston-tickets-1303515783799",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#career",
            "#networking",
            "#marketing",
            "#investment",
            "#boston",
            "#startup",
            "#entrepreneur",
            "#pitch",
            "#inperson",
            "#business_growth"
        ]
    },
    {
        "title": "AMA Boston: May Marketing Mingle",
        "date_time": "Tuesday, May 20 · 6 - 8pm EDT",
        "location": "Trillium - Fort Point 50 Thomson Place Boston, MA 02210 Show map",
        "about": "AMA Boston invites you to our May Marketing Mingle at Trillium - Fort Point (50 Thomson Pl) in Boston from 6:00 pm - 8:00 pm on Tuesday, May 20th! Join us for a fun evening of networking and socializing with other marketing professionals as well as networkers from other professions. Don't miss this opportunity to connect with like-minded individuals in a relaxed and casual setting. Come ready to share ideas, make new contacts, and have a great time! We look forward to seeing you there! ----- Want to become a sponsor of this event or a future AMA Boston event? Reach out to sponsorship@amaboston.org! -----",
        "event_link": "https://www.eventbrite.com/e/ama-boston-may-marketing-mingle-tickets-1256902452069?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#networking",
            "#marketing",
            "#seaport",
            "#sales",
            "#professionalskills",
            "#marketing_professionals",
            "#boston_event",
            "#ama_boston",
            "#may_marketing_mingle"
        ]
    },
    {
        "title": "Real Estate and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Real Estate and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in real estate and business? Want to elevate your career? Meet future colleagues in both residential and commercial spheres: Brokers, Lenders, Investors, Mortgage Brokers, Contractors, and many more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/real-estate-and-business-networking-elevating-your-potential-boston-tickets-1256784248519?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "Business Networking: Pitch Night in Boston",
        "date_time": "Wednesday, April 30 · 7 - 10pm EDT",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "🚀 Business Networking: Pitch Night in Boston! Hi there! 🌟 Join Our Premier Tech & Business Networking Event in Boston Meet and connect with top Tech & Business Professionals, Influencers, and AI Experts . If you’re a startup founder, seize the opportunity to pitch your idea and step into the world of venture capital, innovation, and entrepreneurship . 🔥 Why You Can’t Miss This Event: ✅ Connect with Industry Leaders & Investors – Gain insights from top entrepreneurs, investors, and tech innovators . ✅ Expand Your Network – Meet like-minded professionals, build valuable connections, and explore collaboration opportunities . ✅ Pitch Your Startup – Present your startup in front of a live audience and investors who are actively looking for the next big opportunity. 🚀 Pitch Your Startup & Get Noticed! Showcase your startup and impress investors! Submit your pitch deck to contact.us@startupvalley.club for a chance to be featured on stage . 1️⃣ Fill out the application form to secure your pitching slot : 👉 Apply Now! 2️⃣ Submit your pitch deck for review. 🔹 The startup selected as “Most Investment-Worthy” will receive special recognition on our social media and be featured in an exclusive investor newsletter! 🏆 💼 We Welcome Investors & VC Firms Are you an investor looking for fresh opportunities ? Join us to: ✔ Discover early-stage startups ✔ Provide valuable feedback ✔ Expand your network with global founders ✔ Get exclusive access to a database of promising startups 🎤 Pitch Night: Startup Presentations & Expert Evaluations 📅 Pitch Time: 7:40 - 8:20 PM 🔹 Format: Startups will have 5 minutes to pitch, followed by expert feedback from top venture capitalists and angel investors. 👥 Who Will You Meet? • Startup Founders • Angel Investors & VC Firms • Growth Marketers & Sales Experts • AI & Tech Innovators • Business Advisers • Entrepreneurs from Europe, Asia, and the UK 🎟 Event Details & Ticket Info 📍 Time: 7:00 - 10:00 PM 🎤 Pitch Session: 8:40 - 9:20 PM ✅ Entry Requirements: 🔹 Age: 21+ 🔹 Dress Code: Business casual / Neat appearance 🔹 Good Vibes Only! 😃 🔹 1 drink purchase required (non-alcoholic options available) 🤝 Our venue is our event partner. To continue hosting events here, we kindly ask attendees to support the venue by purchasing 1-2 drinks at the bar. Thank you! ✨ Secure Your Spot – Get Your Ticket Today! 🎟 Looking forward to seeing you at Startup Valley’s Pitch Night! Sincerely, Startup Valley Team",
        "event_link": "https://www.eventbrite.com/e/business-networking-pitch-night-in-boston-tickets-1303516786799?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#marketing",
            "#investment",
            "#boston",
            "#investing",
            "#startup",
            "#investors",
            "#entrepreneur",
            "#pitch",
            "#inperson"
        ]
    },
    {
        "title": "May Boston Networking & Social Event w/ Mass Professional Networking",
        "date_time": "Wednesday, May 28 · 6 - 8pm EDT",
        "location": "Scholars American Bistro and Cocktail Lounge 25 School Street Boston, MA 02108 Show map",
        "about": "Mass Professional Networking would like to invite you to our May Boston Business Networking & Social Event at Scholars in Boston, MA from 6:00pm - 8:00pm on Wednesday, May 28th, 2025. All professionals are welcome whether you are simply working on building your network, looking for business leads, looking for a new job or just like to meet people. The event has a limited number of free tickets so we ask that if you register, please plan to attend.We will also have a limited number of vendor tables for business services with the intent to invite your connections to our event. If you like to be a vendor, simply RSVP as a Vendor. Please note restrictions in vendor description. Please RSVP at http://mpnetworking052825.eventbrite.com to attend. So come and bring your friends, a smile, and lots of business cards and make some great connections. Even if this is your first networking event, your hosts will make sure you make some great connections and feel very welcome. The goal is to build a great referral network for you for your success. Transportation Options - 10 min walk from Orange Line and Red Line Park St. Station. Recommended Parking in Post Office Square Garage Finally we would like you to join the Mass Professional Networking and AIMC Business Solutions groups/Business Pages on Linkedin and Facebook.",
        "event_link": "https://www.eventbrite.com/e/may-boston-networking-social-event-w-mass-professional-networking-tickets-1304639123739?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#networking",
            "#boston",
            "#event",
            "#august"
        ]
    },
    {
        "title": "Boston 2025 Venture Capital World Summit",
        "date_time": "Fri, 16 May 2025 10:00 - 14:00 EDT.Doors at 9:45am",
        "location": "Carr Workplaces - Financial District 10 Post Office Square, Suite 800 South Boston, MA 02109 Show map",
        "about": "Venture Capital World Summit, World Series Seasons USA and Canada of Investment Conferences Global community for investors and investees Here to help businesses get more capital and expertise as they need to scale up, and grow internationally with the support if required from our trusted network of investors Our message to international businesses and entrepreneurs is simple: attend our international events and get in touch well before. We want to help as many entrepreneurs as possible to get the investment and international opportunities via our trusted network.  When your business and your community prospers, everyone prospers.",
        "event_link": "https://www.eventbrite.com/e/boston-2025-venture-capital-world-summit-tickets-881125348637?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Business Conferences",
            "#business",
            "#investment",
            "#entrepreneurship",
            "#entrepreneur",
            "#massachusetts",
            "#usa",
            "#venturecapital",
            "#venture_capital",
            "#boston_events",
            "#massachusetts_events"
        ]
    },
    {
        "title": "Life Sciences Investor Reception 2025",
        "date_time": "Monday, June 16 · 5 - 7pm EDT",
        "location": "Alma Gaucha Prime Brazilian Steakhouse 401 D Street Boston, MA 02210 Show map",
        "about": "Kick Off BIO Week 2025 with an Exclusive Investor Networking Reception! Start your BIO Week experience with an exceptional networking opportunity designed to connect healthcare and life sciences investors with leading biotech and life sciences entrepreneurs. Why Attend? Meet dozens of top-tier investors and influential industry leaders in an intimate, high-value setting. Connect with innovative companies driving breakthroughs in healthcare and biotech. Expand your network with like-minded professionals , entrepreneurs, and decision-makers. Hosted annually by CONNECTpreneur and Opus8. , this event offers an exclusive chance to build relationships that can shape the future of healthcare and life sciences. Event Details 📅 Monday, June 16, 2025 📍 Alma Gaucha Prime Brazilian Steakhouse , 401 D St., Boston, MA, 02210 🍴 Enjoy light fare and unlimited premium beverages in a relaxed, upscale atmosphere. Who Should Attend? VCs and Accredited investors passionate about healthcare, biotech, and life sciences. Entrepreneurs and founders seeking capital and partnerships. Attendance will be Limited! This event is highly sought after , with limited spots available to ensure meaningful connections. Reserve your seat today before space runs out! Take the First Step Discover the partnerships and insights that could define your 2025. 👉 Register Now to secure your spot and begin your BIO Week on the right note! Sponsorship and Exhibitor Opportunities Elevate your brand in front of a highly curated audience of investors and industry leaders. For more information, please contact Skylar Rallison at srallison @opus8 .com .",
        "event_link": "https://www.eventbrite.com/e/life-sciences-investor-reception-2025-tickets-1319284498449?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#entrepreneurs",
            "#innovation",
            "#ai",
            "#entrepreneur",
            "#vc",
            "#startups",
            "#connectpreneur",
            "#rocketpitch",
            "#angel_investment",
            "#chatgpt"
        ]
    },
    {
        "title": "Music and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Music and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in music and business? Want to elevate your career? Meet other musicians, producers, engineers, agents, and many more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future bandmates, employers, coworkers, mangers, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/music-and-business-networking-elevating-your-potential-boston-tickets-1256783847319?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "Networking Night for Young Entrepreneurs",
        "date_time": "Wednesday, May 7 · 6 - 8pm EDT",
        "location": "WXYZ Lounge @ Aloft Seaport 403 D Street Boston, MA 02110 Show map",
        "about": "Do you own (or are starting) your own business? Are you a few years or tiers into your career? Our Networking Nights for Young Entrepreneurs are designed to help established professionals expand their networks and find new opportunities with their peers. What to expect: 1 drink ticket - good for cocktails, wine, sodas, mocktails, beer, etc Hot appetizers to keep you fueled Hosts from our Leadership Team to welcome you and make introductions (tell us who you're looking to meet, we love to make connections) Preprinted name tags to help start conversations and help you spot who you're attending to meet. This event is included in the Young Exec and Business Membership! Advance RSVP Required. Members should use the link in their newsletter to RSVP. Attending as a Guest? We've made a limited amount of Guest space available - Guest Registration is only available on Eventbrite, and must be in advance of the event.",
        "event_link": "https://www.eventbrite.com/e/networking-night-for-young-entrepreneurs-tickets-1269224297039?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#networking",
            "#entrepreneurs",
            "#young",
            "#night",
            "#potential"
        ]
    },
    {
        "title": "German American Economic Forum 2025",
        "date_time": "Friday, June 6 · 8:30am - 1pm EDT",
        "location": "200 Pier 4 Blvd. 200 Pier 4 Boulevard Boston, MA 02210 Show map",
        "about": "This exclusive half-day forum organized by the German-American Business Council of Boston (GABC Boston) will bring together leading executives from the life sciences industry to discuss key issues shaping the future of healthcare and biotech. The forum will delve into the complexities of driving innovation within an increasingly challenging funding environment and highlight the contrast between large pharma, which have evolved their innovations over generations, and biotech disruptors that often push the envelope with groundbreaking approaches. This forum will also explore the varying attitudes between the U.S. and Germany, shedding light on how these perspectives impact investing in innovation and long-term strategies.",
        "event_link": "https://www.eventbrite.com/e/german-american-economic-forum-2025-tickets-1246182969809?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Business Conferences",
            "#boston",
            "#innovation",
            "#lifesciences",
            "#2025",
            "#business_connections",
            "#german_american",
            "#economic_forum"
        ]
    },
    {
        "title": "Business Social & Networking",
        "date_time": "Monday, April 28 · 6 - 9pm EDT.Doors at 1pm",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Business Social & Networking – Connect, Collaborate, Grow Join us for an evening of meaningful connections, professional growth, and new opportunities at Business Social & Networking . This event is designed for entrepreneurs, business owners, and professionals eager to expand their networks, exchange ideas, and build valuable partnerships in a dynamic setting. Whether you want to connect with like-minded professionals, explore new opportunities, or take your business to the next level, this is the perfect space to spark engaging conversations and forge lasting relationships. Why Attend? ✅ Expand Your Network – Meet driven professionals and entrepreneurs ready to collaborate. ✅ Unlock Opportunities – Discover potential clients, business partners, and career prospects. ✅ Boost Your Visibility – Strengthen your presence within Boston’s thriving business community. ✅ Gain Insights & Support – Connect with key members of The Boston Business Hub and access valuable resources. What to Expect 🔹 Check-in upon arrival and receive your name tag for seamless networking. 🔹 A vibrant room filled with motivated professionals eager to connect. 🔹 A welcoming environment designed to foster meaningful business relationships. Reserve your spot today and start building powerful connections! Bar Moxy 240 Tremont Street Boston, MA 02116 6:00PM – Business Professionals The Boston Business Hub The Boston Business Hub connects entrepreneurs and young professionals with a network of 27,500 people across the Boston area. Our platform is designed to foster genuine connections and provide valuable training opportunities for those looking to grow their businesses or advance their careers. Founded in 2016, we’ve spent years building a trusted space where ideas are shared, skills are sharpened, and collaborations thrive. Whether you’re starting out or scaling up, The Boston Business Hub is here to support your journey. https://bostonbh.com/",
        "event_link": "https://www.eventbrite.com/e/business-social-networking-tickets-1316432818999?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#networking",
            "#marketing",
            "#afterwork",
            "#networking_event",
            "#business_social"
        ]
    },
    {
        "title": "Creativity in PR",
        "date_time": "Tuesday, April 29 · 6 - 8pm EDT",
        "location": "THE LINK 255 Main Street Cambridge, MA 02142 Show map",
        "about": "Adam Ritchie, author of “Invention in PR”, advocates for public relations to evolve from its past as an organization's mouthpiece to its future as an organization's creative engine. Nationally recognized, Ritchie has been named the field's most innovative professional (PRovoke), launched campaigns honored as the most creative (PRWeek) and runs a practice recognized as the top boutique agency in the country (PR News). He has won every award in the industry multiple times, presented at dozens of conferences and spoken at more than 50 universities on the Invention-first approach to PR.",
        "event_link": "https://www.eventbrite.com/e/creativity-in-pr-tickets-1325103352799?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Business Seminars",
            "#innovation",
            "#creativity",
            "#event",
            "#communication",
            "#pr"
        ]
    },
    {
        "title": "European-American Summer Networking",
        "date_time": "Tuesday, May 27 · 6 - 8:30pm EDT",
        "location": "French Library / Alliance Française of Boston & Cambridge 53 Marlborough Street Boston, MA 02116 Show map",
        "about": "Hosted by the French Library in their beautiful, fully-restored Victorian mansion Boston’s Back Bay, enjoy drinks and light appetizers while meeting your international business peers for an evening of networking , conversation, and celebrating the beginning of the warmer season! 🥂 Curious? Click here to see pictures from the 2024 edition , and the 2023 edition ! 📆 Date : Tuesday May 27, 2025 🕕 Time : 6:00 PM - 8:00 PM 📍 Location : French Library , 53 Marlborough St, 02116, Boston ( directions ) 🎫 Registration: $40 for members and $55 for non-members (+fees).",
        "event_link": "https://www.eventbrite.com/e/european-american-summer-networking-tickets-1285054595889?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#networking",
            "#boston",
            "#germany",
            "#europe",
            "#gabc"
        ]
    },
    {
        "title": "Hospitality and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Hospitality and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in hospitality and business? Want to elevate your career? Meet Consultants, Analysts of all types, Promoters, DJs, Restaurateurs, Entrepreneurs, and more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/hospitality-and-business-networking-elevating-your-potential-boston-tickets-1256783797169?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "Non-Profits and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Non-Profits and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in non-profits and business? Want to elevate your career? Meet Executives, Consultants, Benefactors, and more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/non-profits-and-business-networking-elevating-your-potential-boston-tickets-1256714911129?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "Networking Night for Boston's Young Professionals",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Industrious, Post Office Square 225 Franklin Street 26th Floor Boston, MA 02110 Show map",
        "about": "It's our monthly Networking Night for Young Professionals, where we meet and make new connections with Young Professionals in Boston.  Meet other young professionals like yourself to collaborate, exchange ideas, find clients or referrals, learn about a job opening, and most importantly build your network.  This event is included in all levels of BostonYPA Membership, a limited number of guest tickets are available. This month we are at Industrious' newest location and are providing: Appetizers and refreshments Preprinted Name Tags with your name, company and job title Registration: Guest Tickets are $25 in advance, $29 Last Chance This event is included in all levels of BostonYPA Membership , use the link in your eNewsletter to RSVP Advance RSVP is required This is the right event for you if you want to: Find New Clients or Referrals, or meet other professionals to align with Increase your visibility in the Boston Community Meet with recruiters to learn about their job openings, or network with candidates and job seekers. Connect with key members of BostonYPA and learn more about the Boston Young Professionals Association.",
        "event_link": "https://www.eventbrite.com/e/networking-night-for-bostons-young-professionals-tickets-1333942410659?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#networking",
            "#small_business",
            "#boston_events"
        ]
    },
    {
        "title": "AI &  Tech Networking Boston",
        "date_time": "Wednesday, April 30 · 7 - 10pm EDT",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "🚀 Join the AI Tech Networking Event in Boston! Every month, we bring together startups and investors from diverse industries. This is your opportunity to connect with entrepreneurs, venture capitalists, share ideas, and grow your business. 💡 Why Attend: • Discover investors and valuable connections. • Expand your network with like-minded professionals. • Receive expert feedback to refine your ideas. • Validate your concepts with industry experts. • Learn strategies for scaling your business. • Enjoy a relaxed networking atmosphere. • Solve challenges and find partners for your projects. 📈 Pitch Your Startup: Purchase the appropriate ticket, send your pitch deck to contact.us@startupvalley.club, and complete the application. You’ll have 5 minutes to present, followed by expert feedback and Q&A. 💼 For Investors: We invite investors to join this event—register for free by completing the application on our website . This is a great opportunity to discover local startups and gain access to our global database of startups in 30+ cities worldwide. We’re confident you’ll find investment-worthy opportunities. 📅 Time: • Event Start: 7:00 PM • Startup Pitches: 8:40 PM • Event End: 10:00PM 🤝 Requirements: • Age 21+ • Good mood and business casual attire • Purchase at least one drink at the bar (to support the venue) 🎟 Reserve your tickets now! Take the first step toward new opportunities with Startup Valley !",
        "event_link": "https://www.eventbrite.com/e/ai-tech-networking-boston-tickets-1296495195029?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#marketing",
            "#technology",
            "#boston",
            "#ai",
            "#pitch",
            "#founders",
            "#expert",
            "#gamechangers",
            "#inperson"
        ]
    },
    {
        "title": "Start a Simple Online Side biz - Make $900/day in 2 hours/day- Boston",
        "date_time": "Tuesday, April 29 · 6:30 - 7:30pm EDT",
        "location": "Online Webinar - Phone or Computer Online Webinar - Phone or Computer Boston, MA 02116 Show map",
        "about": "Feeling stuck in the 9-to-5 grind? Drowning in debt? Want to improve retirement? Looking for a way to create financial flexibility without sacrificing your entire schedule? Whether you’re a busy professional, parent, or someone eager to step away from corporate life, this free online event will show you how to build a profitable side hustle —without huge startup costs or prior experience. 📍 Where? Online (Link provided after registration) What You'll Learn: ✔️ A step-by-step strategy to start earning extra income on the side ✔️ How to create a reliable revenue stream without working endless hours ✔️ Simple methods to launch & grow a side hustle that fits your lifestyle ✔️ How to build financial security & independence outside of your job ✔️ The biggest mistakes to avoid when starting a side hustle Who Should Attend? ✅ Busy professionals who want an additional income stream ✅ Parents or side hustlers looking for flexibility & financial growth ✅ Anyone ready to break free from corporate life and start their own path 🚀 No experience needed! We’ll show you how to get started with a straightforward, proven approach. 📱 Zoom Access: Link will be sent after registration—just provide your phone number to receive it. 🔹 Spots are limited—secure yours now! 🔹",
        "event_link": "https://www.eventbrite.com/e/start-a-simple-online-side-biz-make-900day-in-2-hoursday-boston-tickets-1320898415719?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Business Classes",
            "#onlinemarketing",
            "#side_income",
            "#get_out_of_debt",
            "#online_side_hustle",
            "#2_hours_a_day",
            "#make_900"
        ]
    },
    {
        "title": "Boston, MA Lean Six Sigma Green and Black Belt Conference By CP",
        "date_time": "Tuesday, May 13 · 9am - 5pm EDT",
        "location": "101 Arch St 8th floor 101 Arch Street #8th floor Boston, MA 02110 Show map",
        "about": "\"This is a 4 days course. You will see the starting date and time on Eventbrite listings. The course will be delivered on four consecutive days.\" Certification Overview: Lean Six Sigma is a methodology widely used in industries to improve business processes and reduce waste. It combines the principles of Lean Manufacturing, which focuses on eliminating waste, with Six Sigma, a data-driven approach to improve quality and reduce variation. Lean Six Sigma Greenbelt and Black Belt certifications are highly sought after by professionals looking to enhance their skills and contribute to process improvement initiatives within their organizations. Training Overview: Certification Planner offers a Dual Lean Six Sigma Greenbelt and Black Belt certification training program designed to provide participants with a comprehensive understanding of Lean Six Sigma methodologies and tools. This training equips individuals with the knowledge and skills required to lead improvement projects and drive organizational change effectively. Course Highlights: - Comprehensive Dual Lean Six Sigma Green and Black Belt training - Classes scheduled every week in over 120 cities. - Weekdays and weekend classes - Customize your course schedule and materials as per the requirements. - Certified and experienced instructors with industry expertise - 100% pass guarantee for Green and Black Belt exams - High success rate among participants Chat with us for quick support: Chat Now Click Here Course Page: CP Dual Lean Six Sigma Certification Training Key Features of Dual Lean Six Sigma Green and Black Belt Training: 1. Four Days In-Person Training: The training program spans four days of intensive, hands-on learning, providing participants with a focused and immersive experience. 2. Globally Recognized Course Materials: Participants receive globally recognized course materials that cover both Lean and Six Sigma methodologies, ensuring comprehensive knowledge and understanding. 3. Open Book Exam Voucher: The training includes an open book exam voucher, allowing participants to refer to their course materials during the certification exam. 4. Certified and Experienced Instructors: The training is delivered by certified and experienced instructors who possess extensive knowledge of Lean Six Sigma principles and real-world industry experience. 5. Guarantee to Run Classes: The training classes are guaranteed to run as scheduled, providing participants with the assurance of a seamless learning experience without any last-minute cancellations. 6. 100% Pass Guarantee: Certification Planner offers a 100% pass guarantee, providing participants with the confidence and assurance that they will successfully pass the Green and Black Belt certification exams. 7. Highest Success Rate: Certification Planner's Dual Lean Six Sigma training program boasts a high success rate among participants who have completed the certification exams, ensuring optimal preparation for success. 8. 60 PDU's Certificate: Upon successful completion of the training program, participants receive a certificate granting them 60 Professional Development Units (PDUs) recognized by PMI, contributing to their professional development and growth. Registration Information: Complete your enrollment on Eventbrite to receive instant confirmation. For group or corporate registration and discount, contact Daniel@certificationplanner.com . Reach out to Jacob@certificationplanner.com for course related queries. Course Agenda for Dual Lean Six Sigma Green and Black Belt Training (4 Days): Day 1: 1. Introduction to Lean Six Sigma 2. Define Phase: Project Identification and Selection 3. Define Phase: Project Charter and Stakeholder Analysis 4. Define Phase: Voice of the Customer Day 2: 5. Measure Phase: Process Mapping and Data Collection 6. Measure Phase: Measurement System Analysis (MSA) 7. Measure Phase: Data Analysis and Process Capability Day 3: 8. Analyze Phase: Root Cause Analysis 9. Analyze Phase: Hypothesis Testing 10. Improve Phase: Lean Tools and Techniques 11. Improve Phase: Design of Experiments (DOE) Day 4: 12. Control Phase: Statistical Process Control (SPC) 13. Control Phase: Control Plans and Documentation 14. Review of Green Belt and Black Belt Concepts 15. Exam Preparation and Q&A Session Dual Lean Six Sigma Green and Black Belt Exam Details: The Dual Lean Six Sigma Green and Black Belt certification exam is designed to assess candidates' understanding of Lean Six Sigma methodologies and their ability to apply them in real-world scenarios. Here are the key details of the exam: 1. Exam Format: The exam consists of 100 multiple-choice questions that evaluate your knowledge and application of Lean Six Sigma concepts, tools, and techniques. 2. Duration: Candidates are given a total of 3 hours to complete the exam. This time frame allows participants to carefully analyze and respond to each question. 3. Pass Rate: To achieve certification, candidates must attain a minimum passing score of 65%. This score indicates a satisfactory level of proficiency in Lean Six Sigma principles and practices. 4. Open Book: The exam is open book, allowing participants to refer to their study materials, notes, and relevant resources during the test. This enables candidates to access important information and references to support their answers. 5. Exam Portal Access: Candidates are provided with 7 days of access to the exam portal, allowing them to schedule and take the exam at their convenience within this timeframe. 6. Multiple Attempts: Participants have up to 3 attempts to pass the exam. This flexibility ensures that candidates could improve their performance and achieve the desired certification. 7. Post Classroom Support: After the training program, candidates receive post-classroom support, which includes guidance and assistance from instructors and subject matter experts. This support helps participants clarify any doubts or questions they may have encountered during the exam or the training program. We offer weekdays and weekday classes every week in over 120 cities. Click here to chat now or visit www.certificationplanner.com We also offer training for: PMP certification, CAPM Certification, PMI-ACP Certification, ITIL 4 Foundation Exam, CISA Certification, CISSP Certification, Lean Six Sigma Green Belt, Lean Six sigma Black Belt, Salesforce Administrator, Salesforce Business Analyst, PgMP, ITIL Practitioner, Lean management, Dual lean Six Sigma Green & Black Belt, ToGAF and many more certifications. Tags: #DualLeanSixSigmaCertification #GreenBeltCertification #BlackBeltCertification #LeanSixSigmaTraining #CertificationProgram #ProcessImprovement #QualityManagement #ProfessionalDevelopment #ContinuousImprovement #CareerGrowth",
        "event_link": "https://www.eventbrite.com/e/boston-ma-lean-six-sigma-green-and-black-belt-conference-by-cp-tickets-1254157802749?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Business Classes",
            "#pmp",
            "#pmpbootcamp",
            "#pmpcertification",
            "#pmpcertificationtraining",
            "#pmp_certification",
            "#pmp_training",
            "#pmp_certification_course",
            "#pmp_certification_class",
            "#certificationplanner",
            "#pmi_pmp_exam"
        ]
    },
    {
        "title": "Lean Six Sigma Black Belt(LSSBB )Training Boston, MA In-Person Class",
        "date_time": "Tuesday, May 13 · 9am - 5pm EDT",
        "location": "101 Arch St 8th floor 101 Arch Street #8th floor Boston, MA 02110 Show map",
        "about": "\"This is a 4 days course. You will see the starting date and time on Eventbrite listings. The course will be delivered on four consecutive days.\" Experience our exclusive Lean Six Sigma Black Belt (LSSBB) Certification Workshop, tailored to enhance problem-solving and leadership skills. Hosted by www.certificationplanner.com, this immersive program equips you with expertise to drive significant process enhancements. Elevate your skills today! About LSSBB Certification: The globally recognized Lean Six Sigma Black Belt Certification demonstrates mastery in Lean principles, Six Sigma methodologies, and advanced statistical tools. It empowers you to lead intricate process improvement projects and streamline organizational efficiency. Certification Planner’s LSSBB Training Program: Led by seasoned Lean Six Sigma experts, our comprehensive program includes intensive classroom sessions, hands-on exercises, and real-world case studies. Gain a deep understanding and practical application of Lean Six Sigma methodologies. Course Highlights: - Duration: 4 days of intensive in-person classroom training - Instructor: Certified LSS Master instructor - Study Materials: Customized LSSBB study guide and practice tests - Exam Voucher: Open book online exam voucher with 1-year validity - 60 PDU’s Certificate: Receive 60 PDUs along with your course completion certificate - 100% Pass Guarantee: Ensure your success in the LSSBB exam - Additional Resources: Access to additional materials, tools, and case studies - 6 Months Q&A Support: Post-training support to clarify doubts and reinforce learning Chat with us for quick support: Click Here Course Page: CP LSSBB Certification Training Take advantage of our limited-time promotion and enroll now to save on your course fees! Secure your spot for in-person classes at $1999 or opt for live online classes for just $1599 before the promotion ends. Don't miss out on this opportunity to invest in your education at a discounted rate. Key Benefits of LSSBB Certification: - Mastery of Lean Six Sigma principles and methodologies - Proficiency in advanced statistical analysis and problem-solving - Ability to lead high-impact process improvement initiatives - Enhanced project management and leadership skills - Increased career opportunities and earning potential - Recognition as a valuable asset to your organization Why Choose Us: 1. Expert Instructors: Certified Lean Six Sigma Master Black Belts with extensive industry experience 2. Practical Approach: Real-world applications to tackle actual business challenges 3. Interactive Learning Environment: Stimulating discussions and collaboration with peers 4. Comprehensive Course Material: Access to a wealth of resources for exam preparation For inquiries, contact Daniel@certificationplanner.com or visit www.certificationplanner.com . Pass Guarantee Details: Ensure your employees' success with our comprehensive pass guarantee, including multiple attempts and access to additional resources. Eligibility: Participants should have a foundational understanding of Lean Six Sigma principles and prior experience in leading process improvement projects. Enroll in our transformative LSSBB Certification Workshop today and drive positive change within your organization. Don't miss out on this opportunity to become a certified Lean Six Sigma Black Belt Professional. Other Courses: Explore our range of certification courses, including CAPM, PgMP, RMP, CISSP, CISA, ITIL, Salesforce, and more.",
        "event_link": "https://www.eventbrite.com/e/lean-six-sigma-black-beltlssbb-training-boston-ma-in-person-class-tickets-1223253697739?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Business Classes",
            "#cism",
            "#cisa",
            "#certificationplanner"
        ]
    },
    {
        "title": "AMA Boston: May Marketing Mingle",
        "date_time": "Tuesday, May 20 · 6 - 8pm EDT",
        "location": "Trillium - Fort Point 50 Thomson Place Boston, MA 02210 Show map",
        "about": "AMA Boston invites you to our May Marketing Mingle at Trillium - Fort Point (50 Thomson Pl) in Boston from 6:00 pm - 8:00 pm on Tuesday, May 20th! Join us for a fun evening of networking and socializing with other marketing professionals as well as networkers from other professions. Don't miss this opportunity to connect with like-minded individuals in a relaxed and casual setting. Come ready to share ideas, make new contacts, and have a great time! We look forward to seeing you there! ----- Want to become a sponsor of this event or a future AMA Boston event? Reach out to sponsorship@amaboston.org! -----",
        "event_link": "https://www.eventbrite.com/e/ama-boston-may-marketing-mingle-tickets-1256902452069",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#networking",
            "#marketing",
            "#seaport",
            "#sales",
            "#professionalskills",
            "#marketing_professionals",
            "#boston_event",
            "#ama_boston",
            "#may_marketing_mingle"
        ]
    },
    {
        "title": "Real Estate and Business Networking | Elevating Your Potential - Boston",
        "date_time": "Wednesday, May 21 · 6 - 8pm EDT",
        "location": "Grafton Street Pub & Grill 59 John F. Kennedy Street Cambridge, MA 02138 Show map",
        "about": "Strive welcomes you to 'Real Estate and Business Networking', Boston's hottest networking event! We are set in the perfect central location in Cambridge for all to join. Are you interested in real estate and business? Want to elevate your career? Meet future colleagues in both residential and commercial spheres: Brokers, Lenders, Investors, Mortgage Brokers, Contractors, and many more who are active in the space or are eager to get started. **This will be a multi-vertical event ** There will be professionals with backgrounds in the arts, finance, tech, real estate, healthcare, and more. Come with an open mind, and leave with connections that wouldn't be possible otherwise! Pack some business cards and come with an open mind! Meet your future business partners, employers, coworkers, investors, and friends. You don't want to miss this opportunity to expand your network and create a brighter future. We will have a space for our event to check-in. The event will go from 6:00 PM - 8:00 PM(feel free to come at any point in this timeframe). Name tags will be provided. Business casual dress code. Job fair attire. Remember - it's not about who you know today, it's who you'll meet tomorrow! We look forward to meeting you at the event! Sincerely, Strive Networking Team Refund requests are permitted up to 24 hours after purchase, so long as we are not within 48 hours before the event start time. Refunds will be made in full and repaid to your method of payment. Note that we are unable to reimburse for eventbrite fees. Disclaimer: By attending Strive Networking events you agree to photos/videos taken during the event being used to promote future events.",
        "event_link": "https://www.eventbrite.com/e/real-estate-and-business-networking-elevating-your-potential-boston-tickets-1256784248519",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Business Networking",
            "#business",
            "#networking",
            "#tech",
            "#technology",
            "#boston",
            "#startup",
            "#connection",
            "#artificial_intelligence",
            "#business_networking",
            "#job_fair"
        ]
    },
    {
        "title": "Business Networking: Pitch Night in Boston",
        "date_time": "Wednesday, April 30 · 7 - 10pm EDT",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "🚀 Business Networking: Pitch Night in Boston! Hi there! 🌟 Join Our Premier Tech & Business Networking Event in Boston Meet and connect with top Tech & Business Professionals, Influencers, and AI Experts . If you’re a startup founder, seize the opportunity to pitch your idea and step into the world of venture capital, innovation, and entrepreneurship . 🔥 Why You Can’t Miss This Event: ✅ Connect with Industry Leaders & Investors – Gain insights from top entrepreneurs, investors, and tech innovators . ✅ Expand Your Network – Meet like-minded professionals, build valuable connections, and explore collaboration opportunities . ✅ Pitch Your Startup – Present your startup in front of a live audience and investors who are actively looking for the next big opportunity. 🚀 Pitch Your Startup & Get Noticed! Showcase your startup and impress investors! Submit your pitch deck to contact.us@startupvalley.club for a chance to be featured on stage . 1️⃣ Fill out the application form to secure your pitching slot : 👉 Apply Now! 2️⃣ Submit your pitch deck for review. 🔹 The startup selected as “Most Investment-Worthy” will receive special recognition on our social media and be featured in an exclusive investor newsletter! 🏆 💼 We Welcome Investors & VC Firms Are you an investor looking for fresh opportunities ? Join us to: ✔ Discover early-stage startups ✔ Provide valuable feedback ✔ Expand your network with global founders ✔ Get exclusive access to a database of promising startups 🎤 Pitch Night: Startup Presentations & Expert Evaluations 📅 Pitch Time: 7:40 - 8:20 PM 🔹 Format: Startups will have 5 minutes to pitch, followed by expert feedback from top venture capitalists and angel investors. 👥 Who Will You Meet? • Startup Founders • Angel Investors & VC Firms • Growth Marketers & Sales Experts • AI & Tech Innovators • Business Advisers • Entrepreneurs from Europe, Asia, and the UK 🎟 Event Details & Ticket Info 📍 Time: 7:00 - 10:00 PM 🎤 Pitch Session: 8:40 - 9:20 PM ✅ Entry Requirements: 🔹 Age: 21+ 🔹 Dress Code: Business casual / Neat appearance 🔹 Good Vibes Only! 😃 🔹 1 drink purchase required (non-alcoholic options available) 🤝 Our venue is our event partner. To continue hosting events here, we kindly ask attendees to support the venue by purchasing 1-2 drinks at the bar. Thank you! ✨ Secure Your Spot – Get Your Ticket Today! 🎟 Looking forward to seeing you at Startup Valley’s Pitch Night! Sincerely, Startup Valley Team",
        "event_link": "https://www.eventbrite.com/e/business-networking-pitch-night-in-boston-tickets-1303516786799",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#marketing",
            "#investment",
            "#boston",
            "#investing",
            "#startup",
            "#investors",
            "#entrepreneur",
            "#pitch",
            "#inperson"
        ]
    },
    {
        "title": "May Boston Networking & Social Event w/ Mass Professional Networking",
        "date_time": "Wednesday, May 28 · 6 - 8pm EDT",
        "location": "Scholars American Bistro and Cocktail Lounge 25 School Street Boston, MA 02108 Show map",
        "about": "Mass Professional Networking would like to invite you to our May Boston Business Networking & Social Event at Scholars in Boston, MA from 6:00pm - 8:00pm on Wednesday, May 28th, 2025. All professionals are welcome whether you are simply working on building your network, looking for business leads, looking for a new job or just like to meet people. The event has a limited number of free tickets so we ask that if you register, please plan to attend.We will also have a limited number of vendor tables for business services with the intent to invite your connections to our event. If you like to be a vendor, simply RSVP as a Vendor. Please note restrictions in vendor description. Please RSVP at http://mpnetworking052825.eventbrite.com to attend. So come and bring your friends, a smile, and lots of business cards and make some great connections. Even if this is your first networking event, your hosts will make sure you make some great connections and feel very welcome. The goal is to build a great referral network for you for your success. Transportation Options - 10 min walk from Orange Line and Red Line Park St. Station. Recommended Parking in Post Office Square Garage Finally we would like you to join the Mass Professional Networking and AIMC Business Solutions groups/Business Pages on Linkedin and Facebook.",
        "event_link": "https://www.eventbrite.com/e/may-boston-networking-social-event-w-mass-professional-networking-tickets-1304639123739",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#networking",
            "#boston",
            "#event",
            "#august"
        ]
    },
    {
        "title": "Start a Simple Online Side biz - Make $900/day in 2 hours/day- Boston",
        "date_time": "Tuesday, April 29 · 6:30 - 7:30pm EDT",
        "location": "Online Webinar - Phone or Computer Online Webinar - Phone or Computer Boston, MA 02116 Show map",
        "about": "Feeling stuck in the 9-to-5 grind? Drowning in debt? Want to improve retirement? Looking for a way to create financial flexibility without sacrificing your entire schedule? Whether you’re a busy professional, parent, or someone eager to step away from corporate life, this free online event will show you how to build a profitable side hustle —without huge startup costs or prior experience. 📍 Where? Online (Link provided after registration) What You'll Learn: ✔️ A step-by-step strategy to start earning extra income on the side ✔️ How to create a reliable revenue stream without working endless hours ✔️ Simple methods to launch & grow a side hustle that fits your lifestyle ✔️ How to build financial security & independence outside of your job ✔️ The biggest mistakes to avoid when starting a side hustle Who Should Attend? ✅ Busy professionals who want an additional income stream ✅ Parents or side hustlers looking for flexibility & financial growth ✅ Anyone ready to break free from corporate life and start their own path 🚀 No experience needed! We’ll show you how to get started with a straightforward, proven approach. 📱 Zoom Access: Link will be sent after registration—just provide your phone number to receive it. 🔹 Spots are limited—secure yours now! 🔹",
        "event_link": "https://www.eventbrite.com/e/start-a-simple-online-side-biz-make-900day-in-2-hoursday-boston-tickets-1320898415719",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Business Classes",
            "#onlinemarketing",
            "#side_income",
            "#get_out_of_debt",
            "#online_side_hustle",
            "#2_hours_a_day",
            "#make_900"
        ]
    },
    {
        "title": "Boston, MA Lean Six Sigma Green and Black Belt Conference By CP",
        "date_time": "Tuesday, May 13 · 9am - 5pm EDT",
        "location": "101 Arch St 8th floor 101 Arch Street #8th floor Boston, MA 02110 Show map",
        "about": "\"This is a 4 days course. You will see the starting date and time on Eventbrite listings. The course will be delivered on four consecutive days.\" Certification Overview: Lean Six Sigma is a methodology widely used in industries to improve business processes and reduce waste. It combines the principles of Lean Manufacturing, which focuses on eliminating waste, with Six Sigma, a data-driven approach to improve quality and reduce variation. Lean Six Sigma Greenbelt and Black Belt certifications are highly sought after by professionals looking to enhance their skills and contribute to process improvement initiatives within their organizations. Training Overview: Certification Planner offers a Dual Lean Six Sigma Greenbelt and Black Belt certification training program designed to provide participants with a comprehensive understanding of Lean Six Sigma methodologies and tools. This training equips individuals with the knowledge and skills required to lead improvement projects and drive organizational change effectively. Course Highlights: - Comprehensive Dual Lean Six Sigma Green and Black Belt training - Classes scheduled every week in over 120 cities. - Weekdays and weekend classes - Customize your course schedule and materials as per the requirements. - Certified and experienced instructors with industry expertise - 100% pass guarantee for Green and Black Belt exams - High success rate among participants Chat with us for quick support: Chat Now Click Here Course Page: CP Dual Lean Six Sigma Certification Training Key Features of Dual Lean Six Sigma Green and Black Belt Training: 1. Four Days In-Person Training: The training program spans four days of intensive, hands-on learning, providing participants with a focused and immersive experience. 2. Globally Recognized Course Materials: Participants receive globally recognized course materials that cover both Lean and Six Sigma methodologies, ensuring comprehensive knowledge and understanding. 3. Open Book Exam Voucher: The training includes an open book exam voucher, allowing participants to refer to their course materials during the certification exam. 4. Certified and Experienced Instructors: The training is delivered by certified and experienced instructors who possess extensive knowledge of Lean Six Sigma principles and real-world industry experience. 5. Guarantee to Run Classes: The training classes are guaranteed to run as scheduled, providing participants with the assurance of a seamless learning experience without any last-minute cancellations. 6. 100% Pass Guarantee: Certification Planner offers a 100% pass guarantee, providing participants with the confidence and assurance that they will successfully pass the Green and Black Belt certification exams. 7. Highest Success Rate: Certification Planner's Dual Lean Six Sigma training program boasts a high success rate among participants who have completed the certification exams, ensuring optimal preparation for success. 8. 60 PDU's Certificate: Upon successful completion of the training program, participants receive a certificate granting them 60 Professional Development Units (PDUs) recognized by PMI, contributing to their professional development and growth. Registration Information: Complete your enrollment on Eventbrite to receive instant confirmation. For group or corporate registration and discount, contact Daniel@certificationplanner.com . Reach out to Jacob@certificationplanner.com for course related queries. Course Agenda for Dual Lean Six Sigma Green and Black Belt Training (4 Days): Day 1: 1. Introduction to Lean Six Sigma 2. Define Phase: Project Identification and Selection 3. Define Phase: Project Charter and Stakeholder Analysis 4. Define Phase: Voice of the Customer Day 2: 5. Measure Phase: Process Mapping and Data Collection 6. Measure Phase: Measurement System Analysis (MSA) 7. Measure Phase: Data Analysis and Process Capability Day 3: 8. Analyze Phase: Root Cause Analysis 9. Analyze Phase: Hypothesis Testing 10. Improve Phase: Lean Tools and Techniques 11. Improve Phase: Design of Experiments (DOE) Day 4: 12. Control Phase: Statistical Process Control (SPC) 13. Control Phase: Control Plans and Documentation 14. Review of Green Belt and Black Belt Concepts 15. Exam Preparation and Q&A Session Dual Lean Six Sigma Green and Black Belt Exam Details: The Dual Lean Six Sigma Green and Black Belt certification exam is designed to assess candidates' understanding of Lean Six Sigma methodologies and their ability to apply them in real-world scenarios. Here are the key details of the exam: 1. Exam Format: The exam consists of 100 multiple-choice questions that evaluate your knowledge and application of Lean Six Sigma concepts, tools, and techniques. 2. Duration: Candidates are given a total of 3 hours to complete the exam. This time frame allows participants to carefully analyze and respond to each question. 3. Pass Rate: To achieve certification, candidates must attain a minimum passing score of 65%. This score indicates a satisfactory level of proficiency in Lean Six Sigma principles and practices. 4. Open Book: The exam is open book, allowing participants to refer to their study materials, notes, and relevant resources during the test. This enables candidates to access important information and references to support their answers. 5. Exam Portal Access: Candidates are provided with 7 days of access to the exam portal, allowing them to schedule and take the exam at their convenience within this timeframe. 6. Multiple Attempts: Participants have up to 3 attempts to pass the exam. This flexibility ensures that candidates could improve their performance and achieve the desired certification. 7. Post Classroom Support: After the training program, candidates receive post-classroom support, which includes guidance and assistance from instructors and subject matter experts. This support helps participants clarify any doubts or questions they may have encountered during the exam or the training program. We offer weekdays and weekday classes every week in over 120 cities. Click here to chat now or visit www.certificationplanner.com We also offer training for: PMP certification, CAPM Certification, PMI-ACP Certification, ITIL 4 Foundation Exam, CISA Certification, CISSP Certification, Lean Six Sigma Green Belt, Lean Six sigma Black Belt, Salesforce Administrator, Salesforce Business Analyst, PgMP, ITIL Practitioner, Lean management, Dual lean Six Sigma Green & Black Belt, ToGAF and many more certifications. Tags: #DualLeanSixSigmaCertification #GreenBeltCertification #BlackBeltCertification #LeanSixSigmaTraining #CertificationProgram #ProcessImprovement #QualityManagement #ProfessionalDevelopment #ContinuousImprovement #CareerGrowth",
        "event_link": "https://www.eventbrite.com/e/boston-ma-lean-six-sigma-green-and-black-belt-conference-by-cp-tickets-1254157802749",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Business Classes",
            "#pmp",
            "#pmpbootcamp",
            "#pmpcertification",
            "#pmpcertificationtraining",
            "#pmp_certification",
            "#pmp_training",
            "#pmp_certification_course",
            "#pmp_certification_class",
            "#certificationplanner",
            "#pmi_pmp_exam"
        ]
    },
    {
        "title": "Lean Six Sigma Black Belt(LSSBB )Training Boston, MA In-Person Class",
        "date_time": "Tuesday, May 13 · 9am - 5pm EDT",
        "location": "101 Arch St 8th floor 101 Arch Street #8th floor Boston, MA 02110 Show map",
        "about": "\"This is a 4 days course. You will see the starting date and time on Eventbrite listings. The course will be delivered on four consecutive days.\" Experience our exclusive Lean Six Sigma Black Belt (LSSBB) Certification Workshop, tailored to enhance problem-solving and leadership skills. Hosted by www.certificationplanner.com, this immersive program equips you with expertise to drive significant process enhancements. Elevate your skills today! About LSSBB Certification: The globally recognized Lean Six Sigma Black Belt Certification demonstrates mastery in Lean principles, Six Sigma methodologies, and advanced statistical tools. It empowers you to lead intricate process improvement projects and streamline organizational efficiency. Certification Planner’s LSSBB Training Program: Led by seasoned Lean Six Sigma experts, our comprehensive program includes intensive classroom sessions, hands-on exercises, and real-world case studies. Gain a deep understanding and practical application of Lean Six Sigma methodologies. Course Highlights: - Duration: 4 days of intensive in-person classroom training - Instructor: Certified LSS Master instructor - Study Materials: Customized LSSBB study guide and practice tests - Exam Voucher: Open book online exam voucher with 1-year validity - 60 PDU’s Certificate: Receive 60 PDUs along with your course completion certificate - 100% Pass Guarantee: Ensure your success in the LSSBB exam - Additional Resources: Access to additional materials, tools, and case studies - 6 Months Q&A Support: Post-training support to clarify doubts and reinforce learning Chat with us for quick support: Click Here Course Page: CP LSSBB Certification Training Take advantage of our limited-time promotion and enroll now to save on your course fees! Secure your spot for in-person classes at $1999 or opt for live online classes for just $1599 before the promotion ends. Don't miss out on this opportunity to invest in your education at a discounted rate. Key Benefits of LSSBB Certification: - Mastery of Lean Six Sigma principles and methodologies - Proficiency in advanced statistical analysis and problem-solving - Ability to lead high-impact process improvement initiatives - Enhanced project management and leadership skills - Increased career opportunities and earning potential - Recognition as a valuable asset to your organization Why Choose Us: 1. Expert Instructors: Certified Lean Six Sigma Master Black Belts with extensive industry experience 2. Practical Approach: Real-world applications to tackle actual business challenges 3. Interactive Learning Environment: Stimulating discussions and collaboration with peers 4. Comprehensive Course Material: Access to a wealth of resources for exam preparation For inquiries, contact Daniel@certificationplanner.com or visit www.certificationplanner.com . Pass Guarantee Details: Ensure your employees' success with our comprehensive pass guarantee, including multiple attempts and access to additional resources. Eligibility: Participants should have a foundational understanding of Lean Six Sigma principles and prior experience in leading process improvement projects. Enroll in our transformative LSSBB Certification Workshop today and drive positive change within your organization. Don't miss out on this opportunity to become a certified Lean Six Sigma Black Belt Professional. Other Courses: Explore our range of certification courses, including CAPM, PgMP, RMP, CISSP, CISA, ITIL, Salesforce, and more.",
        "event_link": "https://www.eventbrite.com/e/lean-six-sigma-black-beltlssbb-training-boston-ma-in-person-class-tickets-1223253697739",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Business Classes",
            "#cism",
            "#cisa",
            "#certificationplanner"
        ]
    },
    {
        "title": "Business Social & Networking",
        "date_time": "Monday, April 28 · 6 - 9pm EDT.Doors at 1pm",
        "location": "Bar Moxy 240 Tremont Street Boston, MA 02116 Show map",
        "about": "Business Social & Networking – Connect, Collaborate, Grow Join us for an evening of meaningful connections, professional growth, and new opportunities at Business Social & Networking . This event is designed for entrepreneurs, business owners, and professionals eager to expand their networks, exchange ideas, and build valuable partnerships in a dynamic setting. Whether you want to connect with like-minded professionals, explore new opportunities, or take your business to the next level, this is the perfect space to spark engaging conversations and forge lasting relationships. Why Attend? ✅ Expand Your Network – Meet driven professionals and entrepreneurs ready to collaborate. ✅ Unlock Opportunities – Discover potential clients, business partners, and career prospects. ✅ Boost Your Visibility – Strengthen your presence within Boston’s thriving business community. ✅ Gain Insights & Support – Connect with key members of The Boston Business Hub and access valuable resources. What to Expect 🔹 Check-in upon arrival and receive your name tag for seamless networking. 🔹 A vibrant room filled with motivated professionals eager to connect. 🔹 A welcoming environment designed to foster meaningful business relationships. Reserve your spot today and start building powerful connections! Bar Moxy 240 Tremont Street Boston, MA 02116 6:00PM – Business Professionals The Boston Business Hub The Boston Business Hub connects entrepreneurs and young professionals with a network of 27,500 people across the Boston area. Our platform is designed to foster genuine connections and provide valuable training opportunities for those looking to grow their businesses or advance their careers. Founded in 2016, we’ve spent years building a trusted space where ideas are shared, skills are sharpened, and collaborations thrive. Whether you’re starting out or scaling up, The Boston Business Hub is here to support your journey. https://bostonbh.com/",
        "event_link": "https://www.eventbrite.com/e/business-social-networking-tickets-1316432818999",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Business Networking",
            "#business",
            "#networking",
            "#marketing",
            "#afterwork",
            "#networking_event",
            "#business_social"
        ]
    }
]