[
    {
        "title": "UNH Takes On Fenway Park and The Redsox",
        "date_time": "May 2 · 7pm - May 3 · 2am EDT",
        "location": "Fenway Park 4 Jersey Street Boston, MA 02215 Show map",
        "about": "UNH Senior Take On Fenway Park Date: Friday, May 2nd, 2024 Time: 7:00 PM – 9:30 PM After Party: 9:00 PM – 12:30 AM Location: Fenway Park, Boston, MA & GameOn Fenway (with DJ Poulin) Get ready for an unforgettable night as the University of New Hampshire (UNH) seniors and friends celebrate in style at one of the most iconic sports venues in the world—Fenway Park! On May 2nd, 2024, UNH students will experience the thrill of a live baseball game featuring the Minnesota Twins taking on the Boston Red Sox, all while making memories that will last a lifetime. This is not just any game; it's a celebration of your hard work and the culmination of your college years! But the fun doesn’t end with the game! After the final pitch, we'll keep the energy high and the party going at GameOn Fenway —an after-party spot just steps away from Fenway Park. UNH's own DJ Poulin will be spinning the hottest tracks, ensuring that the night stays electric from start to finish. This is the ultimate way to mark the end of your journey at UNH and ring in your next big adventure! Why You Can't Miss This: Live Baseball at Fenway Park : Watch the Minnesota Twins take on the Boston Red Sox in one of the most legendary stadiums in baseball. Exclusive Access : Enjoy a private, designated section for UNH students at the game and a VIP spot at the after-party. Epic After Party : Dance and celebrate with your classmates at GameOn Fenway, with DJ Poulin bringing the energy all night long. Memories for a Lifetime : This is the perfect way to say goodbye to your college years and celebrate your success with friends. Get ready to create lasting memories and celebrate your graduation in style with UNH Senior Take On Fenway Park —a night you won’t want to miss! ***",
        "event_link": "https://www.eventbrite.com/e/unh-takes-on-fenway-park-and-the-redsox-tickets-1092634582449?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#celebration",
            "#memories",
            "#2025",
            "#last_dance",
            "#unh_class"
        ]
    },
    {
        "title": "Ladies Love Dancehall",
        "date_time": "Sunday, April 27 · 5 - 10pm EDT",
        "location": "SOJUba 1265 Boylston Street Boston, MA 02215 Show map",
        "about": "Ladies Love Dancehall Was Amazing Last Time But Will Be Even Better This Timw Because We Bringing It To The Rooftop Of Sojuba 💃🏾🎬 MUSIC BY : Dj Focus x Trigga Tre x Dj Dutch & Dj Storm 🎵🎥 LOCATION SOJUBA BOSTON 1265 Boylston st Boston Ma 📍 ROSES & PHOTOBOOTH OFC FOR THE LADIES 🌹📸 WE ARE DOING A SPECIAL GIVING TO THE MOST HYPE LADY THAT NIGHT SO MAKE SURE YOU COME EARLY AND MAKE SURE YOU GRAB A TICKET BECAUSE THATS HOW YOU CAN ENTER THE CONTEST FOR OUR SPECIAL PRIZE ON THE NIGHT 💃🏾💃🏾💃🏾",
        "event_link": "https://www.eventbrite.com/e/ladies-love-dancehall-tickets-1314122579009?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#woman",
            "#drinks",
            "#food",
            "#music",
            "#party",
            "#rooftop",
            "#ladies",
            "#reggaeton",
            "#dancehall",
            "#rooftop_party"
        ]
    },
    {
        "title": "International Jazz Day Featuring Jason Palmer/Anastassiya Petrova",
        "date_time": "Wednesday, April 30 · 6 - 8pm EDT",
        "location": "Union Church 485 Columbus Avenue Boston, MA 02118 Show map",
        "about": "Boston Jazz Foundation Presents: International Jazz Day at Jazz Square Date: April 30, 2025 Time: 6:00 PM – 8:00 PM Location: Union Church, 485 Columbus Ave, Boston, MA FREE Admission – First Come, First Served Join us for an unforgettable International Jazz Day celebration featuring performances by renowned trumpeter Jason Palmer and award-winning pianist Anastassiya Petrova ! Hosted by Amanda Shea , this free, family-friendly event is part of the Jazz Square initiative, honoring Boston’s rich jazz history through live music, art installations, walking tours, and more. About the Artists Jason Palmer is a renowned trumpeter, composer, and educator who has performed with legends like Roy Haynes, Wynton Marsalis, Kurt Rosenwinkel, Ravi Coltrane, and Roy Hargrove. A fixture in Boston's jazz scene for over 20 years, Jason was named to the inaugural Boston Artist in Residence Fellowship for Music Composition and has twice been honored as a Massachusetts Cultural Council Fellow. Jason has released 20 albums as a bandleader on labels like Ayva, Steeplechase, Newvelle, and Giant Step Arts, with multiple 4-star reviews from Downbeat Magazine. He has performed in over 35 countries alongside artists such as Mark Turner, Greg Osby, Grace Kelly, and Matana Roberts. For two decades, Jason led the house band at Boston’s historic Wally’s Jazz Café and has performed at major venues and festivals throughout the Northeast. As an educator, he holds teaching positions at Berklee College of Music, New England Conservatory, and Arizona State University, and previously taught at Harvard University and The New School. A dedicated advocate for the local jazz community, Jason served as VP of JazzBoston from 2008 to 2020. He also starred in Damien Chazelle’s 2010 film Guy and Madeline on a Park Bench. The Band: Jason Palmer - Trumpet Gregory Groover Jr.- Saxophone Kevin Harris - Piano Max Ridley - Bass Lee Fish - Drums Anastassiya Petrova is a jazz pianist/organist from Kazakhstan currently based in New York City after spending 8 years living in Boston, MA. Anastassiya Petrova has been playing the piano since the age of 5. In 2015 she was granted a full-tuition scholarship to Berklee College of Music and later on was accepted to the Berklee Global Jazz Institute program, where she was mentored by renowned musicians such as John Patitucci, Danilo Perez, Joe Lovano, Terri Lyne Carrington, Ben Street, George Garzone, and others. She holds bachelor’s degree in Performance and Professional Music from Berklee College of Music and a master’s degree from Berklee Global Jazz Institute majoring in Global Jazz Performance. Throughout her musical career, she has been given opportunities to share the stage with renowned musicians such as Chris Potter, Grace Kelly, Noah Preminger, Lakecia Benjamin, Walter Smith III, Allan Chase, Patricia Perez, Ben Street, Adam Cruz, Marco Pignataro, Ellis Hall, Catherine Russell, Terri Lyne Carrington, Dave Liebman and others. She participated in international festivals such as Umbria Jazz Festival 2013 (Italy), Wave of Ideas 2015 (Bulgaria), Panama Jazz Festival 2020, 2021 (Panama), Beantown Jazz Festival 2018 (Boston, MA), Monterey Jazz Festival 2018 (Monterey, CA), and appeared at “The Voice” TV show in Kazakhstan and TEDx Talks at Suffolk University. She currently holds an Assistant Professor position at Berklee College of Music and Longy School of Music of Bard College. The Band: Anastassiya Petrova - Piano Ian Ashby - Bass Ivanna Gonzalez - Drums About Jazz Square Jazz Square is a collaborative effort between the Boston Jazz Foundation, Claremont Neighborhood Association, The Reckonings Project, Wally’s Café Jazz Club, and JazzBoston, with support from the Mayor’s Office of Arts and Culture. This initiative celebrates the intersection of Massachusetts and Columbus Avenues, a historic hub for jazz and Black culture in Boston. Don’t miss this special celebration of jazz, history, and community! More Info: bostonjazzfoundation.org Follow Us: Instagram: @bostonjazzfoundation Facebook: Boston Jazz Foundation",
        "event_link": "https://www.eventbrite.com/e/international-jazz-day-featuring-jason-palmeranastassiya-petrova-tickets-1299982535759?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#fundraiser",
            "#live_performance",
            "#music_event",
            "#international_jazz_day",
            "#jason_palmer",
            "#anastassiya_petrova"
        ]
    },
    {
        "title": "Berklee Onsite: 2025",
        "date_time": "May 30 · 8am - May 31 · 5pm EDT",
        "location": "Berklee College of Music 1140 Boylston St Boston, MA 02215 Show map",
        "about": "Get ready for an unforgettable experience at Berklee Onsite ! Join us Friday, May 30 through Saturday, May 31 on the Boston campus of Berklee College of Music for two days of live music, learning sessions, and networking events. Berklee Onsite gives you the opportunity for face-to-face connections with Berklee instructors, students, and advisors you might normally only get to interact with online. Berklee Onsite isn’t just for Berklee Online students; it’s open to the entire music community. Whether you’re looking to meet new friends, catch up with old ones, or soak in the wisdom of industry pros, this event is your chance to dive headfirst into the Berklee magic.",
        "event_link": "https://www.eventbrite.com/e/berklee-onsite-2025-tickets-1111939443809?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Music Conferences",
            "#music",
            "#education",
            "#boston",
            "#educational",
            "#conference",
            "#berklee",
            "#music_school",
            "#berkleeonsite",
            "#berkleeonsite2025"
        ]
    },
    {
        "title": "Beyond the Blackbox",
        "date_time": "Sunday, May 4 · 7 - 8pm EDT.Doors at 6:30pm",
        "location": "The Maso Studio At the Huntington Theatre 264 Huntington Avenue Boston, MA 02115 Show map",
        "about": "How do you balance a visual experience, which most things in life are? You gather people and create a true black box, no lights, no visuals. For the performers, \"sounding your best\" is emphasized and removing the visual element of crowd reaction is scary. For the sighted and low vision audience, sitting in dark discomfort and feeding the performers only through audible energy may be new. For the legally blind and totally blind audience, this is our life. Come grow in awareness and compassion as we serve disability advocacy through a night of Afro fusion, spoken word, and R&B. No use of phones or lights once music starts please! Human guide available for patrons",
        "event_link": "https://www.eventbrite.com/e/beyond-the-blackbox-tickets-1307757500889?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#disability",
            "#advocacy",
            "#afrofusion",
            "#spokenword",
            "#randb",
            "#musicnight",
            "#livemusicboston",
            "#bostonmusicsceane"
        ]
    },
    {
        "title": "R&B N❤️W “Part 1”",
        "date_time": "Sunday, April 27 · 5 - 9:30pm EDT",
        "location": "Nash Bar & Stage 253 Tremont Street Boston, MA 02116 Show map",
        "about": "Mark your calendars for an epic Funday at the BRAND NEW R&B N♥️W event on Sunday April 27th, 2025 at Nash Bar And Stage right in the heart of downtown Boston! Get ready to unwind and groove as we bring you a day filled with Current R&B music, AMAZING FOOD, vibrant energy, and an unforgettable atmosphere! Join us for an evening where all the BADDIES will be in the building, making the night not just fun but lit! Gather your ENTIRE crew, grab some drinks, and reserve a table for the ultimate Sunday Funday experience. The best NEW R&B hits, or chill and soak in the good vibes with friends. This is your chance to support a fantastic event while enjoying the company of amazing people. Come out and enjoy your Sunday with us at R&B N♥️W —where the vibes are high, the music is smooth, and the fun never stops! Let's make it a night to remember! Remember this a PROPER DRESSED EVENT👠 📍@nashbarboston 📅 SUNDAY APRIL 27TH ⏰ 5-9:30 PM 🎟️ RNBNOW.eventbrite.com 👨🏿‍🍳Full Kitchen Until 9:30PM 💃🏽Proper Dress is STRONGLY Encouraged 📞617-763-9177",
        "event_link": "https://www.eventbrite.com/e/rb-nw-part-1-tickets-1321725670059?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#music",
            "#love",
            "#soul",
            "#dayparty",
            "#heart",
            "#groove",
            "#bostonevents",
            "#brunching",
            "#downtownboston",
            "#rnb_party"
        ]
    },
    {
        "title": "Har Mar Superstar at the Boston Button Factory on 5/10",
        "date_time": "Saturday, May 10 · 7 - 11pm EDT",
        "location": "Boston Button factory 50 Melcher St Boston, MA 02210 Show map",
        "about": "Don't miss your chance to see the Har Mar Superstar band at the Boston Button Factory. This concert is guaranteed to be ELECTRIC!!! WHERE: Boston Button Factory, 50 Melcher st. Boston 02210 WHEN: Saturday, May, 10th from 7:00 - 11:00. Har Mar will go on around 9:30 WHY: Because the world could always use more dope art and music! And to support our friends at the Concussion Legacy Foundation , part of the proceeds from the event will go to support their mission to end CTE. If you would like to donate you can do so here MUSIC: The Har Mar Superstar band is on the road for the first time since 2019 and will be playing a set list including their original soul, R & B, pop, and electro jams. ART: The latest work from the Boston Button Factory resident artist, Ari Hauben will be on display including his newest collection, \"Weather the Storm\". BEVERAGES: A complimentary open bar will feature specialty cocktails, beer & wine. Purchase your Tickets Before They Sell Out",
        "event_link": "https://www.eventbrite.com/e/har-mar-superstar-at-the-boston-button-factory-on-510-tickets-1269310384529?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#concert",
            "#performance",
            "#live_music",
            "#har_mar_superstar",
            "#boston_button_factory"
        ]
    },
    {
        "title": "Dona nobis pacem",
        "date_time": "Starts on Saturday, May 3 · 8pm EDT",
        "location": "First Church in Cambridge 11 Garden Street Cambridge, MA 02138 Show map",
        "about": "The Jameson Singers present: DONA NOBIS PACEM Vaughan Williams | Dona nobis pacem Dana Lynne Varga, soprano Paul Max Tipton, bass-baritone Barber | Agnus Dei Pärt | Da pacem Domine Vasks | Dona nobis pacem Saturday, May 3, 2025 at 8 PM First Church Cambridge 11 Garden St Cambridge, MA Join the Jameson Singers in a call for peace through music at its choral orchestral spring concert featuring Ralph Vaughan Williams’ iconic cantata , Dona nobis pacem . Vaughan Williams’ stunning masterpiece features words selected from the Mass and Bible, an excerpt from a historical anti-war speech and poetry by the legendary Walt Whitman, all performed by a full choir, two soloists and an orchestra. The concert will also include the poignant Agnus Dei by Samuel Barber alongside the contemplative Da pacem Domine by Arvo Pärt and the compelling Dona nobis pacem by Pēteris Vasks . Tickets In advance: Preferred Seating (advance only): $50, General admission: $35, Student or limited income: $20, Under 18: $10 At the door: General admission: $40, Student or limited income: $25, Under 18: $15 Card to Culture We are proud to participate in Mass Cultural Council's Card to Culture program in collaboration with the Department of Transitional Assistance, the Department of Public Health's WIC Nutrition Program, the Massachusetts Health Connector, and hundreds of organizations by making cultural programming accessible to those for whom cost is a participation barrier. EBT and WIC cardholders may select the Card to Culture option on our ticketing website to obtain two free tickets per card (online ticketing is preferred). At the door, cardholders may present their EBT/WIC card in person to obtain two free tickets per card. See the complete list of participating organizations offering EBT , WIC , and ConnectorCare discounts. Masks strongly encouraged. If you’re feeling unwell, please stay home.",
        "event_link": "https://www.eventbrite.com/e/dona-nobis-pacem-tickets-1109302958009?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#choir",
            "#choral",
            "#holiday_music"
        ]
    },
    {
        "title": "Reggae Gold VS Strictly The Best Volume 2",
        "date_time": "Starts on Saturday, May 10 · 10pm EDT",
        "location": "Fete 25 Kingston Street Boston, MA 02111 Show map",
        "about": "Saturday May 10th, 2025 The return of Reggae Gold vs Strictly The Best volume 2! FETE 25 KINGSTON STREET, BOSTON MASS DOORS OPEN AT 10pm & party until 2am! FMI contact (617)982.8088 Get ready to dance to the hottest reggae riddims all night long. This event promises a mix of classic hits and fresh sounds. Let's bring the dancehall to life and create unforgettable memories together!",
        "event_link": "https://www.eventbrite.com/e/reggae-gold-vs-strictly-the-best-volume-2-tickets-1308441286109?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#dancehall",
            "#music_event",
            "#volume_2",
            "#reggae_gold",
            "#strictly_the_best"
        ]
    },
    {
        "title": "KONPA & SKATE",
        "date_time": "Thursday, May 15 · 7 - 11:30pm EDT",
        "location": "Chez Vous Roller Skating Rink 11 Rhoades Street Boston, MA 02124 Show map",
        "about": "KONPA & SKATE Come join us for a fun-filled night of konpa music and roller skating at Chez Vous Roller Skating Rink Boston ! THERE IS A $15 SKATE FEE TO CHEZ VOUS WHEN YOU ENTER THE VENUE  FOR SKATES Dance and Glide across the rink with your friends. Whether you're a seasoned skater or a beginner, this event for everyone looking to have a great time ! Music By DJ Hendrixxx, DJ Myoutt & More ! Food & Drinks will be available to purchase",
        "event_link": "https://www.eventbrite.com/e/konpa-skate-tickets-1217088196559?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#dance",
            "#music",
            "#party",
            "#caribbean",
            "#boston",
            "#nightlife",
            "#skate",
            "#haitian",
            "#konpa"
        ]
    },
    {
        "title": "LA MAQUINA/ORQ SAN VICENTE/TITO MIRA & LOS ANGELES NEGROS",
        "date_time": "May 10 · 9pm - May 11 · 1:30am EDT.Doors at 9pm",
        "location": "Oceanside Revere 1290 North Shore Road Revere, MA 02151 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/la-maquinaorq-san-vicentetito-mira-los-angeles-negros-tickets-1267623408739?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Revere, MA",
            "Revere Performances",
            "Revere Music Performances"
        ]
    },
    {
        "title": "BahareOmidBoston",
        "date_time": "Saturday, May 3 · 6 - 7:30pm EDT",
        "location": "Church of the Covenant 67 Newbury Street Boston, MA 02116 Show map",
        "about": "بهار امید Iranian Classical and Folk Music Concert کنسرت موسیقی سنتی و اصیل ایرانی USA Tour 2025 May 3rd Boston Saeed Farajpoori: Composer and Kamancheh Maliheh Moradi: Vocals Ehsan Matoori: Santoor Nariman Assadi: Daf & Tombak سرپرست گروه، آهنگساز ‌و کمانچه : استاد سعید فرجپوری آواز: ملیحه مرادی سنتور: احسان مطوری سازهای کوبه ای : نریمان اسعدی",
        "event_link": "https://www.eventbrite.com/e/bahareomidboston-tickets-1298595687659?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#music",
            "#boston",
            "#event",
            "#persian",
            "#spring",
            "#hope",
            "#kamancheh",
            "#tombak",
            "#santoor"
        ]
    },
    {
        "title": "BRAND NUBIAN LIVE AT THE R&B REMIX PARTY, MIXX 360, MALDEN, MA",
        "date_time": "May 3 · 9:30pm - May 4 · 2am EDT",
        "location": "MIXX 360 Nightlife 665 Broadway Malden, MA 02148 Show map",
        "about": "The R&B Remix Party A once a month event featuring national artists, dope DJs, nonstop vibes, live performances & flawless mixes. From the stage to the booth , it’s all heat, all night!!! This month we offer Golden Era of Hip Hop vs R&B Join us for a legendary night with Brand Nubian live in concert and DJ Dex on the 1s & 2s. Saturday, May 3rd, 2025 Mixx 360 | Malden, MA Doors Open: 9:30 PM – 2:00 AM We’re bringing the boom bap back and blending it with R&B from the 90's & 2000's for a night that pays tribute to the icons and anthems that shaped the culture. What to expect from Brand Nubian: Brand Nubian is one of hip-hop’s most influential and respected groups, known for blending lyrical substance, conscious commentary on race, culture, politics, street wisdom, and infectious beats. Infused with Five-Percenter philosophy, Afrocentric pride, and unapologetic social commentary. They balance knowledge with charisma and style. When Brand Nubian hits the stage, it’s not just a performance, it’s a masterclass in real hip-hop culture. They will be Performing live, hits that defined the Golden Era (All for One, Don't Let it Go To Your Head, Slow Down, Punks Jump Up To Get Beat Down, One For All, Wake Up, Word is Bond, Step to The Rear & more). DJ Dex – Spinning the ultimate remix showdown: classic Hip-Hop vs unforgettable R&B 2 large dance floors, full bars, outdoor cigar lounge, free parking & therapy for the soul all night long! Whether you’re rocking to the rhythm or repping your era, this is the party for the true music heads who live for beats, and timeless soundtracks. Dress fly. Pull up early. Feel the love. Live the music. No drama!",
        "event_link": "https://www.eventbrite.com/e/brand-nubian-live-at-the-rb-remix-party-mixx-360-malden-ma-tickets-1304338093349?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Malden, MA",
            "Malden Performances",
            "Malden Music Performances",
            "#live_music",
            "#urbanelevation",
            "#mixx_360",
            "#rnb_remix_party",
            "#brand_nubian",
            "#malden_ma",
            "#a_list_events"
        ]
    },
    {
        "title": "BOLLYWOOD BLACK OUT AT GRAND ( 3 DJs - VIOLINIST - SINGER)",
        "date_time": "April 30 · 10pm - May 1 · 2am EDT.Doors at 10pm",
        "location": "The Grand Boston 58 Seaport Boulevard 300 Boston, MA 02210 Show map",
        "about": "BOSTON'S BIGGEST BOLLYWOOD PARTY AT TOP NIGHT CLUB THE GRAND BOSTON ARTISTS : DJ RAKESH , DJ VIK & DJ RAVLOR - RADHA MUSIC & VIOLINIST PAVANI Dress Code : Strictly BLACK (No Black Dress - No Entry) Date: WEDNESDAY , APRIL 30th , 2025 Venue: THE GRAND BOSTON 58 Seaport Blvd, #300, Boston, MA 02110 VIP TABLES - RAKESH :480-371-7787 Doors Open 10:00pm Strictly A 21+ Event ONLY IMPORTANT NOTES - PLEASE READ * Be There Early To Avoid Long Lines * All Tickets are Final an NO REFUNDS whatsoever * CLUB has the right to refuse if capacity is reached. So COME EARLY ! VALID FORM OF ID : State issued ID / Driver License or Passport. NO other forms of identification will be accepted! Photocopies or pictures of your IDs on your phone will NOT be accepted. Space is limited, FIRST COME FIRST SERVE. (NO REFUNDS) so buy your tickets soon NOTE: This is a public event which will be recorded. You may appear in pictures/video recordings. We have full rights to use this media anywhere without seeking your prior or post permissions.",
        "event_link": "https://www.eventbrite.com/e/bollywood-black-out-at-grand-3-djs-violinist-singer-tickets-1318338749689?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#dj_vik",
            "#dj_ravlor",
            "#the_grand_boston",
            "#dj_rakesh",
            "#bollywood_black_out"
        ]
    },
    {
        "title": "Global Jubilance—Music from Europe, Latin America, Asia, and the US",
        "date_time": "Friday, May 9 · 8 - 9:30pm EDT",
        "location": "Kresge Auditorium 48 Massachusetts Avenue #w16 Cambridge, MA 02139 Show map",
        "about": "Global Jubilance—Music from Europe, Latin America, Asia, and the United States MIT Wind Ensemble Frederick Harris, Jr. , Music Director Kenneth Amis , Assistant conductor Scott Stransky ’05, (G), ’07, guest conductor Andrea Marcano-Delgado (G), vocals Friday, May 9, 8:00pm Kresge Auditorium , MIT The MIT Wind Ensemble concludes its 24-25 season with an exciting program of works by composers from eleven countries. The concert includes the Boston premiere of “El Arte Del Bolero” Suite, arranged by Shimon Gambourg , featuring music from the Latin American Songbook, Gustav Holst’s masterpiece Hammersmith, Courtly Airs and Dances by the late Ron Nelson, Bach’s famed Toccata and Fugue in D minor, arranged by Donald Hunsberger, MIT alumnus Scott Stransky’s Suite from an Imaginary Movie (dedicated to the memory of Debra and Keith Stransky), and chamber works by Gabrieli, Glazounow, Yagisawa, and others. *Pre-registrations are for paid General Admission tickets only. MIT Students, Faculty, and Staff may attend for free by showing their MIT ID at the door, pending availability of space. Scott Stransky Scott Stransky has been an active member of the MIT Wind Ensemble since he began his undergraduate studies at MIT in 2001, having now performed at 90 in person concerts in a row.He is the Historian of the group. While an undergraduate, he studied music composition with Charles Shadle. He graduated from MIT in 2005 with a degree in Mathematics with Computer Science and minors in Music and Earth, Atmospheric, and Planetary Science. Stransky earned his master’s degree from MIT in 2007 in Atmospheric Science. He is Managing Director and Head of the Marsh McLennan Cyber Risk Intelligence Center. Under his leadership, the Center leverages Marsh McLennan’s proprietary data sets and external data sources, and combines them with advanced machine learning algorithms, stochastic modeling techniques, and Monte Carlo simulations, to develop a robust suite of models for managing cyber risk. He is a recognized speaker on the topics of cyber insurance risk and catastrophe modeling, having been invited to speak on these topics at conferences around the world. He was voted by his industry peers to be the 2023 Cyber Risk Industry Person of the Year in the Actuary/Modeler category. Scott is trying to visit all 433 National Parks in the United States. He has been to 412 so far. Since he's almost done with that, he's added other goals, such as getting to all the UNESCO World Heritage Sites, all the US state tripoints, all the US counties, and all the US/Canada border crossings. He has written the music for several of the National Park Travelers Club annual convention preview videos, which can be seen on YouTube. Scott considers Fred Harris and Ken Amis to be two of the most inspirational people in his life, and wishes to thank them for all the effort and heart they put into MITWE. Andrea Marcano-Delgado Andrea Marcano-Delgado is a singer and songwriter from Puerto Rico, currently pursuing a Ph.D. in Chemistry at MIT. Her musical journey bridges Latin music and musical theater, with recent work exploring jazz performance as an MIT Emerson/Harris Fellow. Blending her Caribbean roots with theatrical flair, Andrea crafts performances that are vibrant, rooted in identity, and rich with storytelling. Learn more about the MIT Wind Ensemble here. Seating Policy Your registration through Eventbrite guarantees you a seat until 15 minutes before the event start time. 15 minutes before the concert start time, we will release open seats to the standby list. If you were not able to register through Eventbrite, you may join the physical standby line in the Kresge Auditorium Lobby up to one hour before the concert start time. Don't miss a downbeat! Click here to subscribe to the Events Newsletter.",
        "event_link": "https://www.eventbrite.com/e/global-jubilancemusic-from-europe-latin-america-asia-and-the-us-tickets-1323593968189?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#music",
            "#asia",
            "#europe",
            "#latin_america",
            "#global_jubilance"
        ]
    },
    {
        "title": "Peter Asher: A Musical Memoir of the 60s & Beyond",
        "date_time": "Starts on Sunday, May 18 · 2pm EDT",
        "location": "Regent Theatre 7 Medford Street Arlington, MA 02474 Show map",
        "about": "PETER ASHER: A MUSICAL MEMOIR OF THE 60'S AND BEYOND “…as Mr. Asher regaled a delighted audience with stories… he conjured history in the making, before it was set in stone.” – Stephen Holden, New York Times “…the exuberant Mr. Asher knew anyone who rocked and everyone who mattered.” –Wall Street Journal “An all-around charming and delightful fellow — he reminisces about his whole career and it is highly entertaining” – Steve Martin “Everybody should go and see it — I’ve seen it myself twice” – Linda Ronstadt \"The Man, The Myth, The Legend! ...and a true friend! Great wit and music. A true storyteller! What more could you possibly want? Don’t miss this!\"--Hans Zimmer We first came to know him through the global smash “World Without Love” as one half of the British Invasion duo Peter & Gordon. He returns--now a Commander of the Most Excellent Order of the British Empire-- in “Peter Asher: A Musical Memoir of the 60s and Beyond” which brings a multimedia experience to the stage, hosted by the two-time Grammy winner for Producer of the Year. Peter Asher moved effortlessly from his role with Peter & Gordon to Music Executive with the Beatles’ Apple Records, then famously- (as in cover of Rolling Stone magazine level famous)- to Producer and Manager, handling the careers of James Taylor, Linda Ronstadt and a host of others. Books abound, documentaries with half-truths (and worse) are all too common, but, now, finally, Mr. Asher tells first hand his tales from the eye of the cultural hurricane in this intimate evening. “Memoir” includes film footage and photos from Peter’s considerable personal archive, brought to life with a storyteller’s gift, transporting audiences back to the heart of 60s popular culture. Icons such as Mick Jagger, John Lennon, Paul McCartney, Marianne Faithful, Yoko Ono, Carole King, James Taylor and Linda Ronstadt are among the cast of characters in this narrative – along (of course) with the greatly missed Gordon Waller. The evening is filled with the music of Peter & Gordon, including “I Go to Pieces,” “True Love Ways,” and “Lady Godiva.” The songs given to Peter & Gordon by Paul McCartney are also front and center: “Woman,” “I Don’t Want to See You Again,” Nobody I Know,” and “World Without Love,” all of which were US Top 40 hits. Peter presents these timeless classics along with other old favourites from that golden era. The show brings the audience through the earliest days of Peter’s journey all the way to the present day, and projects including his SiriusXM radio show on the Beatles Channel, \"From Me to You\" . Peter's book based on the show, \"The Beatles A to Zed\" was released by MacMillan on October 29, 2019; the book is already in it's third printing. Peter remains a sought after producer, and Memoir delves into that part of his life as well. The Peter Asher-produced CD by Steve Martin and the Steep Canyon Rangers, \"The Long Awaited Album\", was released September 22, 2017, with a stand-alone single, \"California' released in January of 2020. They are among several production efforts Steve Martin has asked Mr. Asher to oversee, including a 2018 PBS TV special with Martin Short and the Steep Canyon Rangers. Covered also is Peter’s production of the “Love Has Come for You” CD by Steve Martin and Edie Brickell — the title track a Grammy Winner in 2014- and the stage show based on it, “Bright Star,” which garnered 5 Tony nominations in its run on Broadway in 2016. A project celebrating Elton John’s songwriting partnership with Bernie Taupin saw the light of day in 2018, \"Revamped\" ; among the highlights was Ed Sheeran's take on Candle in The Wind\", produced by Mr. Asher. The celebratory collection was a follow up to the Peter Asher-produced special edition of “Goodbye Yellow Brick Road” -released in March 2014 – which featured Ed Sheeran, Imelda May, Fall Out Boy, and others covering songs from that classic album. Peter takes you behind the curtain of the Rock and Roll Hall of Fame induction ceremony, where he inducted two old friends, the Rolling Stones’ first manager Andrew Loog Oldham and the Beatles’ Manager Brian Epstein. The PBS special “Buddy Holly: Listen to Me -The Ultimate Buddy Party” is still being aired regularly, and its sister CD, “Listen to Me: Buddy Holly” remains a favorite. His work on soundtracks (\"Amazing Spider-Man 2,” “Man Of Steel,” “Rush.”, etc), alongside the legendary Hans Zimmer, is touched on also, as well as the 2017 \"Hans Zimmer Live!\" tour of the USA and Europe that Mr. Asher Directed. August 6, 2021 saw the release, on Compass Records' Red House imprint, the Peter Asher produced \"Why Wait!\" from Kate Taylor. James' \"Sister Kate\" is backed by Albert Lee, Danny Kortchmar, Russ Kunkel, Leland Sklar, Waddy Wachtel, Victoria Asher, Scarlet Rivera and more. Many of the same cast to worked on the new album by the Bangles' Susanna Hoffs, which Mr. Asher produced was released in 2023. Most recently, Peter and Walter Afanasieff co-produced Barbra Streisand's April 2024 release, ‘Love Will Survive,’ the theme for Peacock Television’s ‘The Tattooist of Auschwitz’. Now, fifteen years on, “Memoir” continues to thrill, as the reviews attest. On a more personal note, friends such as Liza Minelli, Eric Idle, Paul Shaffer, Ray Davies, Bill Wyman, Ken Follett, Edie Brickell, Billy Connolly, Jeff Lynne, Paul Simon, Bob Balaban, Joan Collins, Steve Martin, Ed Sheeran, Tony Shalhoub, Linda Ronstadt, and Michael Feinstein have been among the audiences in New York, San Francisco, Los Angeles, and London that have given standing ovations to “Peter Asher: A Musical Memoir of the 60s and Beyond.” TICKETS ARE NON-REFUNDABLE",
        "event_link": "https://www.eventbrite.com/e/peter-asher-a-musical-memoir-of-the-60s-beyond-tickets-1314191535259?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Arlington, MA",
            "Arlington Performances",
            "Arlington Music Performances",
            "#event",
            "#60s",
            "#beyond",
            "#peter_asher",
            "#musical_memoir"
        ]
    },
    {
        "title": "DI SOCA  CHAMBER",
        "date_time": "May 3 · 10pm - May 4 · 2am EDT",
        "location": "Sorrel and Lime 986 Blue Hill Avenue Boston, MA 02124 Show map",
        "about": "",
        "event_link": "https://www.eventbrite.com/e/di-soca-chamber-tickets-1266842683569?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#soca",
            "#dance_party",
            "#music_event",
            "#cultural_celebration",
            "#caribbean_vibes",
            "#soca_chamber"
        ]
    },
    {
        "title": "TrueVines/Adult Fiction Dual Release  WSG Highway Hosiery",
        "date_time": "Friday, May 9 · 8 - 11:30pm EDT",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "TrueVines is a Boston-based band blending '60s British influences with a raw American vibe. Fronted by legendary songwriter Dennis Brennan, this powerhouse lineup features guitarist Andrew Stern, bassist Jim Haggerty, and drummer Chris Anzalone—all veterans of the local and national music scene. Originally a side project born during the pandemic, TrueVines has evolved into Brennan’s primary creative outlet, embracing a rougher, high-energy sound steeped in garage rock and soul. Their forthcoming six-song release captures the band’s unique chemistry: quick, raunchy originals that channel the raw spirit of the ’60s, soulful struts, and even a nod to their rootsy side with a country ballad. With shout-along choruses, swaggering guitars, and an unapologetic sense of fun, TrueVines proves that rock and roll is still very much alive. Guitarist Andrew Stern, originally from Illinois, honed his craft in Boston after stints in California and New York’s vibrant music scenes. He has worked across a range of styles with artists like Dennis Brennan, Mark Erelli, and Brian Carpenter and leads several projects, including his adventurous trio, AS3. Stern’s versatile and inventive guitar work is a cornerstone of TrueVines’ sound. Bassist Jim Haggerty and drummer Chris Anzalone bring decades of experience as first-call studio musicians and live performers. Known for their dynamic and impeccable musicianship, they form the backbone of TrueVines, driving its raw and electric energy. Described by Mod Magazine as “still in the attic or the garage, and loving every second of it,” TrueVines captures the freedom and vitality of a band playing for the sheer joy of it. TrueVines",
        "event_link": "https://www.eventbrite.com/e/truevinesadult-fiction-dual-release-wsg-highway-hosiery-tickets-1286831871769?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#rock",
            "#livemusic",
            "#garagerock",
            "#livemusicvenue",
            "#harvardsquare",
            "#adultfiction",
            "#lizardlounge",
            "#cambridgemass",
            "#truevines",
            "#highwayhosiery"
        ]
    },
    {
        "title": "UNH Takes On Fenway Park and The Redsox",
        "date_time": "May 2 · 7pm - May 3 · 2am EDT",
        "location": "Fenway Park 4 Jersey Street Boston, MA 02215 Show map",
        "about": "UNH Senior Take On Fenway Park Date: Friday, May 2nd, 2024 Time: 7:00 PM – 9:30 PM After Party: 9:00 PM – 12:30 AM Location: Fenway Park, Boston, MA & GameOn Fenway (with DJ Poulin) Get ready for an unforgettable night as the University of New Hampshire (UNH) seniors and friends celebrate in style at one of the most iconic sports venues in the world—Fenway Park! On May 2nd, 2024, UNH students will experience the thrill of a live baseball game featuring the Minnesota Twins taking on the Boston Red Sox, all while making memories that will last a lifetime. This is not just any game; it's a celebration of your hard work and the culmination of your college years! But the fun doesn’t end with the game! After the final pitch, we'll keep the energy high and the party going at GameOn Fenway —an after-party spot just steps away from Fenway Park. UNH's own DJ Poulin will be spinning the hottest tracks, ensuring that the night stays electric from start to finish. This is the ultimate way to mark the end of your journey at UNH and ring in your next big adventure! Why You Can't Miss This: Live Baseball at Fenway Park : Watch the Minnesota Twins take on the Boston Red Sox in one of the most legendary stadiums in baseball. Exclusive Access : Enjoy a private, designated section for UNH students at the game and a VIP spot at the after-party. Epic After Party : Dance and celebrate with your classmates at GameOn Fenway, with DJ Poulin bringing the energy all night long. Memories for a Lifetime : This is the perfect way to say goodbye to your college years and celebrate your success with friends. Get ready to create lasting memories and celebrate your graduation in style with UNH Senior Take On Fenway Park —a night you won’t want to miss! ***",
        "event_link": "https://www.eventbrite.com/e/unh-takes-on-fenway-park-and-the-redsox-tickets-1092634582449",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#celebration",
            "#memories",
            "#2025",
            "#last_dance",
            "#unh_class"
        ]
    },
    {
        "title": "Berklee Onsite: 2025",
        "date_time": "May 30 · 8am - May 31 · 5pm EDT",
        "location": "Berklee College of Music 1140 Boylston St Boston, MA 02215 Show map",
        "about": "Get ready for an unforgettable experience at Berklee Onsite ! Join us Friday, May 30 through Saturday, May 31 on the Boston campus of Berklee College of Music for two days of live music, learning sessions, and networking events. Berklee Onsite gives you the opportunity for face-to-face connections with Berklee instructors, students, and advisors you might normally only get to interact with online. Berklee Onsite isn’t just for Berklee Online students; it’s open to the entire music community. Whether you’re looking to meet new friends, catch up with old ones, or soak in the wisdom of industry pros, this event is your chance to dive headfirst into the Berklee magic.",
        "event_link": "https://www.eventbrite.com/e/berklee-onsite-2025-tickets-1111939443809",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Music Conferences",
            "#music",
            "#education",
            "#boston",
            "#educational",
            "#conference",
            "#berklee",
            "#music_school",
            "#berkleeonsite",
            "#berkleeonsite2025"
        ]
    },
    {
        "title": "Beyond the Blackbox",
        "date_time": "Sunday, May 4 · 7 - 8pm EDT.Doors at 6:30pm",
        "location": "The Maso Studio At the Huntington Theatre 264 Huntington Avenue Boston, MA 02115 Show map",
        "about": "How do you balance a visual experience, which most things in life are? You gather people and create a true black box, no lights, no visuals. For the performers, \"sounding your best\" is emphasized and removing the visual element of crowd reaction is scary. For the sighted and low vision audience, sitting in dark discomfort and feeding the performers only through audible energy may be new. For the legally blind and totally blind audience, this is our life. Come grow in awareness and compassion as we serve disability advocacy through a night of Afro fusion, spoken word, and R&B. No use of phones or lights once music starts please! Human guide available for patrons",
        "event_link": "https://www.eventbrite.com/e/beyond-the-blackbox-tickets-1307757500889",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#disability",
            "#advocacy",
            "#afrofusion",
            "#spokenword",
            "#randb",
            "#musicnight",
            "#livemusicboston",
            "#bostonmusicsceane"
        ]
    },
    {
        "title": "Har Mar Superstar at the Boston Button Factory on 5/10",
        "date_time": "Saturday, May 10 · 7 - 11pm EDT",
        "location": "Boston Button factory 50 Melcher St Boston, MA 02210 Show map",
        "about": "Don't miss your chance to see the Har Mar Superstar band at the Boston Button Factory. This concert is guaranteed to be ELECTRIC!!! WHERE: Boston Button Factory, 50 Melcher st. Boston 02210 WHEN: Saturday, May, 10th from 7:00 - 11:00. Har Mar will go on around 9:30 WHY: Because the world could always use more dope art and music! And to support our friends at the Concussion Legacy Foundation , part of the proceeds from the event will go to support their mission to end CTE. If you would like to donate you can do so here MUSIC: The Har Mar Superstar band is on the road for the first time since 2019 and will be playing a set list including their original soul, R & B, pop, and electro jams. ART: The latest work from the Boston Button Factory resident artist, Ari Hauben will be on display including his newest collection, \"Weather the Storm\". BEVERAGES: A complimentary open bar will feature specialty cocktails, beer & wine. Purchase your Tickets Before They Sell Out",
        "event_link": "https://www.eventbrite.com/e/har-mar-superstar-at-the-boston-button-factory-on-510-tickets-1269310384529",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#concert",
            "#performance",
            "#live_music",
            "#har_mar_superstar",
            "#boston_button_factory"
        ]
    },
    {
        "title": "Ladies Love Dancehall",
        "date_time": "Sunday, April 27 · 5 - 10pm EDT",
        "location": "SOJUba 1265 Boylston Street Boston, MA 02215 Show map",
        "about": "Ladies Love Dancehall Was Amazing Last Time But Will Be Even Better This Timw Because We Bringing It To The Rooftop Of Sojuba 💃🏾🎬 MUSIC BY : Dj Focus x Trigga Tre x Dj Dutch & Dj Storm 🎵🎥 LOCATION SOJUBA BOSTON 1265 Boylston st Boston Ma 📍 ROSES & PHOTOBOOTH OFC FOR THE LADIES 🌹📸 WE ARE DOING A SPECIAL GIVING TO THE MOST HYPE LADY THAT NIGHT SO MAKE SURE YOU COME EARLY AND MAKE SURE YOU GRAB A TICKET BECAUSE THATS HOW YOU CAN ENTER THE CONTEST FOR OUR SPECIAL PRIZE ON THE NIGHT 💃🏾💃🏾💃🏾",
        "event_link": "https://www.eventbrite.com/e/ladies-love-dancehall-tickets-1314122579009",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#woman",
            "#drinks",
            "#food",
            "#music",
            "#party",
            "#rooftop",
            "#ladies",
            "#reggaeton",
            "#dancehall",
            "#rooftop_party"
        ]
    },
    {
        "title": "R&B N❤️W “Part 1”",
        "date_time": "Sunday, April 27 · 5 - 9:30pm EDT",
        "location": "Nash Bar & Stage 253 Tremont Street Boston, MA 02116 Show map",
        "about": "Mark your calendars for an epic Funday at the BRAND NEW R&B N♥️W event on Sunday April 27th, 2025 at Nash Bar And Stage right in the heart of downtown Boston! Get ready to unwind and groove as we bring you a day filled with Current R&B music, AMAZING FOOD, vibrant energy, and an unforgettable atmosphere! Join us for an evening where all the BADDIES will be in the building, making the night not just fun but lit! Gather your ENTIRE crew, grab some drinks, and reserve a table for the ultimate Sunday Funday experience. The best NEW R&B hits, or chill and soak in the good vibes with friends. This is your chance to support a fantastic event while enjoying the company of amazing people. Come out and enjoy your Sunday with us at R&B N♥️W —where the vibes are high, the music is smooth, and the fun never stops! Let's make it a night to remember! Remember this a PROPER DRESSED EVENT👠 📍@nashbarboston 📅 SUNDAY APRIL 27TH ⏰ 5-9:30 PM 🎟️ RNBNOW.eventbrite.com 👨🏿‍🍳Full Kitchen Until 9:30PM 💃🏽Proper Dress is STRONGLY Encouraged 📞617-763-9177",
        "event_link": "https://www.eventbrite.com/e/rb-nw-part-1-tickets-1321725670059",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#music",
            "#love",
            "#soul",
            "#dayparty",
            "#heart",
            "#groove",
            "#bostonevents",
            "#brunching",
            "#downtownboston",
            "#rnb_party"
        ]
    },
    {
        "title": "International Jazz Day Featuring Jason Palmer/Anastassiya Petrova",
        "date_time": "Wednesday, April 30 · 6 - 8pm EDT",
        "location": "Union Church 485 Columbus Avenue Boston, MA 02118 Show map",
        "about": "Boston Jazz Foundation Presents: International Jazz Day at Jazz Square Date: April 30, 2025 Time: 6:00 PM – 8:00 PM Location: Union Church, 485 Columbus Ave, Boston, MA FREE Admission – First Come, First Served Join us for an unforgettable International Jazz Day celebration featuring performances by renowned trumpeter Jason Palmer and award-winning pianist Anastassiya Petrova ! Hosted by Amanda Shea , this free, family-friendly event is part of the Jazz Square initiative, honoring Boston’s rich jazz history through live music, art installations, walking tours, and more. About the Artists Jason Palmer is a renowned trumpeter, composer, and educator who has performed with legends like Roy Haynes, Wynton Marsalis, Kurt Rosenwinkel, Ravi Coltrane, and Roy Hargrove. A fixture in Boston's jazz scene for over 20 years, Jason was named to the inaugural Boston Artist in Residence Fellowship for Music Composition and has twice been honored as a Massachusetts Cultural Council Fellow. Jason has released 20 albums as a bandleader on labels like Ayva, Steeplechase, Newvelle, and Giant Step Arts, with multiple 4-star reviews from Downbeat Magazine. He has performed in over 35 countries alongside artists such as Mark Turner, Greg Osby, Grace Kelly, and Matana Roberts. For two decades, Jason led the house band at Boston’s historic Wally’s Jazz Café and has performed at major venues and festivals throughout the Northeast. As an educator, he holds teaching positions at Berklee College of Music, New England Conservatory, and Arizona State University, and previously taught at Harvard University and The New School. A dedicated advocate for the local jazz community, Jason served as VP of JazzBoston from 2008 to 2020. He also starred in Damien Chazelle’s 2010 film Guy and Madeline on a Park Bench. The Band: Jason Palmer - Trumpet Gregory Groover Jr.- Saxophone Kevin Harris - Piano Max Ridley - Bass Lee Fish - Drums Anastassiya Petrova is a jazz pianist/organist from Kazakhstan currently based in New York City after spending 8 years living in Boston, MA. Anastassiya Petrova has been playing the piano since the age of 5. In 2015 she was granted a full-tuition scholarship to Berklee College of Music and later on was accepted to the Berklee Global Jazz Institute program, where she was mentored by renowned musicians such as John Patitucci, Danilo Perez, Joe Lovano, Terri Lyne Carrington, Ben Street, George Garzone, and others. She holds bachelor’s degree in Performance and Professional Music from Berklee College of Music and a master’s degree from Berklee Global Jazz Institute majoring in Global Jazz Performance. Throughout her musical career, she has been given opportunities to share the stage with renowned musicians such as Chris Potter, Grace Kelly, Noah Preminger, Lakecia Benjamin, Walter Smith III, Allan Chase, Patricia Perez, Ben Street, Adam Cruz, Marco Pignataro, Ellis Hall, Catherine Russell, Terri Lyne Carrington, Dave Liebman and others. She participated in international festivals such as Umbria Jazz Festival 2013 (Italy), Wave of Ideas 2015 (Bulgaria), Panama Jazz Festival 2020, 2021 (Panama), Beantown Jazz Festival 2018 (Boston, MA), Monterey Jazz Festival 2018 (Monterey, CA), and appeared at “The Voice” TV show in Kazakhstan and TEDx Talks at Suffolk University. She currently holds an Assistant Professor position at Berklee College of Music and Longy School of Music of Bard College. The Band: Anastassiya Petrova - Piano Ian Ashby - Bass Ivanna Gonzalez - Drums About Jazz Square Jazz Square is a collaborative effort between the Boston Jazz Foundation, Claremont Neighborhood Association, The Reckonings Project, Wally’s Café Jazz Club, and JazzBoston, with support from the Mayor’s Office of Arts and Culture. This initiative celebrates the intersection of Massachusetts and Columbus Avenues, a historic hub for jazz and Black culture in Boston. Don’t miss this special celebration of jazz, history, and community! More Info: bostonjazzfoundation.org Follow Us: Instagram: @bostonjazzfoundation Facebook: Boston Jazz Foundation",
        "event_link": "https://www.eventbrite.com/e/international-jazz-day-featuring-jason-palmeranastassiya-petrova-tickets-1299982535759",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#fundraiser",
            "#live_performance",
            "#music_event",
            "#international_jazz_day",
            "#jason_palmer",
            "#anastassiya_petrova"
        ]
    },
    {
        "title": "BOLLYWOOD BLACK OUT AT GRAND ( 3 DJs - VIOLINIST - SINGER)",
        "date_time": "April 30 · 10pm - May 1 · 2am EDT.Doors at 10pm",
        "location": "The Grand Boston 58 Seaport Boulevard 300 Boston, MA 02210 Show map",
        "about": "BOSTON'S BIGGEST BOLLYWOOD PARTY AT TOP NIGHT CLUB THE GRAND BOSTON ARTISTS : DJ RAKESH , DJ VIK & DJ RAVLOR - RADHA MUSIC & VIOLINIST PAVANI Dress Code : Strictly BLACK (No Black Dress - No Entry) Date: WEDNESDAY , APRIL 30th , 2025 Venue: THE GRAND BOSTON 58 Seaport Blvd, #300, Boston, MA 02110 VIP TABLES - RAKESH :480-371-7787 Doors Open 10:00pm Strictly A 21+ Event ONLY IMPORTANT NOTES - PLEASE READ * Be There Early To Avoid Long Lines * All Tickets are Final an NO REFUNDS whatsoever * CLUB has the right to refuse if capacity is reached. So COME EARLY ! VALID FORM OF ID : State issued ID / Driver License or Passport. NO other forms of identification will be accepted! Photocopies or pictures of your IDs on your phone will NOT be accepted. Space is limited, FIRST COME FIRST SERVE. (NO REFUNDS) so buy your tickets soon NOTE: This is a public event which will be recorded. You may appear in pictures/video recordings. We have full rights to use this media anywhere without seeking your prior or post permissions.",
        "event_link": "https://www.eventbrite.com/e/bollywood-black-out-at-grand-3-djs-violinist-singer-tickets-1318338749689",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#dj_vik",
            "#dj_ravlor",
            "#the_grand_boston",
            "#dj_rakesh",
            "#bollywood_black_out"
        ]
    },
    {
        "title": "Elevation Boston 2025",
        "date_time": "N/A",
        "location": "TBD Boston Boston, MA 02124 Show map",
        "about": "The Elevation Conference in its 9th year is the longest running conference in New England bringing together young artists, music entrepreneurs, faith leaders, and community members for a transformative experience. The conference features: - Live Worship - The Plug Live Music Feedback Contest : Best song wins a career changing prize package - Panels : Dating and Marriage, Branding, Theological Differences - Workshops : Dance, Videography/Photography, Merch - A brunch for local pastors and youth leaders - The best Christian Hip Hop concert in New England every year. Schedule Friday, May 30th, 12:00pm Opening Session The Plug Live Music Feedback Contest Contestants will play one song live for our panel of judges including Dria head A&R at Capitol CMG. The best song will win a prize package including radio airplay, distribution services, financial consultations and more. Elevation Night of Worship VIP After Party (18+) Saturday, May 31st, 12:00pm General Session #1 The Issues That Divide Churches feat Ruslan General Session #2 Marriage and Dating feat The Fryes Genereal Session #3 Christians and Counseling Pastor Kadeem BreakOut Sessions - Hip Hop Dance Class, Videography and Photography, Merch 101 Finale Concert (18+) feat WhatupRG, Jon Keith, 1Kphew, Prodigal Joe and More",
        "event_link": "https://www.eventbrite.com/e/elevation-boston-2025-tickets-1060199919499?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Music Conferences"
        ]
    },
    {
        "title": "DI PAULLO & PAULINO",
        "date_time": "April 27 · 9pm - April 28 · 1:30am EDT.Doors at 9pm",
        "location": "Oceanside Revere 1290 North Shore Road Revere, MA 02151 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/di-paullo-paulino-tickets-1272959418889?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Revere, MA",
            "Revere Performances",
            "Revere Music Performances"
        ]
    },
    {
        "title": "SOCA DE MAYO",
        "date_time": "Sunday, May 4 · 5 - 10pm EDT",
        "location": "Savvor Restaurant and Lounge 180 Lincoln Street Boston, MA 02111 Show map",
        "about": "Welcome to SOCA DE MAYO PT.II ! Get ready to celebrate the vibrant culture and music of the Caribbean at Savvor Restaurant and Lounge. Join us on Sunday, May 4th, 2025 at 5:00 PM for a evening filled with lively soca beats, delicious food, and refreshing drinks. Let loose and dance the night away with friends and family in a festive atmosphere. Don't miss out on this exciting event that promises to be a memorable experience. See you there!",
        "event_link": "https://www.eventbrite.com/e/soca-de-mayo-tickets-1310515460019?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#dance",
            "#drinks",
            "#music",
            "#party",
            "#reggae",
            "#afrobeats",
            "#rnb",
            "#soca",
            "#dayparty",
            "#hiphopmusic"
        ]
    },
    {
        "title": "The Joshua Tree-U2 Tribute",
        "date_time": "Sunday, May 25 · 4 - 7pm EDT",
        "location": "McGonagle’s Pub & Restaurant 367 Neponset Avenue Boston, MA 02122 Show map",
        "about": "The Joshua Tree pride themselves with their ability to generate a unique musical experience that does not lend itself to impersonations. Without compromising artistic integrity, the band has gone to great lengths to reproduce the distinct sound of one of the world’s most popular rock bands. Playing each song with the same intensity and emotion, Joshua Tree covers all phases of U2’s music catalog.",
        "event_link": "https://www.eventbrite.com/e/the-joshua-tree-u2-tribute-tickets-1228259329719?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#concert",
            "#music",
            "#boston",
            "#irish",
            "#tribute",
            "#u2",
            "#joshua_tree"
        ]
    },
    {
        "title": "Ward Hayden & The Outliers-\"Little By Little\" Release w/Brady Dallas Jones",
        "date_time": "Friday, May 23 · 8 - 11:30pm EDT.Doors at 7pm",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "$25 adv/$32 door Doors at 7 This album has been two years in the making and was born with the idea of balancing the scale. Following one of Massachusetts most notable Country artists directing their audience NOT to listen to Bruce Springsteen....Ward Hayden & the Outliers decided the best way to offset that negativity was to do something positive and delve into Springsteen’s epic catalog. Taking that journey with all its nostalgia, appreciation, and creativity is unequivocally positive. This album plays like a thank you note to The Boss, one that will resonate with Springsteen and Outliers fans alike. This collection of songs was chosen from the soundtrack to many people's lives who grew up in the 70s, 80s, & 90s. These are the songs that played while you hung out in your friend's kitchen, watched TV in your living room, drove your car home from school, or when you partied on the weekends. These songs earned their place in our lives, they've been there for us, they've been along for the ride. Ward Hayden & the Outliers NEW album \"Little by Little\" has taken the songwriting of Bruce Springsteen, channeled it through their country music filled hearts and minds, resulting in something extraordinary and unique. It's The Boss done Outliers-style. It's the music that's been our crutch to lean on, our shoulder to cry on, and the words that we sing out with joy at the top of our lungs. It's the music that taught us to love music, the music that makes us want to keep making more music, and it's meant to be shared. May 22nd & 23rd come celebrate the album release of “Little By Little” by Ward Hayden & The Outliers. Ward Hayden & The Outliers",
        "event_link": "https://www.eventbrite.com/e/ward-hayden-the-outliers-little-by-little-release-wbrady-dallas-jones-tickets-1262983941969?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#rock",
            "#country",
            "#livemusic",
            "#americana",
            "#cambridgeevents",
            "#harvardsquare",
            "#lizardlounge",
            "#cambridgemass",
            "#wardhaydenandtheoutliers"
        ]
    },
    {
        "title": "REMA’s “HEIS World Tour” Boston  official AFTER PARTY",
        "date_time": "May 6 · 10pm - May 7 · 2am EDT.Doors at 9:30pm",
        "location": "Oliver's Nightclub @ Cask 62 Brookline Avenue Boston, MA 02215 Show map",
        "about": "REMA’s “HEIS World Tour” Boston official AFTER PARTY Get ready to party with Dj JUMBEE &  SPECIAL GUESTS at the official after party for REMA's  “HEIS World Tour” in Boston! Join us at Oliver's Nightclub @ Cask on Tue May 06 2025 at 10:00 PM for a night of music, dancing, and unforgettable memories. Don't miss out on this exclusive event where you can celebrate with REMA's greatest hits. AFTER PARTY IS ON THE SAME STREET AS THE CONCERT . JUST 2 BLOCKS UP .",
        "event_link": "https://www.eventbrite.com/e/remas-heis-world-tour-boston-official-after-party-tickets-1298724001449?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#concert",
            "#party",
            "#boston",
            "#nightlife",
            "#afrobeats",
            "#afterparty",
            "#tuesday",
            "#night",
            "#mgmgrand",
            "#heisworldtour"
        ]
    },
    {
        "title": "\"CLUB NIGHT\" W/live DJ's @ THE BACKROOM (In Donut Villa Arlington)",
        "date_time": "Friday, May 9 · 8 - 11:30pm EDT.Doors at 7pm",
        "location": "Donut Villa 319 Broadway Arlington, MA 02474 Show map",
        "about": "CLUB NIGHT W/live DJ's @ THE BACKROOM (In Donut Villa Arlington) Come join us for a night of non-stop fun at The Backroom in Donut Villa Arlington! Our live DJs will be spinning the hottest tracks to keep you dancing all night long. Get ready to groove to the beats and make unforgettable memories with friends. Don't miss out on this epic event!  LAST CALL 1130PM/LAST DANCE 11.55PM",
        "event_link": "https://www.eventbrite.com/e/club-night-wlive-djs-the-backroom-in-donut-villa-arlington-tickets-1319043146559?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Arlington, MA",
            "Arlington Parties",
            "Arlington Music Parties",
            "#djs",
            "#clubnight",
            "#arlington",
            "#backroom",
            "#donutvilla"
        ]
    },
    {
        "title": "Hanneke Cassel (and her band!)",
        "date_time": "Friday, May 9 · 7:30 - 10pm EDT",
        "location": "The First Church in Belmont Unitarian Universalist 404 Concord Avenue Belmont, MA 02478 Show map",
        "about": "ABOUT HANNEKE CASSEL Effervescent and engaging, Boston-based fiddler Hanneke Cassel’s fiddle music fuses influences from the Isle of Skye and Cape Breton with Americana grooves and musical innovations. She has performed and traveled across North America, Europe, Australia and Asia. Hanneke’s music is a blend of the contemporary and traditional, described by the Boston Globe as “exuberant and rhythmic, somehow wild and innocent, delivered with captivating melodic clarity and an irresistible playfulness.” The Hanneke Cassel Band features Jenna Moynihan on 5-string fiddle and Keith Murphy on guitar/vocals. Jenna Moynihan is regarded as one of the best in the new generation of fiddle players. Versatile and inventive, her fiddling style draws strongly from the Scottish tradition, but is in no way bound by it. An assistant professor at Berklee College of Music, Jenna performs as part of a duo with cutting edge harpist Mairi Chaimbeul and is the regular fiddler for the Seamus Egan Project. Newfoundland-born guitarist Keith Murphy is a rhythmic powerhouse on guitar and a traditional singer of rare finesse. A native of Newfoundland, he has lived in New England for many years where he has been an influential presence in the traditional music scene through his work with many respected bands, as a tune writer and as director of the Northern Roots Festival in Brattleboro, VT. He has four solo recordings of traditional songs, the most recent being Bright As Amber (2023). Together, the Hanneke Cassel Band creates a cutting-edge acoustic sound that retains the integrity and spirit of the Scottish tradition. Please note: All ticket sales are final. No refunds.",
        "event_link": "https://www.eventbrite.com/e/hanneke-cassel-and-her-band-tickets-882375026457?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Belmont, MA",
            "Belmont Performances",
            "Belmont Music Performances",
            "#concert",
            "#performance",
            "#singer",
            "#songwriter",
            "#musician"
        ]
    },
    {
        "title": "YEISON JIMENEZ",
        "date_time": "May 3 · 9pm - May 4 · 1:30am EDT.Doors at 9pm",
        "location": "Oceanside Revere 1290 North Shore Road Revere, MA 02151 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/yeison-jimenez-tickets-1325770829239?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Revere, MA",
            "Revere Performances",
            "Revere Music Performances"
        ]
    },
    {
        "title": "Leaders Among Us",
        "date_time": "Starts on Sunday, June 1 · 4pm EDT.Doors at 3:30pm",
        "location": "Strand Theatre 543 Columbia Road Boston, MA 02125 Show map",
        "about": "Any real change implies the breakup of the world as one has always known it... – James Baldwin from “Nobody Knows My Name” (1961) Be inspired as Boston Children's Chorus (BCC) proudly presents our season finale concert, Leaders Among Us . In this time of celebration and reflection, we shine a spotlight on the remarkable achievements of our alumni, singers, and community members who are making a difference in the world. From grassroots organizers to philanthropists, mentors to advocates, we invite you to journey alongside us as we honor those who embody the spirit of leadership and service and who are working to make our world a better place. Together, let us amplify the voices of those leading the way toward a brighter tomorrow, knowing that true leadership begins with radical hospitality and ends with a world transformed by love.",
        "event_link": "https://www.eventbrite.com/e/leaders-among-us-tickets-1238174656729?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#music",
            "#education",
            "#boston",
            "#youth",
            "#singing",
            "#choir",
            "#chorus",
            "#socialjustice"
        ]
    },
    {
        "title": "Brat Boston: Basement Edition  @ Capo 5/8/25",
        "date_time": "May 8 · 8pm - May 9 · 1am EDT",
        "location": "Capo Restaurant & Supper Club 443 West Broadway Boston, MA 02127 Show map",
        "about": "💘 BRAT BASEMENT 💘 The hottest tracks from Charli XCX, Sabrina Carpenter , Lady GAGA, Dua Lipa, Billie Eilish, Olivia Rodrigo, Chappell Roan, Miley Cyrus, Taylor Swift, and MORE! Black Light Dance Party - A high-energy neon-themed party, encouraging bold, glowing looks. We bring the blacklight magic, you bring the banging fit. Let’s glow, brat. FREE BRAT BOSTON Tshirts for the first 100 People Think Von Dutch, neon attitude, and your Y2K pop princess. Photo Booth in full effect. Let’s make history — brat style . 📸 PHOTO BOOTH ALERT! Strike a pose, blow a kiss, and capture your ultimate BRAT era! Boston Brat events aren’t just parties—they’re a full-on EXPERIENCE. Think neon lights, iconic fits, bangers all night — and a crowd that knows every word. This isn’t just a party, it’s a pop culture reset. 📅 Thursday, May 8 – Capo Basement ( Your fave BRAT takeover! ) 🎧 DJs Wyatt+ Dj STENNY + DJ EP3 spinning Tickets: $15 Capo Restaurant & Supper Club 443 W Broadway, Boston, MA 02127",
        "event_link": "https://www.eventbrite.com/e/brat-boston-basement-edition-capo-5825-tickets-1302036840239?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#boston",
            "#charlie",
            "#brat",
            "#bostonnightlife",
            "#blackwomen",
            "#gaga",
            "#boston_events",
            "#mileycyrus",
            "#dualipa",
            "#chappellroan"
        ]
    },
    {
        "title": "Richard, Lorenz and Emile: A Dalcroze Solfège Workshop",
        "date_time": "Sunday, April 27 · 1 - 4pm EDT",
        "location": "Longy School of Music of Bard College 27 Garden Street Cambridge, MA 02138 Show map",
        "about": "Richard, Lorenz and Emile: A Dalcroze Solfège Workshop! The pedagogical inventions of Jaques-Dalcroze meet the timeless songs of Rodgers and Hart. Join us for an afternoon of singing, movement, improvisation and creation with Michael Joviala, Diplôme Supérieur. All levels of experience in Dalcroze welcome. The event will be held both in-person (Longy School of Music) and online. --- New York City-based educator/improviser/composer Michael Joviala earned the Diplôme Supérieur from the Institut Jaques-Dalcroze in Geneva in 2020. He is the director of studies for Dalcroze teacher-training programs at the Lucy Moses School in New York, and the Colburn School in Los Angeles. He teaches Dalcroze Eurhythmics to students of all ages at the Lucy Moses School of Music, the Diller-Quaile School of Music, the Dalcroze School of Music and Movement, and in workshops worldwide.",
        "event_link": "https://www.eventbrite.com/e/richard-lorenz-and-emile-a-dalcroze-solfege-workshop-tickets-1318899737619?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Music Classes",
            "#workshop",
            "#rhythmic",
            "#michael",
            "#richard",
            "#hart",
            "#dalcroze",
            "#solfege",
            "#joviala"
        ]
    },
    {
        "title": "R&SpellingB",
        "date_time": "Sunday, April 27 · 5 - 11pm EDT",
        "location": "The MIX 555 Talbot Avenue Boston, MA 02124 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/rspellingb-tickets-1324658050889?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Music Other",
            "#boston",
            "#randb",
            "#geesmuney",
            "#spellingbee"
        ]
    },
    {
        "title": "MAELO RUIZ & SERGIO VARGAS- MAS UNO TOUR USA",
        "date_time": "May 23 · 9pm - May 24 · 1:30am EDT.Doors at 9pm",
        "location": "Oceanside Revere 1290 North Shore Road Revere, MA 02151 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/maelo-ruiz-sergio-vargas-mas-uno-tour-usa-tickets-1297591213249?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Revere, MA",
            "Revere Performances",
            "Revere Music Performances"
        ]
    },
    {
        "title": "Ward Hayden & The Outliers-\"Little By Little\" Release feat Charlie Marie",
        "date_time": "Thursday, May 22 · 8 - 11:30pm EDT.Doors at 7pm",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "$25 adv/$32 door Doors at 7 This album has been two years in the making and was born with the idea of balancing the scale. Following one of Massachusetts most notable Country artists directing their audience NOT to listen to Bruce Springsteen....Ward Hayden & the Outliers decided the best way to offset that negativity was to do something positive and delve into Springsteen’s epic catalog. Taking that journey with all its nostalgia, appreciation, and creativity is unequivocally positive. This album plays like a thank you note to The Boss, one that will resonate with Springsteen and Outliers fans alike. This collection of songs was chosen from the soundtrack to many people's lives who grew up in the 70s, 80s, & 90s. These are the songs that played while you hung out in your friend's kitchen, watched TV in your living room, drove your car home from school, or when you partied on the weekends. These songs earned their place in our lives, they've been there for us, they've been along for the ride. Ward Hayden & the Outliers NEW album \"Little by Little\" has taken the songwriting of Bruce Springsteen, channeled it through their country music filled hearts and minds, resulting in something extraordinary and unique. It's The Boss done Outliers-style. It's the music that's been our crutch to lean on, our shoulder to cry on, and the words that we sing out with joy at the top of our lungs. It's the music that taught us to love music, the music that makes us want to keep making more music, and it's meant to be shared. May 22nd & 23rd come celebrate the album release of “Little By Little” by Ward Hayden & The Outliers. Ward Hayden & The Outliers",
        "event_link": "https://www.eventbrite.com/e/ward-hayden-the-outliers-little-by-little-release-feat-charlie-marie-tickets-1262980531769?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#rock",
            "#country",
            "#livemusic",
            "#americana",
            "#cambridgeevents",
            "#harvardsquare",
            "#charliemarie",
            "#lizardlounge",
            "#cambridgemass",
            "#wardhaydenandtheoutliers"
        ]
    },
    {
        "title": "Flying Vipers (Album Release)/Double Tiger",
        "date_time": "Friday, May 2 · 9 - 11:30pm EDT.Doors at 8pm",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "Event is 21+ $20 adv/$25 Door Doors at 8 Flying Vipers emerged from a basement lair outside Boston Mass in 2015, releasing a couple cassette EPs worth of raw yet highly melodic dub ( The Green Tape and The Copper Tape ). Entirely produced on an antiquated 4-track cassette recorder and mixed live by Jay Champnay of 10 Ft. Ganja Plant, this amateur equipment is wielded by seasoned pros as their songs mutate with a keen sense of classic JA sounds and post-punk experimentation. Typically a 7-piece unit live, the core quartet of twin brothers Marc & John Beaudette on drum & bass ( Destroy Babylon , The Macrotones ), Zack Brines on keys ( Pressure Cooker , Kings of Nuthin' ), and Kellee Webb on vocals (Destroy Babylon) have 20+ years in the New England scene, sharing the stage with legendary reggae acts from around the world, including Burning Spear, Lee \"Scratch\" Perry, the Skatalites, and Hollie Cook, among many others. This November, the Vipers will be celebrating the release of their new 7\" single, \"Show Me\", their debut for Easy Star Records. https://flyingvipers.com/",
        "event_link": "https://www.eventbrite.com/e/flying-vipers-album-releasedouble-tiger-tickets-1255865410249?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#reggae",
            "#livemusic",
            "#worldmusic",
            "#livemusicvenue",
            "#cambridge_events",
            "#lizardlounge",
            "#dubreggae",
            "#cambridgemass",
            "#doubletiger",
            "#flying_vipers"
        ]
    },
    {
        "title": "BOLLYWOOD SPEAKEASY PARTY at HAVA NIGHT CLUB with DJ RAKESH",
        "date_time": "April 26 · 10pm - April 27 · 2am EDT",
        "location": "Hava Nightclub 246 Tremont Street Boston, MA 02116 Show map",
        "about": "APRIL 26th SATURDAY SPEAKEASY PARTY with BOSTON OG DJ RAKESH BOLLYWOOD SATURDAYS – EVERY SATURDAY AT HAVA NIGHTCLUB , BOSTON! NON-STOP MUSIC, HIGH ENERGY, AND UNFORGETTABLE VIBES! Music : DK RAKESH Date: SATURDAY , April 26th , 2025 Venue: HAVA NIGHT CLUB 246 Tremont st, Boston, MA VIP TABLES - RAKESH :480-371-7787 Doors Open 10:00pm Strictly A 21+ Event ONLY IMPORTANT NOTES - PLEASE READ * Be There Early To Avoid Long Lines * All Tickets are Final an NO REFUNDS whatsoever * CLUB has the right to refuse if capacity is reached. So COME EARLY ! VALID FORM OF ID : State issued ID / Driver License or Passport. NO other forms of identification will be accepted! Photocopies or pictures of your IDs on your phone will NOT be accepted. Space is limited, FIRST COME FIRST SERVE. (NO REFUNDS) so buy your tickets soon NOTE: This is a public event which will be recorded. You may appear in pictures/video recordings. We have full rights to use this media anywhere without seeking your prior or post permissions.",
        "event_link": "https://www.eventbrite.com/e/bollywood-speakeasy-party-at-hava-night-club-with-dj-rakesh-tickets-1332632673199?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#party",
            "#bollywood",
            "#speakeasy",
            "#dj_rakesh",
            "#hava_night_club"
        ]
    },
    {
        "title": "Nathan Amaral, violin and Alice Chenyang Xu, piano",
        "date_time": "Sunday, April 27 · 4 - 6pm EDT",
        "location": "Peabody Hall, All Saints Church 209 Ashmont Street Dorchester, MA 02124 Show map",
        "about": "Program Mozart, Sonata for violin & piano No. 26 in B flat major Clara Schumann, Three romances for violin and piano Ernest Chausson, Poème, Op. 2 César Franck, Sonata for violin and piano in A Major Heitor Villa-Lobos, Bachianas Brasileiras nº5 First prize winner of the 27th Sphinx Competition, the Brazilian violinist Nathan Amaral has earned a reputation in South America, USA and Europe for being a \"versatile, charismatic violinist with a natural musical understanding\" (Liza Ferschtman). Having performed as a soloist and chamber musician at venues such as the Wigmore Hall, KKL at Lucerne Festival, Mozarteum Großer Saal and Berliner Philharmonie, Nathan has been awarded 1st and special prizes in numerous national and international competitions, and in May of 2024, he performed with the Boston Symphony Orchestra. Hailed by The Boston Musical Intelligencer as “incisive and with innate musicality,” pianist Alice Chenyang Xu brings a thoughtful and evocative approach to her performances. She has captivated audiences as a soloist and chamber musician with appearances across the United States, Canada, Italy, Germany, and China, spanning solo recitals, concerto performances, and chamber music engagements. Highlights include Lincoln Center, Chicago Symphony Hall, Chicago Cultural Center, Chicago Auditorium Theatre, Corbett Auditorium in Cincinnati, Boston Symphony Hall, Jordan Hall in Boston, Leipzig Hochschule Musik Hall, and Chiesa dell'Addolorata in Piedmont, among others, showcasing her versatility and dynamic musicianship across diverse settings.",
        "event_link": "https://www.eventbrite.com/e/nathan-amaral-violin-and-alice-chenyang-xu-piano-tickets-940513670707?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#food",
            "#music",
            "#entertainment",
            "#community",
            "#celebration"
        ]
    },
    {
        "title": "The Reckoning Crew",
        "date_time": "Starts on Thursday, May 8 · 8pm EDT.Doors at 7pm",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "MUST BE 21+ $15/$20 Doors 7pm",
        "event_link": "https://www.eventbrite.com/e/the-reckoning-crew-tickets-1264436476539?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#event",
            "#acoustic",
            "#livemusic",
            "#livemusicvenue",
            "#cambridgeevents",
            "#gratefuldeadtribute",
            "#harvardsquare",
            "#lizardlounge",
            "#cambridgemass",
            "#reckoningcrew"
        ]
    },
    {
        "title": "E-Los - \"Casanova\" Tour",
        "date_time": "Friday, June 27 · 8 - 11pm EDT",
        "location": "Sonia Live Music Venue 10 Brookline Street Cambridge, MA 02139 Show map",
        "about": "E-Los - \"Casanova\" Tour Welcome to E-Los' electrifying \"Casanova\" Tour! Get ready to groove to his latest hits in person at Sonia Live Music Venue. This is your chance to experience E-Los's energetic performance up close and personal. Don't miss out on a night filled with great music and unforgettable memories. Grab your friends and come join the party!",
        "event_link": "https://www.eventbrite.com/e/e-los-casanova-tour-tickets-1274801478539?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#music",
            "#tour",
            "#event",
            "#casanova",
            "#elos"
        ]
    },
    {
        "title": "Elevation Boston 2025",
        "date_time": "N/A",
        "location": "TBD Boston Boston, MA 02124 Show map",
        "about": "The Elevation Conference in its 9th year is the longest running conference in New England bringing together young artists, music entrepreneurs, faith leaders, and community members for a transformative experience. The conference features: - Live Worship - The Plug Live Music Feedback Contest : Best song wins a career changing prize package - Panels : Dating and Marriage, Branding, Theological Differences - Workshops : Dance, Videography/Photography, Merch - A brunch for local pastors and youth leaders - The best Christian Hip Hop concert in New England every year. Schedule Friday, May 30th, 12:00pm Opening Session The Plug Live Music Feedback Contest Contestants will play one song live for our panel of judges including Dria head A&R at Capitol CMG. The best song will win a prize package including radio airplay, distribution services, financial consultations and more. Elevation Night of Worship VIP After Party (18+) Saturday, May 31st, 12:00pm General Session #1 The Issues That Divide Churches feat Ruslan General Session #2 Marriage and Dating feat The Fryes Genereal Session #3 Christians and Counseling Pastor Kadeem BreakOut Sessions - Hip Hop Dance Class, Videography and Photography, Merch 101 Finale Concert (18+) feat WhatupRG, Jon Keith, 1Kphew, Prodigal Joe and More",
        "event_link": "https://www.eventbrite.com/e/elevation-boston-2025-tickets-1060199919499",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Music Conferences"
        ]
    },
    {
        "title": "DI PAULLO & PAULINO",
        "date_time": "April 27 · 9pm - April 28 · 1:30am EDT.Doors at 9pm",
        "location": "Oceanside Revere 1290 North Shore Road Revere, MA 02151 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/di-paullo-paulino-tickets-1272959418889",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Revere, MA",
            "Revere Performances",
            "Revere Music Performances"
        ]
    },
    {
        "title": "SOCA DE MAYO",
        "date_time": "Sunday, May 4 · 5 - 10pm EDT",
        "location": "Savvor Restaurant and Lounge 180 Lincoln Street Boston, MA 02111 Show map",
        "about": "Welcome to SOCA DE MAYO PT.II ! Get ready to celebrate the vibrant culture and music of the Caribbean at Savvor Restaurant and Lounge. Join us on Sunday, May 4th, 2025 at 5:00 PM for a evening filled with lively soca beats, delicious food, and refreshing drinks. Let loose and dance the night away with friends and family in a festive atmosphere. Don't miss out on this exciting event that promises to be a memorable experience. See you there!",
        "event_link": "https://www.eventbrite.com/e/soca-de-mayo-tickets-1310515460019",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#dance",
            "#drinks",
            "#music",
            "#party",
            "#reggae",
            "#afrobeats",
            "#rnb",
            "#soca",
            "#dayparty",
            "#hiphopmusic"
        ]
    },
    {
        "title": "The Joshua Tree-U2 Tribute",
        "date_time": "Sunday, May 25 · 4 - 7pm EDT",
        "location": "McGonagle’s Pub & Restaurant 367 Neponset Avenue Boston, MA 02122 Show map",
        "about": "The Joshua Tree pride themselves with their ability to generate a unique musical experience that does not lend itself to impersonations. Without compromising artistic integrity, the band has gone to great lengths to reproduce the distinct sound of one of the world’s most popular rock bands. Playing each song with the same intensity and emotion, Joshua Tree covers all phases of U2’s music catalog.",
        "event_link": "https://www.eventbrite.com/e/the-joshua-tree-u2-tribute-tickets-1228259329719",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#concert",
            "#music",
            "#boston",
            "#irish",
            "#tribute",
            "#u2",
            "#joshua_tree"
        ]
    },
    {
        "title": "BOLLYWOOD SPEAKEASY PARTY at HAVA NIGHT CLUB with DJ RAKESH",
        "date_time": "April 26 · 10pm - April 27 · 2am EDT",
        "location": "Hava Nightclub 246 Tremont Street Boston, MA 02116 Show map",
        "about": "APRIL 26th SATURDAY SPEAKEASY PARTY with BOSTON OG DJ RAKESH BOLLYWOOD SATURDAYS – EVERY SATURDAY AT HAVA NIGHTCLUB , BOSTON! NON-STOP MUSIC, HIGH ENERGY, AND UNFORGETTABLE VIBES! Music : DK RAKESH Date: SATURDAY , April 26th , 2025 Venue: HAVA NIGHT CLUB 246 Tremont st, Boston, MA VIP TABLES - RAKESH :480-371-7787 Doors Open 10:00pm Strictly A 21+ Event ONLY IMPORTANT NOTES - PLEASE READ * Be There Early To Avoid Long Lines * All Tickets are Final an NO REFUNDS whatsoever * CLUB has the right to refuse if capacity is reached. So COME EARLY ! VALID FORM OF ID : State issued ID / Driver License or Passport. NO other forms of identification will be accepted! Photocopies or pictures of your IDs on your phone will NOT be accepted. Space is limited, FIRST COME FIRST SERVE. (NO REFUNDS) so buy your tickets soon NOTE: This is a public event which will be recorded. You may appear in pictures/video recordings. We have full rights to use this media anywhere without seeking your prior or post permissions.",
        "event_link": "https://www.eventbrite.com/e/bollywood-speakeasy-party-at-hava-night-club-with-dj-rakesh-tickets-1332632673199",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#party",
            "#bollywood",
            "#speakeasy",
            "#dj_rakesh",
            "#hava_night_club"
        ]
    },
    {
        "title": "Richard, Lorenz and Emile: A Dalcroze Solfège Workshop",
        "date_time": "Sunday, April 27 · 1 - 4pm EDT",
        "location": "Longy School of Music of Bard College 27 Garden Street Cambridge, MA 02138 Show map",
        "about": "Richard, Lorenz and Emile: A Dalcroze Solfège Workshop! The pedagogical inventions of Jaques-Dalcroze meet the timeless songs of Rodgers and Hart. Join us for an afternoon of singing, movement, improvisation and creation with Michael Joviala, Diplôme Supérieur. All levels of experience in Dalcroze welcome. The event will be held both in-person (Longy School of Music) and online. --- New York City-based educator/improviser/composer Michael Joviala earned the Diplôme Supérieur from the Institut Jaques-Dalcroze in Geneva in 2020. He is the director of studies for Dalcroze teacher-training programs at the Lucy Moses School in New York, and the Colburn School in Los Angeles. He teaches Dalcroze Eurhythmics to students of all ages at the Lucy Moses School of Music, the Diller-Quaile School of Music, the Dalcroze School of Music and Movement, and in workshops worldwide.",
        "event_link": "https://www.eventbrite.com/e/richard-lorenz-and-emile-a-dalcroze-solfege-workshop-tickets-1318899737619",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Music Classes",
            "#workshop",
            "#rhythmic",
            "#michael",
            "#richard",
            "#hart",
            "#dalcroze",
            "#solfege",
            "#joviala"
        ]
    },
    {
        "title": "Nathan Amaral, violin and Alice Chenyang Xu, piano",
        "date_time": "Sunday, April 27 · 4 - 6pm EDT",
        "location": "Peabody Hall, All Saints Church 209 Ashmont Street Dorchester, MA 02124 Show map",
        "about": "Program Mozart, Sonata for violin & piano No. 26 in B flat major Clara Schumann, Three romances for violin and piano Ernest Chausson, Poème, Op. 2 César Franck, Sonata for violin and piano in A Major Heitor Villa-Lobos, Bachianas Brasileiras nº5 First prize winner of the 27th Sphinx Competition, the Brazilian violinist Nathan Amaral has earned a reputation in South America, USA and Europe for being a \"versatile, charismatic violinist with a natural musical understanding\" (Liza Ferschtman). Having performed as a soloist and chamber musician at venues such as the Wigmore Hall, KKL at Lucerne Festival, Mozarteum Großer Saal and Berliner Philharmonie, Nathan has been awarded 1st and special prizes in numerous national and international competitions, and in May of 2024, he performed with the Boston Symphony Orchestra. Hailed by The Boston Musical Intelligencer as “incisive and with innate musicality,” pianist Alice Chenyang Xu brings a thoughtful and evocative approach to her performances. She has captivated audiences as a soloist and chamber musician with appearances across the United States, Canada, Italy, Germany, and China, spanning solo recitals, concerto performances, and chamber music engagements. Highlights include Lincoln Center, Chicago Symphony Hall, Chicago Cultural Center, Chicago Auditorium Theatre, Corbett Auditorium in Cincinnati, Boston Symphony Hall, Jordan Hall in Boston, Leipzig Hochschule Musik Hall, and Chiesa dell'Addolorata in Piedmont, among others, showcasing her versatility and dynamic musicianship across diverse settings.",
        "event_link": "https://www.eventbrite.com/e/nathan-amaral-violin-and-alice-chenyang-xu-piano-tickets-940513670707",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#food",
            "#music",
            "#entertainment",
            "#community",
            "#celebration"
        ]
    },
    {
        "title": "R&SpellingB",
        "date_time": "Sunday, April 27 · 5 - 11pm EDT",
        "location": "The MIX 555 Talbot Avenue Boston, MA 02124 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/rspellingb-tickets-1324658050889",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Other",
            "Boston Music Other",
            "#boston",
            "#randb",
            "#geesmuney",
            "#spellingbee"
        ]
    },
    {
        "title": "Ali McGuirk",
        "date_time": "Friday, June 6 · 8 - 11:30pm EDT.Doors at 3pm",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "$20 adv/$25 door Blending classic soul power with a folk songwriter lyricism, New England’s Ali McGuirk has the rare ability to silence a room with just a few words of a song. With a voice that is raw and sultry and a style rooted in improvisation, her sets are a hypnotic and intimate journey. On her Signature Sounds Recordings debut ’Til It’s Gone , McGuirk delivers a sublime set of songs that pairs her trademark soul sound with rootsy turns and raw rock ‘n’ roll detours. The album landed on the Boston Globe’s Top 50 Albums list for 2022. Consequence of Sound raved, “‘All Back’ feels like it could exist somewhere outside of space and time– it could be on a record in the background of a party in a 1970s bungalow, or it could be on your Discover Weekly playlist on Spotify. Either way, it’s a great listen.” McGuirk co-produced ‘Til It’s Gone with Jonah Tolchin (a star singer-songwriter in his own right) and a set of session legends: Little Feat guitarist/mandolinist Fred Tackett, organist Larry Goldings (James Taylor, Norah Jones), singer Valerie Pinkston (Ray Charles, Luther Vandross), percussionist Lenny Castro (Stevie Nicks, Stevie Wonder). They provided the astounding chops, but the true magic of the album comes from McGuirk’s singular voice as both singer and songwriter. The nine tracks run from intimate introspection to wider meditations on oppression and justice, from tough r&b and tender soul to big rock guitar and twangy folk. And McGuirk's voice – bold, buttery, spellbinding – carries each song to the next til they’re gone. Ali McGuirk",
        "event_link": "https://www.eventbrite.com/e/ali-mcguirk-tickets-1302996881749?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#music",
            "#soul",
            "#livemusic",
            "#singersongwriter",
            "#cambridgeevents",
            "#harvardsquare",
            "#lizardlounge",
            "#alimcguirk",
            "#cambridgemass"
        ]
    },
    {
        "title": "SAK PA SOCA \"THE GOUYARD BEND OVER\"",
        "date_time": "May 2 · 10pm - May 3 · 2am EDT",
        "location": "Montserrat Aspirers Inc 358 Washington Street Boston, MA 02124 Show map",
        "about": "Supah Koncepts Presents: Sak Pa Soca “The Gouyad Bend over” 📍Monsterratt Aspirers 358 Washington St, Boston, MA 02124 🗓️ May 2nd, 2025 ⏰ 10p- 2am SOCA, KOMPA and Zouk all night Get ready to dance the night away at the most exciting fusion event of the year! Whether you’re a Soca lover, Kompa enthusiast, or just looking for an unforgettable night of rhythm and celebration, this party is where you need to be! Don’t miss out on this epic night of Soca and Kompa—it’s going to be a party like no other! 🎟️ Advanced Tickets 🎫 SakPaSoca25.eventbrite.com #supahkoncepts #sakpasoca #Share",
        "event_link": "https://www.eventbrite.com/e/sak-pa-soca-the-gouyard-bend-over-tickets-1319484968059?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#dance_party",
            "#caribbean_vibes",
            "#event_name",
            "#sak_pa_soca",
            "#the_gouyard_bend_over"
        ]
    },
    {
        "title": "Rev'd Spin Session w/ FREE Mother Juice & Culture Pop!",
        "date_time": "Saturday, May 3 · 12:15 - 2pm EDT.Doors at 12:15pm",
        "location": "Rev'd Indoor Cycling | Copley 100 Huntington Avenue #D024F Boston, MA 02116 Show map",
        "about": "Join B-Side and Rev'd for an awesome Saturday afternoon! Train in a 45-minute indoor cycling session at the Rev'd Copley studio, followed by refreshments from Culture Pop and Mother Juice and a chance to get to know other B-Siders IRL. Become a B-Side member for $10 off your entry and a B-Side sweat towel to take home!",
        "event_link": "https://www.eventbrite.com/e/revd-spin-session-w-free-mother-juice-culture-pop-tickets-1307103294139?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#fitness",
            "#community",
            "#meetup",
            "#collaboration",
            "#workout",
            "#cycling",
            "#fitnessevent",
            "#indoorcycling",
            "#bostonfitness",
            "#special_event"
        ]
    },
    {
        "title": "[БОСТОН] СУПЕРДИСКОТЕКА 90х и 2000х [LOVE IS...]",
        "date_time": "Starts on Saturday, May 3 · 8pm EDT",
        "location": "Sonia Live Music Venue 10 Brookline Street Cambridge, MA 02139 Show map",
        "about": "БОСТОН, 3 МАЯ 2025 ГОДА (СУББОТА) 💖 Любовь — это... танцы, музыка и незабываемые эмоции! 💖 Специальная программа для тех, кто любит радость, драйв и яркие впечатления! СУПЕРДИСКОТЕКА 90х и 2000х СЕРГЕЯ ШАХОВА — это: - неповторимая атмосфера , где музыка объединяет всех - взрывной танцпол , где можно танцевать под любимые треки - видеоряд с караоке-текстами , чтобы все могли не только слушать и танцевать, но и петь вместе с нами! ✨ Каждое мероприятие уникально! 🎶 В программе: 30 новых песен — свежий набор хитов из 90х и 2000х 10-15 самых любимых хитов — ваши неизменные фавориты.Вы всегда услышите что-то новое, одновременно наслаждаясь лучшими треками прошлых лет! 💌 Приглашайте друзей и наслаждайтесь этой уникальной атмосферой! ⏰ Doors open: 8:00 PM 🔞 Age Restriction: 18+ 📍 Где: Sonia Live Music Venue (10 Brookline Street, Cambridge, MA 02139) 💃🕺 Не пропустите вечер, полный драйва, танцев и любимой музыки. Приглашайте друзей, чтобы насладиться этим уникальным событием вместе! 💘 Празднуйте любовь к жизни и музыке вместе с нами! 🎟️ БИЛЕТЫ ТУТ: https://www.sergeyshakhov.com/ticketsnew May 03, 2025 — We are waiting for YOU! << Ф ОТО С ДИСКОТЕКИ 90х В НЬЮ-ЙОРКЕ - 1 >> << Ф ОТО С ДИСКОТЕКИ 90х В ЧИКАГО - 1 >> << Ф ОТО С ДИСКОТЕКИ 90х В СИЭТЛЕ - 1 >>",
        "event_link": "https://www.eventbrite.com/e/90-2000-love-is-tickets-914059224747?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#seattle",
            "#liveconcert",
            "#shakhov",
            "#seattle_event",
            "#discoteka90",
            "#shakhovband",
            "#sergeyshakhov"
        ]
    },
    {
        "title": "Interactive Chamber Music Masterclass & Concert with Analog by Choice",
        "date_time": "Sunday, May 4 · 5 - 7pm EDT",
        "location": "63 Trapelo Rd 63 Trapelo Road Belmont, MA 02478 Show map",
        "about": "Join us for a unique and engaging evening of chamber music at Attacca School of Music on Sunday, May 4th, from 5:00-7:00 PM featuring the talented musicians of Analog by Choice . This special event is designed for music lovers of all ages, offering a hands-on experience in both performance and storytelling. From 5:00-6:00 PM , enjoy an interactive masterclass with the student chamber groups of Attacca School of Music. Watch as students collaborate with Analog by Choice in real-time, gaining valuable insight into the artistry of ensemble playing and the nuances of chamber music. From 6:00-7:00 PM , be part of a dynamic and imaginative interactive concert where the quartet will present a unique program inspired by the structure of a novel. In this \"build your own quartet\" experience, the quartet will weave together \"chapters\" from different pieces to create a new musical narrative. As each movement unfolds, there will be moments of audience interaction, encouraging young listeners to share their interpretations of the evolving story. Date : Sunday, May 4th Time : 5:00 PM – 7:00 PM Location : Attacca School of Music 63 Trapelo Rd Belmont MA 02478 Attendance free for Attacca families/students with suggested donation of $15 per family to the performers Attendance $15 for anyone outside of Attacca About Analog by Choice : https://www.analogbychoice.com/ Analog By Choice is a Boston-based collective of classical musicians dedicated to producing high quality performances featuring historically underrepresented composers alongside their better-known contemporaries. By programming each concert around a single letter of the alphabet, we are able to expand our own repertoire while providing our audiences with a fun and engaging entry point to both new and familiar music.",
        "event_link": "https://www.eventbrite.com/e/interactive-chamber-music-masterclass-concert-with-analog-by-choice-tickets-1312109357409?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Belmont, MA",
            "Belmont Performances",
            "Belmont Music Performances",
            "#concert",
            "#interactive",
            "#massachusetts",
            "#masterclass",
            "#belmont",
            "#classicalmusic",
            "#chamber_music",
            "#analog_by_choice"
        ]
    },
    {
        "title": "TONO ROSARIO",
        "date_time": "May 17 · 9pm - May 18 · 1:30am EDT.Doors at 9pm",
        "location": "Oceanside Revere 1290 North Shore Road Revere, MA 02151 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/tono-rosario-tickets-1295982682089?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Revere, MA",
            "Revere Performances",
            "Revere Music Performances"
        ]
    },
    {
        "title": "May Intro to Mixing Workshops: 3 Tuesday Nights @ The Record Co.",
        "date_time": "Tuesday, May 13 · 7:30 - 9:30pm EDT",
        "location": "The Record Co. 960 Massachusetts Avenue Boston, MA 02118 Show map",
        "about": "Boston Audio School presents: 3-Week Intro to Mixing Workshops in May @ The Record Co. Tuesday nights 7:30 - 9:30 pm Join us at The Record Co. this May for an exciting opportunity to dive into the world of audio! Our 3-week workshop series running on 5 /13, 5/20, & 5/27 is designed for beginners who want to learn the basics of mixing. Over the course of three sessions you will: 1) Complete the mandatory engineering orientation certification course required to record in the studios at TRC 2) Obtain a wealth of knowledge about microphones and digital mixing 3 ) Learn to mix and master any genre of music 4 ) Network with other engineers and musicians Entry: Suggested amount $175 Hosted by Dan Moffat. Dan is a Boston-based music, podcast, audiobook, and commercial production and post-production audio engineer. Learn more at www.moffatsound.com Whether you're a musician, producer, or just curious about the process, this hands-on experience will give you the skills you need to start creating. From setting up Pro Tools sessions to editing and mixing tracks, our expert instructors will guide you every step of the way. Don't miss out on this chance to unleash your creativity and learn in a supportive, collaborative environment. www.bostonaudioschool.com",
        "event_link": "https://www.eventbrite.com/e/may-intro-to-mixing-workshops-3-tuesday-nights-the-record-co-tickets-1318253966099?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Music Classes",
            "#workshops",
            "#recording",
            "#dorchester",
            "#roxbury",
            "#mixing",
            "#may",
            "#recordco"
        ]
    },
    {
        "title": "Twenty-Øne Pilots Ensemble w/ Aleksandra Picariello +  Uninformed Decisions",
        "date_time": "Saturday, May 3 · 4 - 7pm EDT.Doors at 4pm",
        "location": "The Jungle 6 Sanborn Court Somerville, MA 02143 Show map",
        "about": "More tickets will be released for sale at the door. Doors at 3:30pm Music at 4:00pm Bar & Kitchen 21+ $10 tickets Uninformed Decisions https://www.instagram.com/uninformeddecisions/ Aleksandra Picariello https://www.instagram.com/aleksandra_picariello https://apicariello.com/home The Twenty-Øne Pilots Ensemble (Twenty One Pilots Cover Band) https://www.instagram.com/thetopensemble/",
        "event_link": "https://www.eventbrite.com/e/twenty-ne-pilots-ensemble-w-aleksandra-picariello-uninformed-decisions-tickets-1319579119669?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Performances",
            "Somerville Music Performances"
        ]
    },
    {
        "title": "The 90’s R&B Throwback SOUL Party",
        "date_time": "May 24 · 9pm - May 25 · 1am EDT",
        "location": "55 Bishop Allen Dr 55 Bishop Allen Drive Cambridge, MA 02139 Show map",
        "about": "Welcome to The 90’s R&B Throwback SOUL Party ! Get ready to groove to all your favorite hits from the 90s at this throwback event. Join us on Sat May 24 2025, at 9:00 PM to 1:00 AM at the Elks Lodge – 55 Bishop Allen Drive, Cambridge, MA as 🎶 Bright Lights Entertainment Presents; 🎧 Music By: DJ Lady Ly Spinning the best of: ✨ R&B | Hip Hop | Reggae | Afro Beats | New Jack Swing | Throwback Mashups 🎟️ TICKETS: $10 – Online by April 14 $15 – Online after April 14 $20 – At the Door ✨ VIP Reserved Seating Available Online! 💃🏾 Come dressed fly 🕺🏽 Bring your crew 🎉 Dance the night away like it’s 1999!",
        "event_link": "https://www.eventbrite.com/e/the-90s-rb-throwback-soul-party-tickets-1319495098359?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Music Parties",
            "#music",
            "#throwback",
            "#nostalgia",
            "#90s_rnb",
            "#soul_party"
        ]
    },
    {
        "title": "“DREAMS” DI ALL WHITE FANTASY",
        "date_time": "May 31 · 10pm - June 1 · 2am EDT",
        "location": "Sorrel and Lime 986 Blue Hill Avenue Boston, MA 02124 Show map",
        "about": "DREAMS DI ALL White FANTASY Get ready for an unforgettable night of vibes, energy, and pure Caribbean flavor! On Saturday, May 31st, we’re bringing you the hottest all-white party in Boston at Sorrle and Lime. We’re turning up the heat with the best in dancehall, soca, R&B, reggae, hip-hop, and Afrobeats—a non-stop mix to keep you moving all night long. Expect high-energy performances, top DJs, and an electrifying crowd. Dress Code: All White – Come Drippin’ in Style! Location: Sorrle and Lime, Boston Time: 10pm – we party ‘til the 2AM! Secure your spot early—this one is gonna be legendary! Tag your crew, grab your tickets, and let’s make memories on the dance floor! #BostonNightlife #AllWhiteParty #CaribbeanVibes #DancehallSocaReggae",
        "event_link": "https://www.eventbrite.com/e/dreams-di-all-white-fantasy-tickets-1287371104629?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#boston",
            "#event",
            "#soca",
            "#dancehall",
            "#fantasy",
            "#dreams",
            "#bostonnightlife",
            "#all_white",
            "#carnival2025"
        ]
    },
    {
        "title": "Onset Music Band Showcase",
        "date_time": "Monday, May 19 · 6:30 - 9pm EDT",
        "location": "MIXX 360 Nightlife 665 Broadway Malden, MA 02148 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/onset-music-band-showcase-tickets-1310593894619?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Malden, MA",
            "Malden Performances",
            "Malden Music Performances",
            "#live_music",
            "#music_event",
            "#local_bands",
            "#talent_showcase",
            "#onset_music_band_showcase"
        ]
    },
    {
        "title": "Robbie Pate Quartet at The Mad Monkfish!",
        "date_time": "Wednesday, April 30 · 7 - 8:30pm EDT",
        "location": "The Mad Monkfish 524 Massachusetts Avenue Cambridge, MA 02139 Show map",
        "about": "Robbie Pate Quartet Personnel: Robbie Pate, voice Jiri Nedoma, Piano Mike Gary, Bass Ryan Sands, Drums Robbie’s band presents a night of original music and jazz arrangements featured on his upcoming album later this year! An electrifying singer with the voice and taste to match! NOTE: Immerse yourself in the cozy atmosphere of the Jazz Baroness Room at The Mad Monkfish, where you can sip your favorite drink, savor sushi or Thai cuisine, and enjoy the mesmerizing sounds of a remarkable jazz ensemble. Whether you're a seasoned jazz aficionado or simply seeking a delightful night out, this event promises to be a treat for your senses. To keep this vibrant jazz scene alive, we kindly ask for a minimum spend of $25 per person, as most of the ticket proceeds go directly to the musicians . Our full bar and food menus are available to complement the musical experience, so indulge in our renowned cuisine while supporting live jazz at The Mad Monkfish. Together, we can keep the music playing! BIO: Robbie Pate is a vocalist and pianist based out of NYC. Born and raised in Baltimore, Robbie found his love for music at an early age, singing with the choir at church. Robbie then went on to study voice at the Baltimore School for the Arts, and continued his music studies in Boston at Berklee College of Music and New England Conservatory. Robbie has performed with the Zac Brown Band at Fenway Park and has been a featured artist at the Boston Jazz Fest, Newton Jazz Festival and Jazz on the Charles. Most notably, Robbie has toured internationally with the Alexey Podymkin Quartet in 2018 in Russia, and in Japan with the Yuki Futami Trio in 2022 and 2023. Robbie's love for different styles of music has resulted in collaborating with several artists and bands from hip hop to r&b, jazz, and acapella, and he has been featured on albums with the Matt Savage Groove Experiment, Green Line X-Tension, Alexandra James and most recently with the Yuki Futami Trio. Robbie is currently an ensemble professor at Berklee College of Music.",
        "event_link": "https://www.eventbrite.com/e/robbie-pate-quartet-at-the-mad-monkfish-tickets-1288711142719?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#event",
            "#jazz",
            "#live_music",
            "#mad_monkfish",
            "#robbie_pate_quartet"
        ]
    },
    {
        "title": "Be The Change : Maura Mendoza, CD Release Party !",
        "date_time": "Saturday, May 17 · 11am - 1pm EDT.Doors at 10:50am",
        "location": "The Foundry 101 Rogers Street Cambridge, MA 02142 Show map",
        "about": "Join us as we celebrate the musical journey of Maura Mendoza, a talented artist whose heartfelt songs and unique sound embody El Salvador's rich cultural heritage. This special event marks the release of her new album, which showcases her passion for storytelling and vibrant musical style. We invite you to be part of this unforgettable evening, featuring a live performance by Maura Mendoza and a chance to experience her music in an intimate setting. This is a fantastic opportunity to connect with the Latin American music community and support an inspiring artist.",
        "event_link": "https://www.eventbrite.com/e/be-the-change-maura-mendoza-cd-release-party-tickets-1315898581079?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Parties",
            "Cambridge Music Parties",
            "#celebration",
            "#event",
            "#be_the_change",
            "#cd_release_party",
            "#maura_mendoza"
        ]
    },
    {
        "title": "Cambridge Symphony Orchestra Presents: Revelry",
        "date_time": "Saturday, June 14 · 7 - 9pm EDT.Doors at 6pm",
        "location": "Kresge Auditorium 48 Massachusetts Avenue #w16 Cambridge, MA 02139 Show map",
        "about": "Revelry Saturday, June 14, 2025 7:00 PM 9:00 PM Google Calendar ICS Kresge Auditorium 48 Massachusetts Avenue Cambridge, MA, 02139 (map) Igor Stravinsky Rite of Spring Stravinsky's iconic ballet, The Rite of Spring , returns this spring as the CSO teams up for our 5th production with master choreographer Gianni Gino DiMarco , and the dancers of City Ballet of Boston , Tony Williams , Artistic Director, to stage one of the great ballets of the twentieth century. Full event listing on the CSO website .",
        "event_link": "https://www.eventbrite.com/e/cambridge-symphony-orchestra-presents-revelry-tickets-1012568398337?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances"
        ]
    },
    {
        "title": "BOSTON'S GROWN & SEXY",
        "date_time": "Saturday, May 17 · 9 - 11:30pm EDT",
        "location": "Slades Bar & Grill 958 Tremont Street Boston, MA 02120 Show map",
        "about": "Night out with an adult crowd.  Featuring the Boston's Premier; DJ Chubby Chub.  Enjoy Old School, R&B and fine music!",
        "event_link": "https://www.eventbrite.com/e/bostons-grown-sexy-tickets-1325627129429?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#party",
            "#boston",
            "#event",
            "#nightlife",
            "#grown_sexy"
        ]
    },
    {
        "title": "MIGUEL MATEOS",
        "date_time": "May 24 · 9pm - May 25 · 1:30am EDT.Doors at 9pm",
        "location": "Oceanside Revere 1290 North Shore Road Revere, MA 02151 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/miguel-mateos-tickets-1294598120829?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Revere, MA",
            "Revere Performances",
            "Revere Music Performances"
        ]
    },
    {
        "title": "Glissando Season Finale—Masques et Bergamasques",
        "date_time": "Friday, May 30 · 7:30 - 9:30pm EDT.Doors at 7pm",
        "location": "First Church in Boston 66 Marlborough Street Boston, MA 02116 Show map",
        "about": "Glissando Season Finale—Masques et Bergamasques Program Debussy: Suite bergamasque Debussy: Images (First Series) Debussy: Masques; D'un cahier d'esquisses; L'isle joyeuse Schumann: Carnaval, Op. 9 Sergey Schepkin, piano",
        "event_link": "https://www.eventbrite.com/e/glissando-season-finalemasques-et-bergamasques-tickets-1003895397157?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#piano_recital",
            "#schepkin",
            "#glissando",
            "#schumann_symphonic_etudes",
            "#debussy_etudes",
            "#schepkin_piano_recital",
            "#piano_recital_debussy",
            "#piano_recital_schumann",
            "#glissando_piano"
        ]
    },
    {
        "title": "Uplift: Choral Administrative Conference",
        "date_time": "Saturday, June 14 · 10am - 3:30pm EDT.Doors at 9:30am",
        "location": "Brimmer and May 69 Middlesex Road Newton, MA 02467 Show map",
        "about": "Registration for GBCC’s annual conference is now open! This year we will offer a full day of sessions on administrative topics to help you plan for the season ahead, including marketing, fundraising, and board development / community building. Admission fees: Member Choruses: $40 for first registrant; $30 for each additional registrant. Non-members: $50 for first registrant; $40 for each additional registrant. Our venue, Brimmer and May School in Chestnut, offers free parking. The venue is also public transit accessible (MBTA Green “D” line - Chestnut Hill). Lunch is included in the price of admission.",
        "event_link": "https://www.eventbrite.com/e/uplift-choral-administrative-conference-tickets-1312998918109?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Newton, MA",
            "Newton Conferences",
            "Newton Music Conferences",
            "#event",
            "#conference",
            "#choral",
            "#uplift",
            "#administrative"
        ]
    },
    {
        "title": "Brian Dunne/Ken Yates",
        "date_time": "Thursday, June 5 · 8 - 11pm EDT.Doors at 7pm",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "$20/$25 GA Reserved Tables $50 Doors 7 Known for his laugh-to-keep-from-crying, darkly humorous lyrics, Brian Dunne has toured the world over, releasing records at a furious clip. His most recent solo album “Loser On The Ropes” saw Dunne is bending the sounds of American rock into masterfully composed, existentially poignant, wildly catchy renderings of being alive. He made his network TV debut on CBS Saturday Morning and Rolling Stone called the LP “one of the sleeper albums of the year.” He is currently touring the deluxe edition of the record, and he is also a full time member of folk-rock supergroup, Fantastic Cat and his new LP is due out in September 2025. Ken is his best friend. Brian Dunne",
        "event_link": "https://www.eventbrite.com/e/brian-dunneken-yates-tickets-1306941179249?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#music_event",
            "#singer_songwriters",
            "#brian_dunne",
            "#ken_yates",
            "#on_sale_friday"
        ]
    },
    {
        "title": "A Radical Welcome: Source Code",
        "date_time": "Thursday, May 22 · 7:30 - 10pm EDT.Doors at 6:45pm",
        "location": "Strand Theatre, Columbia Road, Boston, MA, USA 543 Columbia Road Boston, MA 02125 Show map",
        "about": "A Radical Welcome: Source Code! Join us on Thu May 22 2025 at 7:30 PM for an unforgettable event at the Strand Theatre located on Columbia Road in Boston, MA, USA . This years A Radical Welcome is titled Source Code, borrowed from Jessie Montgomery's composition of the same name which opens the program . The extraordinary energy within Source Code extends throughout the program which showcases five women composers including: Melanie Bonis (1858-1957) Amy Beach (1867-1944) Gabriela Lena Frank (b. 1972) Jessie Montgomery (b. 1981) Eleanor Alberga (b.1949) As audience participation is core to BPQ’s presentations, the musicians will moderate conversations with the concert-goers following each piece, getting to the bottom of where the music comes from and what it means to us. Don't miss out on this opportunity to be a part of a community that values inclusivity , diversity , and empowerment . Come and explore the S ource Code of a truly A R adical Welcome ! Featuring D íj í Kay Known for his soulful tone and mesmerizing phrasing, Trevor James Alto Flute Artist Díjí Kay (née DeShaun Gordon-King) has given performances as a soloist and principal flute in Europe, Asia, and throughout the United States. Díjí Kay grew up surrounded by griot traditions, jazz and gospel music. Inspired by the worlds and traditions of his upbringing, Díjí Kay grew passionate about programming that blends them all together to create unique and memorable concert experiences. As he continued to expand his musical versatility, Díjí Kay also went inward to cultivate his spiritual practice. It was through these meditations that he understood how he wanted to use his art. Following this epiphany, Díjí Kay moved to Cambridge to pursue a Performance Diploma from the Longy School of Music where he worked with Sergio Pallottelli where he would also be able to study therapeutic music. During his time in Boston, Díjí Kay has collaborated with Castle of Our Skins, the Celebrity Series of Boston, Shelter Music Boston, Juventas New Music Ensemble, the Boston Children's Chorus, and the American Repertory Theatre. He has also been featured on GBH. A graduate of the Longy School of Music and Harvard Ed Portal Pipeline Artist Fellow, Díjí Kay’s work and studies center around synergizing the principles of therapeutic music, sound healing, and performance practice to curate healing and transformative concert experiences.",
        "event_link": "https://www.eventbrite.com/e/a-radical-welcome-source-code-tickets-1264623164929?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#concert",
            "#music",
            "#community",
            "#event",
            "#inclusive",
            "#welcome",
            "#radical",
            "#classical_music",
            "#boston_events",
            "#source_code"
        ]
    },
    {
        "title": "Ali McGuirk",
        "date_time": "Friday, June 6 · 8 - 11:30pm EDT.Doors at 3pm",
        "location": "Lizard Lounge 1667 Massachusetts Avenue Cambridge, MA 02138 Show map",
        "about": "$20 adv/$25 door Blending classic soul power with a folk songwriter lyricism, New England’s Ali McGuirk has the rare ability to silence a room with just a few words of a song. With a voice that is raw and sultry and a style rooted in improvisation, her sets are a hypnotic and intimate journey. On her Signature Sounds Recordings debut ’Til It’s Gone , McGuirk delivers a sublime set of songs that pairs her trademark soul sound with rootsy turns and raw rock ‘n’ roll detours. The album landed on the Boston Globe’s Top 50 Albums list for 2022. Consequence of Sound raved, “‘All Back’ feels like it could exist somewhere outside of space and time– it could be on a record in the background of a party in a 1970s bungalow, or it could be on your Discover Weekly playlist on Spotify. Either way, it’s a great listen.” McGuirk co-produced ‘Til It’s Gone with Jonah Tolchin (a star singer-songwriter in his own right) and a set of session legends: Little Feat guitarist/mandolinist Fred Tackett, organist Larry Goldings (James Taylor, Norah Jones), singer Valerie Pinkston (Ray Charles, Luther Vandross), percussionist Lenny Castro (Stevie Nicks, Stevie Wonder). They provided the astounding chops, but the true magic of the album comes from McGuirk’s singular voice as both singer and songwriter. The nine tracks run from intimate introspection to wider meditations on oppression and justice, from tough r&b and tender soul to big rock guitar and twangy folk. And McGuirk's voice – bold, buttery, spellbinding – carries each song to the next til they’re gone. Ali McGuirk",
        "event_link": "https://www.eventbrite.com/e/ali-mcguirk-tickets-1302996881749",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#music",
            "#soul",
            "#livemusic",
            "#singersongwriter",
            "#cambridgeevents",
            "#harvardsquare",
            "#lizardlounge",
            "#alimcguirk",
            "#cambridgemass"
        ]
    },
    {
        "title": "[БОСТОН] СУПЕРДИСКОТЕКА 90х и 2000х [LOVE IS...]",
        "date_time": "Starts on Saturday, May 3 · 8pm EDT",
        "location": "Sonia Live Music Venue 10 Brookline Street Cambridge, MA 02139 Show map",
        "about": "БОСТОН, 3 МАЯ 2025 ГОДА (СУББОТА) 💖 Любовь — это... танцы, музыка и незабываемые эмоции! 💖 Специальная программа для тех, кто любит радость, драйв и яркие впечатления! СУПЕРДИСКОТЕКА 90х и 2000х СЕРГЕЯ ШАХОВА — это: - неповторимая атмосфера , где музыка объединяет всех - взрывной танцпол , где можно танцевать под любимые треки - видеоряд с караоке-текстами , чтобы все могли не только слушать и танцевать, но и петь вместе с нами! ✨ Каждое мероприятие уникально! 🎶 В программе: 30 новых песен — свежий набор хитов из 90х и 2000х 10-15 самых любимых хитов — ваши неизменные фавориты.Вы всегда услышите что-то новое, одновременно наслаждаясь лучшими треками прошлых лет! 💌 Приглашайте друзей и наслаждайтесь этой уникальной атмосферой! ⏰ Doors open: 8:00 PM 🔞 Age Restriction: 18+ 📍 Где: Sonia Live Music Venue (10 Brookline Street, Cambridge, MA 02139) 💃🕺 Не пропустите вечер, полный драйва, танцев и любимой музыки. Приглашайте друзей, чтобы насладиться этим уникальным событием вместе! 💘 Празднуйте любовь к жизни и музыке вместе с нами! 🎟️ БИЛЕТЫ ТУТ: https://www.sergeyshakhov.com/ticketsnew May 03, 2025 — We are waiting for YOU! << Ф ОТО С ДИСКОТЕКИ 90х В НЬЮ-ЙОРКЕ - 1 >> << Ф ОТО С ДИСКОТЕКИ 90х В ЧИКАГО - 1 >> << Ф ОТО С ДИСКОТЕКИ 90х В СИЭТЛЕ - 1 >>",
        "event_link": "https://www.eventbrite.com/e/90-2000-love-is-tickets-914059224747",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#seattle",
            "#liveconcert",
            "#shakhov",
            "#seattle_event",
            "#discoteka90",
            "#shakhovband",
            "#sergeyshakhov"
        ]
    },
    {
        "title": "Interactive Chamber Music Masterclass & Concert with Analog by Choice",
        "date_time": "Sunday, May 4 · 5 - 7pm EDT",
        "location": "63 Trapelo Rd 63 Trapelo Road Belmont, MA 02478 Show map",
        "about": "Join us for a unique and engaging evening of chamber music at Attacca School of Music on Sunday, May 4th, from 5:00-7:00 PM featuring the talented musicians of Analog by Choice . This special event is designed for music lovers of all ages, offering a hands-on experience in both performance and storytelling. From 5:00-6:00 PM , enjoy an interactive masterclass with the student chamber groups of Attacca School of Music. Watch as students collaborate with Analog by Choice in real-time, gaining valuable insight into the artistry of ensemble playing and the nuances of chamber music. From 6:00-7:00 PM , be part of a dynamic and imaginative interactive concert where the quartet will present a unique program inspired by the structure of a novel. In this \"build your own quartet\" experience, the quartet will weave together \"chapters\" from different pieces to create a new musical narrative. As each movement unfolds, there will be moments of audience interaction, encouraging young listeners to share their interpretations of the evolving story. Date : Sunday, May 4th Time : 5:00 PM – 7:00 PM Location : Attacca School of Music 63 Trapelo Rd Belmont MA 02478 Attendance free for Attacca families/students with suggested donation of $15 per family to the performers Attendance $15 for anyone outside of Attacca About Analog by Choice : https://www.analogbychoice.com/ Analog By Choice is a Boston-based collective of classical musicians dedicated to producing high quality performances featuring historically underrepresented composers alongside their better-known contemporaries. By programming each concert around a single letter of the alphabet, we are able to expand our own repertoire while providing our audiences with a fun and engaging entry point to both new and familiar music.",
        "event_link": "https://www.eventbrite.com/e/interactive-chamber-music-masterclass-concert-with-analog-by-choice-tickets-1312109357409",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Belmont, MA",
            "Belmont Performances",
            "Belmont Music Performances",
            "#concert",
            "#interactive",
            "#massachusetts",
            "#masterclass",
            "#belmont",
            "#classicalmusic",
            "#chamber_music",
            "#analog_by_choice"
        ]
    },
    {
        "title": "TONO ROSARIO",
        "date_time": "May 17 · 9pm - May 18 · 1:30am EDT.Doors at 9pm",
        "location": "Oceanside Revere 1290 North Shore Road Revere, MA 02151 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/tono-rosario-tickets-1295982682089",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Revere, MA",
            "Revere Performances",
            "Revere Music Performances"
        ]
    },
    {
        "title": "Robbie Pate Quartet at The Mad Monkfish!",
        "date_time": "Wednesday, April 30 · 7 - 8:30pm EDT",
        "location": "The Mad Monkfish 524 Massachusetts Avenue Cambridge, MA 02139 Show map",
        "about": "Robbie Pate Quartet Personnel: Robbie Pate, voice Jiri Nedoma, Piano Mike Gary, Bass Ryan Sands, Drums Robbie’s band presents a night of original music and jazz arrangements featured on his upcoming album later this year! An electrifying singer with the voice and taste to match! NOTE: Immerse yourself in the cozy atmosphere of the Jazz Baroness Room at The Mad Monkfish, where you can sip your favorite drink, savor sushi or Thai cuisine, and enjoy the mesmerizing sounds of a remarkable jazz ensemble. Whether you're a seasoned jazz aficionado or simply seeking a delightful night out, this event promises to be a treat for your senses. To keep this vibrant jazz scene alive, we kindly ask for a minimum spend of $25 per person, as most of the ticket proceeds go directly to the musicians . Our full bar and food menus are available to complement the musical experience, so indulge in our renowned cuisine while supporting live jazz at The Mad Monkfish. Together, we can keep the music playing! BIO: Robbie Pate is a vocalist and pianist based out of NYC. Born and raised in Baltimore, Robbie found his love for music at an early age, singing with the choir at church. Robbie then went on to study voice at the Baltimore School for the Arts, and continued his music studies in Boston at Berklee College of Music and New England Conservatory. Robbie has performed with the Zac Brown Band at Fenway Park and has been a featured artist at the Boston Jazz Fest, Newton Jazz Festival and Jazz on the Charles. Most notably, Robbie has toured internationally with the Alexey Podymkin Quartet in 2018 in Russia, and in Japan with the Yuki Futami Trio in 2022 and 2023. Robbie's love for different styles of music has resulted in collaborating with several artists and bands from hip hop to r&b, jazz, and acapella, and he has been featured on albums with the Matt Savage Groove Experiment, Green Line X-Tension, Alexandra James and most recently with the Yuki Futami Trio. Robbie is currently an ensemble professor at Berklee College of Music.",
        "event_link": "https://www.eventbrite.com/e/robbie-pate-quartet-at-the-mad-monkfish-tickets-1288711142719",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Performances",
            "Cambridge Music Performances",
            "#event",
            "#jazz",
            "#live_music",
            "#mad_monkfish",
            "#robbie_pate_quartet"
        ]
    },
    {
        "title": "SAK PA SOCA \"THE GOUYARD BEND OVER\"",
        "date_time": "May 2 · 10pm - May 3 · 2am EDT",
        "location": "Montserrat Aspirers Inc 358 Washington Street Boston, MA 02124 Show map",
        "about": "Supah Koncepts Presents: Sak Pa Soca “The Gouyad Bend over” 📍Monsterratt Aspirers 358 Washington St, Boston, MA 02124 🗓️ May 2nd, 2025 ⏰ 10p- 2am SOCA, KOMPA and Zouk all night Get ready to dance the night away at the most exciting fusion event of the year! Whether you’re a Soca lover, Kompa enthusiast, or just looking for an unforgettable night of rhythm and celebration, this party is where you need to be! Don’t miss out on this epic night of Soca and Kompa—it’s going to be a party like no other! 🎟️ Advanced Tickets 🎫 SakPaSoca25.eventbrite.com #supahkoncepts #sakpasoca #Share",
        "event_link": "https://www.eventbrite.com/e/sak-pa-soca-the-gouyard-bend-over-tickets-1319484968059",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Parties",
            "Boston Music Parties",
            "#dance_party",
            "#caribbean_vibes",
            "#event_name",
            "#sak_pa_soca",
            "#the_gouyard_bend_over"
        ]
    },
    {
        "title": "Rev'd Spin Session w/ FREE Mother Juice & Culture Pop!",
        "date_time": "Saturday, May 3 · 12:15 - 2pm EDT.Doors at 12:15pm",
        "location": "Rev'd Indoor Cycling | Copley 100 Huntington Avenue #D024F Boston, MA 02116 Show map",
        "about": "Join B-Side and Rev'd for an awesome Saturday afternoon! Train in a 45-minute indoor cycling session at the Rev'd Copley studio, followed by refreshments from Culture Pop and Mother Juice and a chance to get to know other B-Siders IRL. Become a B-Side member for $10 off your entry and a B-Side sweat towel to take home!",
        "event_link": "https://www.eventbrite.com/e/revd-spin-session-w-free-mother-juice-culture-pop-tickets-1307103294139",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Music Performances",
            "#fitness",
            "#community",
            "#meetup",
            "#collaboration",
            "#workout",
            "#cycling",
            "#fitnessevent",
            "#indoorcycling",
            "#bostonfitness",
            "#special_event"
        ]
    },
    {
        "title": "Twenty-Øne Pilots Ensemble w/ Aleksandra Picariello +  Uninformed Decisions",
        "date_time": "Saturday, May 3 · 4 - 7pm EDT.Doors at 4pm",
        "location": "The Jungle 6 Sanborn Court Somerville, MA 02143 Show map",
        "about": "More tickets will be released for sale at the door. Doors at 3:30pm Music at 4:00pm Bar & Kitchen 21+ $10 tickets Uninformed Decisions https://www.instagram.com/uninformeddecisions/ Aleksandra Picariello https://www.instagram.com/aleksandra_picariello https://apicariello.com/home The Twenty-Øne Pilots Ensemble (Twenty One Pilots Cover Band) https://www.instagram.com/thetopensemble/",
        "event_link": "https://www.eventbrite.com/e/twenty-ne-pilots-ensemble-w-aleksandra-picariello-uninformed-decisions-tickets-1319579119669",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Somerville, MA",
            "Somerville Performances",
            "Somerville Music Performances"
        ]
    }
]