[
    {
        "title": "ODSC East 2025 Conference | Open Data Science Conference",
        "date_time": "May 13 · 9am - May 15 · 6pm EDT",
        "location": "Boston Convention and Exhibition Center 415 Summer Street Boston, MA 02210 Show map",
        "about": "Are you ready to experience the leading technical AI conference? THE must-attend event for AI and data science practitioners, ODSC East, offers cutting-edge workshops, hands-on training sessions, and insights from industry leaders, ensuring that attendees stay at the forefront of AI. On its 10th anniversary, ODSC East will feature 250+ speakers, instructors, and practitioners, 2,500 of your fellow data and AI practitioners, and hands-on instruction for world-class experts in: AI Agents | Generative AI | Large Language Models | AI Engineering | Machine Learning | Deep Learning | MLOps and LLMOps | AI for Biotech, Pharma, and Life Sciences | Data Engineering | Data Visualization and Analysis | and much more .",
        "event_link": "https://www.eventbrite.com/e/odsc-east-2025-conference-open-data-science-conference-tickets-951374094527?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#ai",
            "#data",
            "#machinelearning",
            "#nlp",
            "#mlops",
            "#data_analytics",
            "#machine_learning",
            "#data_science",
            "#artificial_intelligence",
            "#deep_learning"
        ]
    },
    {
        "title": "MIT Sustainability Summit 2025: Adapting for tomorrow",
        "date_time": "Friday, May 2 · 8:30am - 5:30pm EDT",
        "location": "MIT Samberg Conference Center 50 Memorial Drive Cambridge, MA 02142 Show map",
        "about": "The MIT Sustainability Summit 2025 is one of the largest student-run conferences in the world, bringing together industry leaders, policymakers, academics, and students to tackle the most pressing challenges in sustainability. This year, as climate change accelerates, we shift our focus to adaptation and climate resilience —how businesses, governments, and communities can prepare for and thrive in an uncertain future. From infrastructure to policy, finance to technology, we’ll explore the strategies and innovations that will shape a more resilient world. For more information including a full agenda and speaker list, checkout our website .",
        "event_link": "https://www.eventbrite.com/e/mit-sustainability-summit-2025-adapting-for-tomorrow-tickets-1226552233749?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#innovation",
            "#sustainability",
            "#2025",
            "#mit_sustainability_summit",
            "#adapting_for_tomorrow"
        ]
    },
    {
        "title": "2025 MIT Sloan CIO Symposium",
        "date_time": "Tuesday, May 20 · 7:30am - 6:30pm EDT",
        "location": "Royal Sonesta Hotel 40 Edwin H Land Blvd Cambridge, MA 02142 Show map",
        "about": "The 2025 MIT Sloan CIO Symposium (May 20) will be an in-person event at the Royal Sonesta Hotel, Cambridge, MA. The 2025 theme is CIO Leadership in an AI-Driven World . The MIT Sloan CIO Symposium is the nation’s premier CIO event bringing together information technology executives from around the world and leading faculty from MIT. The annual event offers interactive learning and thought-provoking discourse on the future of technology, best practices, and business that is not available anywhere else. It includes presentations, panels, networking and a closing reception. The annual MIT Sloan CIO Symposium began in 2004 and continues to adapt to changing times. Paid subscribers to our online community (Innovators) are entitled to discount tickets, access to the VIP-only pre-event on May 19, and access to exclusive online content. Innovator Membership Fee: $75/year Visit https://mitcio.info/register for details. DAY BEFORE NETWORKING (MAY 19) VIPs (Panelists, Sponsors, Showcase Finalists, Organizing Team and Innovators) are invited to join us on May 19, the day before the CIO Symposium. The pre-event will be packed with new opportunities to engage with the MIT Sloan CIO Symposium community. The afternoon agenda includes lunch, an inspirational talk, roundtable discussions on unresolved technology topics, and a formal debate. Next, you’ll enjoy a reception with the Innovation Showcase finalists followed by the CIO Leadership Award dinner. Join our online community as an Innovator to attend. SENIOR LEVEL ATTENDEES Our attendees are senior-level IT decision-makers. In 2024, 54% were involved in purchasing decisions for IT projects, products, and platforms; 62% had over 20 years of experience; 36% came from companies with revenue over $100M; and 6% came from countries outside of the United States. Also, 95% were satisfied or very satisfied with the event resulting in a net promoter score (NPS) of 65, the highest for the past 6 years. SAVE THE DATES: May 18 & 19, 2026",
        "event_link": "https://www.eventbrite.com/e/2025-mit-sloan-cio-symposium-tickets-1101160293079?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#leadership",
            "#digital",
            "#executive",
            "#security",
            "#transformation",
            "#cio",
            "#cdo",
            "#mit",
            "#sloan",
            "#mitcio"
        ]
    },
    {
        "title": "Adam Becker at the Harvard Science Center",
        "date_time": "Starts on Monday, April 28 · 6pm EDT",
        "location": "Science Center 1 Oxford Street Cambridge, MA 02138 Show map",
        "about": "Harvard Book Store, the Harvard University Division of Science, and the Harvard Library welcome Adam Becker —science journalist with a PhD in astrophysics and author of the New York Times Book Review Editor’s Choice What Is Real? —for a discussion of his new book More Everything Forever: AI Overlords, Space Empires, and Silicon Valley's Crusade to Control the Fate of Humanity . He will be joined in conversation by Moira Weigel —Assistant Professor of Comparative Literature and Faculty Associate of the Berkman Klein Center and the Fairbank Center at Harvard, and the author of Voices from the Valley and Labor of Love —and Max Gladstone —Hugo Award-winning author of This is How You Lose the Time War . This event will take place at the Harvard Science Center Hall D, located at 1 Oxford St, Cambridge. Ticketing There are two ticket options available for this event. Following the presentation will be a reception and book signing in the Cabot Science Library across the hall from the presentation room. Free General Admission Ticket: Includes admission for one. Book-Included Ticket: Includes admission for one and one hardcover copy of More Everything Forever. Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event. About More Everything Forever This \"wild and utterly engaging narrative\" (Melanie Mitchell) shows why Silicon Valley’s heartless, baseless, and foolish obsessions—with escaping death, building AI tyrants, and creating limitless growth—are about oligarchic power, not preparing for the future Tech billionaires have decided that they should determine our futures for us. According to Elon Musk, Jeff Bezos, Sam Altman, and more, the only good future for humanity is one powered by technology: trillions of humans living in space, functionally immortal, served by superintelligent AIs. In More Everything Forever , science journalist Adam Becker investigates these wildly implausible and often profoundly immoral visions of tomorrow—and shows why, in reality, there is no good evidence that they will, or should, come to pass. Nevertheless, these obsessions fuel fears that overwhelm reason—for example, that a rogue AI will exterminate humanity—at the expense of essential work on solving crucial problems like climate change. What’s more, these futuristic visions cloak a hunger for power under dreams of space colonies and digital immortality. The giants of Silicon Valley claim that their ideas are based on science, but the reality is darker: they come from a jumbled mix of shallow futurism and racist pseudoscience. More Everything Forever exposes the powerful and sinister ideas that dominate Silicon Valley, challenging us to see how foolish, and dangerous, these visions of the future are. Bios Adam Becker is a science journalist with a PhD in astrophysics. He has written for the New York Times , the BBC, NPR, Scientific American , New Scientist , Quanta, and other publications. His first book, What Is Real? , was a New York Times Book Review Editor’s Choice and was long-listed for the PEN Literary Science Writing Award. He has been a science journalism fellow at the Santa Fe Institute and a science communicator in residence at the Simons Institute for the Theory of Computing. He lives in California. Moira Weigel is the Assistant Professor of Comparative Literature, Faculty Associate of the Berkman Klein Center for Internet and Society, and Faculty Associate of the Fairbank Center for Chinese Studies at Harvard University. She has a PhD from Yale University, 2018 a MPhil from Cambridge University, 2008, and a BA, Harvard University, 2007. Her first book, Labor of Love: the Invention of Dating (2016) has been translated into six languages and appeared in dozens of outlets including The New Yorker , The New York Times , The Economist , The Washington Post , The Atlantic , The Guardian , The Wall Street Journal , NPR , CNN , and HBO. Her second book, co-edited with Ben Tarnoff, Voices from the Valley: Tech Workers Talk About What They Do and How They Do It (2020) has received positive reviews from The New York Times, Wired, The Nation, and the Los Angeles Review of Books , among other outlets, and was named one of Wired‘s “8 Best Books About Artificial Intelligence to Read Now”. Hugo-, Nebula-, and Locus Award winning author Max Gladstone has been thrown from a horse in Mongolia and once wrecked a bicycle in Angkor Wat. He is the author of many books, including Empress of Forever, the Craft Sequence of fantasy novels, and, with Amal El-Mohtar, the internationally bestselling This is How You Lose the Time War . His dreams are much nicer than you'd expect. Masking Policy Masks are encouraged but not required for this event.",
        "event_link": "https://www.eventbrite.com/e/adam-becker-at-the-harvard-science-center-tickets-1258689156149?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Appearances",
            "Cambridge Science & Tech Appearances",
            "#sciences",
            "#scientific",
            "#scientist",
            "#science_communication",
            "#science_education",
            "#science_and_technology",
            "#harvardsquare"
        ]
    },
    {
        "title": "2025 MIMO Symposium",
        "date_time": "Tuesday, May 6 · 8:30am - 6:30pm EDT",
        "location": "MIT Wong Auditorium, Amherst Street, Cambridge, MA, USA 2 Amherst Street Cambridge, MA 02142 Show map",
        "about": "2025 MIT MIMO Symposium Join MIT Machine Intelligence for Manufacturing & Operations (MIT MIMO) and MIT CSAIL for the fourth annual MIMO Symposium, a thrilling event that brings together industry leaders, researchers, and students to explore the latest trends in AI and Generative AI for manufacturing and operations. This in-person event will be held at the MIT Wong Auditorium in Cambridge, MA, USA . Get ready for keynote sessions and panels featuring industry experts, a research poster expo, and more. Don't miss out on this incredible chance to connect with like-minded individuals and discover how intelligent technologies are transforming manufacturing and operations. Mark your calendars and be part of this exciting event! Visit our website for more information and updates about the 2025 symposium agenda and speakers, as well as content videos from past years: https://mimo.mit.edu/symposium/",
        "event_link": "https://www.eventbrite.com/e/2025-mimo-symposium-tickets-1256489175949?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#manufacturing",
            "#symposium",
            "#annual",
            "#mit",
            "#2024",
            "#artificialin"
        ]
    },
    {
        "title": "MIT Water, Food, & Agriculture Innovation Prize 2025",
        "date_time": "Wednesday, April 30 · 5 - 9pm EDT",
        "location": "MIT Media Lab 75 Amherst Street Cambridge, MA 02139 Show map",
        "about": "MIT Water, Food, & Agriculture Innovation Prize Welcome to the MIT Water, Food, & Agriculture Innovation Prize event! Join us at the MIT Media Lab for an evening filled with groundbreaking ideas and solutions in the fields of water, food, and agriculture. After a dinner mingling with experts, entrepreneurs, and enthusiasts, hear from our innovative startup finalists. Don't miss this opportunity to be part of a community dedicated to driving positive change in these crucial industries. See you there!",
        "event_link": "https://www.eventbrite.com/e/mit-water-food-agriculture-innovation-prize-2025-tickets-1263994544709?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Science & Tech Networking",
            "#food",
            "#innovation",
            "#water",
            "#agriculture",
            "#mit"
        ]
    },
    {
        "title": "2025 33rd NEBS Annual Conference",
        "date_time": "Saturday, May 17 · 9am - 6pm EDT",
        "location": "260 Longwood Ave 260 Longwood Avenue TMEC (Walter Amphitheater) Boston, MA 02115 Show map",
        "about": "2025 33rd NEBS Annual Conference May 17, 2025 (Sat) 9 AM - 6 PM Harvard Medical School TMEC 246 (Walter Amphitheater) - 260 Longwood Ave, Boston, 02115 Online registration : April 1 - April 30 ($10) On site registration : May 17 ($20) Keynote Speakers: Dr. Young-Bum Kim (Harvard Medical School) Dr. Seung-Schik Yoo (Harvard Medical School)",
        "event_link": "https://www.eventbrite.com/e/2025-33rd-nebs-annual-conference-tickets-1286414984849?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Science & Tech Seminars",
            "#tmec",
            "#nebs"
        ]
    },
    {
        "title": "AI Community Conference - Boston",
        "date_time": "May 1 · 10am - May 2 · 5pm EDT",
        "location": "Microsoft New England Research and Development Center 1 Memorial Drive Cambridge, MA 02142 Show map",
        "about": "🚀 Exciting Announcement: Join Us for a Cutting-Edge AI Community Event in Boston! 🤖 Are you ready to dive into the thrilling world of Artificial Intelligence (AI)? Look no further! We're thrilled to invite you to a dynamic and engaging community event focused on AI, set to take place right in the heart of Boston. 📅 Pre-Day Workshop: May 1st, 2025 🕒 Time: 10 a.m. EST 🏢 Venue: Microsoft New England Research and Development Center 📅 Main Conference: May 2nd, 2025 🕒 Time: 9 a.m. EST 🏢 Venue: Microsoft New England Research and Development Center Pre-Day Workshop: Hands-On AI Training Kickstart your AI experience with an exclusive pre-day workshops designed for professionals, developers, and enthusiasts looking to gain hands-on experience with AI tools and techniques. Led by industry experts, these interactive sessions cover both low-code / no-code approaches as well as a fully customized approach to building agents. Morning Session: Beyond Chatbots: Building Automous Agents with Copilot Studio Learn to orchestrate multi-step workflows and connect to real-world data with a no-code/low-code approach. Build solutions that think and act independently—way beyond basic bots. Walk away with a working prototype and a framework for deploying agents that make a real impact. Afternoon Session: From Code to Intelligence – Building NextGen AI Agents Understand Agentic AI – Break down the architecture behind intelligent, adaptive AI agents. Orchestrate AI with Semantic-Aware Functions – Use dynamic, context-driven functions to optimize agent orchestration and workflows. Manage Semantic App State – Enable AI systems to retain memory, adapt to interactions, and evolve in real-time. Apply Microsoft Research Insights – Leverage breakthroughs from AutoGen and Magentic-One to build enterprise-grade AI agents. Here's a sneak peek of what's in store at the Main Conference: 🎤 Inspiring Keynote + Speaker Presentations – Gain insights from renowned AI experts as they share their vision for the future of AI and its impact across various industries. 💡 Thought-Provoking Panel Discussions – Engage in discussions on AI ethics, diversity, and the societal implications of AI adoption. Your perspective matters, so join the conversation! 🚀 Sponsor Showcases – Discover groundbreaking AI startups and their innovative solutions shaping the future of technology. 🤝 Networking Opportunities – Connect with like-minded individuals, forge valuable connections, and expand your professional network within the vibrant Boston AI Community. 🎉 Fun and Entertainment – Enjoy live demonstrations, AI-powered activities, and interactive exhibits that promise to entertain and inspire attendees. Don't miss out on this incredible opportunity to immerse yourself in the fascinating world of AI and connect with fellow enthusiasts and experts. Please reserve your spot today and get ready to embark on an unforgettable AI journey with us! Stay tuned for more updates and surprises. We can't wait to welcome you to the AI event of the year in Boston! 🌟 Reach out if you would like to be a Sponsor at this year's conference.",
        "event_link": "https://www.eventbrite.com/e/ai-community-conference-boston-tickets-1274004524829?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#community",
            "#event",
            "#ai",
            "#conference",
            "#newyork"
        ]
    },
    {
        "title": "Lab Automators: Free Headshots",
        "date_time": "Tuesday, April 29 · 6 - 9pm EDT",
        "location": "Lamplighter Brewing Co. - CX 110 North First Street Cambridge, MA 02141 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/lab-automators-free-headshots-tickets-1321659381789?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Science & Tech Networking",
            "#technology",
            "#collaboration",
            "#automation",
            "#welcome_back",
            "#lab_automators"
        ]
    },
    {
        "title": "Gen AI  X Summit | ODSC East 2025",
        "date_time": "May 13 · 10am - May 14 · 5:30pm EDT",
        "location": "Boston Convention and Exhibition Center 415 Summer Street Boston, MA 02210 Show map",
        "about": "The Gen AI X Summit , co-located with ODSC East 2025 , brings together the top industry executives, managers, and CxOs to help you understand how AI and data science can transform your industry, including: Healthcare , Insurance, Retail, Government , Education, Bio/Pharma , Media & Marketing, Transportation, Finance , Manufacturing, Energy & Utilities, E-commerce , and more. Superior Content, Peer Learning At the most important Industry AI event of the year, you’ll hear from fellow CxOs, executives, chief data scientists, and thought leaders. Discover how AI and Data Science techniques are transforming business and how to prepare your company for the next wave of innovation by learning about: Deep Learning, Real-time Prediction, New Product Development, Data Visualization, Machine Learning, AI Tools and Frameworks, Automation, Sentiment Analysis, and Open Source AI/Data Science",
        "event_link": "https://www.eventbrite.com/e/gen-ai-x-summit-odsc-east-2025-tickets-1104579600319?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#california",
            "#innovations",
            "#san_francisco",
            "#ai_ethics",
            "#ai_business",
            "#ai_governance",
            "#ai_for_business",
            "#ai_compliance",
            "#ai_business_summit",
            "#ai_for_enterprise"
        ]
    },
    {
        "title": "AI Expo & Open Pass | ODSC East 2025",
        "date_time": "May 13 · 10am - May 14 · 5pm EDT",
        "location": "Boston Convention and Exhibition Center 415 Summer Street Boston, MA 02210 Show map",
        "about": "AI plays an essential role in businesses and has the potential will be utilized across a wide variety of industries in the future. Join us at the In-person AI Expo & Demo @ODSC East 2025 on May 13-14th to learn about the latest industry trends and stay on top of innovations. This is a unique opportunity to access and interact with industry leaders from wherever you are in the world! With In-person Open Pass, you’ll get direct access to: Main ODSC Conference Keynotes Live Solution Showcase Talks 30+ Featured Partners , including Google Cloud, SAP, Microsoft, Gurobi, Plotly, and many more. $300 + in Partners Platform Credits In-person Networking space with 1,500 like-minded peers to develop and nurture professional relationships Live and Recorded Sessions featuring expert-led talks and tutorials on AI adoption Featured Partners , previously including IBM, Outerbounds, HPCC, Knime, and more Watch product demos, download product materials, and conduct live chats - all in one space and just one click away. Whether you are a CTO, CEO, data engineer, business analyst, software architect, data analytics, or product manager - The In-person AI Expo & Demo Hall @ODSC East 2025 is a place to be. Claim your free pass or buy an Expo Pass to avoid waiting today and be part of where the future of AI comes together!",
        "event_link": "https://www.eventbrite.com/e/ai-expo-open-pass-odsc-east-2025-tickets-1308427374499?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#ai",
            "#data",
            "#machinelearning",
            "#nlp",
            "#mlops",
            "#data_analytics",
            "#machine_learning",
            "#data_science",
            "#artificial_intelligence",
            "#deep_learning"
        ]
    },
    {
        "title": "2025 CGA Conference & Symposium on Spatiotemporal Data Science",
        "date_time": "May 22 · 9am - May 24 · 5pm EDT",
        "location": "1730 Cambridge St 1730 Cambridge Street Cambridge, MA 02138 Show map",
        "about": "2025 CGA Conference: The Geography of Digital Twins & The 2025 International Symposium on Spatiotemporal Data Science May 22-24, 2025 1730 Cambridge Street, Cambridge MA 02138 Hosted by the Center for Geographic Analysis at Harvard and co-sponsored by the Institute for Quantitative Social Science, and others, this conference aims to foster a dialogue between diverse digital twin perspectives, and bring together experts from industry, government, and academia, as well as geographers, designers, and others. Topics may include geospatial and physics-based modeling, augmented reality, big data processing, high-performance computing, scripting and workflows, replicability, explainability, interoperability, among others. The Conference will start with a half-day pre-conference workshop Thursday morning, followed by a day and a half of plenary sessions on Thursday afternoon and Friday, which will include keynote addresses, presentation sessions, panel discussions, and lightning talks. Saturday will continue with the Symposium portion which will only be virtual. For the Conference Thursday and Friday, speaker and audience engagement will be in person, while the Zoom audience will be able to view, but not participate in the discussions. For the Symposium on Saturday, all proceedings will be virtual via Zoom, without any in-person activity. For more details, visit https://gis.harvard.edu/event/2025-cga-conference .",
        "event_link": "https://www.eventbrite.com/e/2025-cga-conference-symposium-on-spatiotemporal-data-science-tickets-1058549984499?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#conference",
            "#symposium",
            "#gis",
            "#geospatial",
            "#2025",
            "#cga",
            "#digital_twins",
            "#geoai",
            "#spatial_data_science",
            "#spatiotemporal_data"
        ]
    },
    {
        "title": "Transition-AI 2025",
        "date_time": "Thursday, June 12 · 8am - 6:30pm EDT",
        "location": "One Boston Place Convene 201 Washington Street Boston, MA 02108 Show map",
        "about": "The Transition-AI series is back in Boston for 2025, with a focus on infrastructure. The race for AI supremacy is already having a profound effect on developing digital and energy infrastructure. Tech giants see AI as the next industrial revolution, and are feverishly planning and building new data centers equipped with purpose-built computing, cooling, and power solutions for this new age. Collectively, they are set to spend over $320 billion annually on the computing and power infrastructure to support their AI ambitions – with the bulk of that investment in the U.S. The biggest limiting factor for growth is not chips, servers, or land — it’s energy availability. The urgency to build new data centers quickly, combined with zero-carbon commitments from hyperscalers, is driving innovative thinking around how to develop energy- and resource-efficient computing capacity. It is also raising questions about how to pay for the infrastructure, and how quickly clean, firm options can scale. There are many factors that will have large consequences for data center developers and operators, utilities, IPPs, and project financiers: How reliable are power demand forecasts in the face of such a dynamic AI market? How will the new administration benefit or inhibit differing sources of energy? What role will the big oil majors play as they re-examine their strategies around participating in the power market? What role will nuclear play, and how soon should the market take it seriously? How will the market for virtual power plants, distributed energy resources, and microgrids evolve and adapt to a system with very large loads? How will colocation strategies evolve to circumvent interconnection backlogs? Can data centers reliably act as grid assets rather than solely as centers of demand? Is the grid ready to accommodate these large loads at a time when resilience is challenged by increasing weather and wildfire events? Transition-AI 2025 brings together leaders in technology, finance, power markets, and energy and digital infrastructure development to explore how the landscape and options for powering data centers is evolving, and if it still can be accomplished sustainably. Through case studies, interactive discussions, and expert presentations, we'll examine innovations in planning, developing, powering and financing the infrastructure necessary to meet the demand for AI computing. Who should attend? Transition-AI 2025 is designed for decision-makers involved in financing, developing, and operating energy and data center infrastructure. Attendees will include: Clean energy developers and IPPs Project finance leaders from commercial banks Data center operators and developers Distributed energy solution providers Transmission developers Utility finance and strategy executives Infrastructure advisory and risk management professionals Energy policy and regulatory experts",
        "event_link": "https://www.eventbrite.com/e/transition-ai-2025-tickets-1205898186939?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#innovation",
            "#artificial_intelligence",
            "#digital_transformation",
            "#future_tech",
            "#transition_ai_2025"
        ]
    },
    {
        "title": "Generative AI: The Rise, Fall, and Rebirth of Inbound Marketing",
        "date_time": "Wednesday, May 7 · 6 - 8pm EDT",
        "location": "CIC Boston 50 Milk Street #16th floor Boston, MA 02109 Show map",
        "about": "Generative AI and chat search will continue to upend digital marketing as we know it. The inbound marketing playbook is in decline. Exploring how we got here is crucial for adapting to what comes next. Shifts in technology and consumer search behavior that initially supported inbound marketing now threaten to kill it off. Join SEO and AI expert Dale Bertrand on May 7th at 6:00 PM at the CIC Boston (50 Milk Street in Boston) for a session on how to seize Google's shift to generative AI as an opportunity to pull ahead of your competition—to position your brand for upcoming shifts in technology and consumer behavior—as the inbound marketing playbook is rewritten. Space is limited, so sign up now! --------- About Dale Bertrand Dale Bertrand has been an SEO specialist to Fortune 500 companies and venture-backed startups around the world for two decades. His clients include global brands such as Citizen Watch, Nestle, Raymond Weil, Exxon Mobil and Bulova. He applies his graduate school work in artificial intelligence to search engine marketing. Dale speaks at industry conferences, leads corporate training events and serves as Entrepreneur in Residence at the Harvard Alumni Entrepreneurs Organization. He has trained marketing professionals from TripAdvisor, Microsoft, HubSpot, Digitas, Exxon Mobile and Proctor & Gamble. Dale has BS and MS degrees in Computer Engineering from Brown University. --------- Format of the Event: Networking: 6:00-6:20 PM Opening Remarks: 6:20-6:30 PM Session: 6:30-7:30 PM Open Networking: 7:30-8:00 PM ----- Sponsorships Want to become a sponsor of this event or a future AMA Boston event? Reach out to sponsorship@amaboston.org! ----- About the American Marketing Association (AMA) Boston: The American Marketing Association (AMA) Boston is the networking and educational hub for New England marketers. Our mission is to build a community of marketers who can share experiences, learn about the latest marketing trends, and build a powerful professional network. AMA Boston empowers its members with the knowledge and resources they need to be leaders in their careers and organizations. Learn more at https://www.amaboston.org. ----- Any questions? Please reach out to us at theoffice@amaboston.org !",
        "event_link": "https://www.eventbrite.com/e/generative-ai-the-rise-fall-and-rebirth-of-inbound-marketing-tickets-1318978593479?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Seminars",
            "Boston Science & Tech Seminars",
            "#artificial_intelligence",
            "#inbound_marketing",
            "#generative_ai",
            "#event_title",
            "#rise_fall_rebirth"
        ]
    },
    {
        "title": "Field Trip: South End Architectural Walking Tour with David Hacin (BOS)",
        "date_time": "Thursday, May 1 · 3 - 5pm EDT",
        "location": "Tatte Bakery & Cafe | South End 345 Harrison Avenue Boston, MA 02118 Show map",
        "about": "Join us on Thursday , May 1 from 3–5pm ET for a guided architectural walking tour of Boston's South End. Join Hacin President and Creative Director, David Hacin, FAIA, on a walking tour through his home neighborhood that will highlight classic South End moments such as the bow-front townhouses of Union Park and the vibrant thoroughfare of Tremont Street, as well as the up and coming SoWa Art and Design District (with nods to the firm’s various projects from the past three decades along the way). The tour will last approximately two hours with a networking session at Tatte on Harrison Avenue to start and ending at the Boston Center for the Arts. The South End has a long history of reinventing itself. Comprised of mostly marshland during the time of Boston’s founding, the neighborhood was filled in in the mid-1800s and was named to the National Register of Historic Places in 1973. Most recently, its transformation in the last thirty years has changed it from a neighborhood trapped in a frustrating cycle of neglect and disinvestment to one of the most vibrant and beloved parts of Boston, with a resonant architectural character and an effective process of incremental urbanism. Architecture and design firm Hacin has long called the South End its home and the firm’s extensive body of work in the neighborhood includes townhouses and historic renovations, restaurants, a public park, a community garden, hundreds of housing units across the spectrum of affordable and luxury, and a non-profit headquarters. Over the studio’s thirty-year history, Hacin has demonstrated a commitment to the community and has been grateful to play a part in the area’s current success. Field Trips are a benefit of membership in the Design Impact Society and Corporate + Academic Membership . Individual + Members register for $10, Access Members register for $13 and not-yet-Members register for $15. Student Members register for FREE on a limited, first-come, first-served basis.",
        "event_link": "https://www.eventbrite.com/e/field-trip-south-end-architectural-walking-tour-with-david-hacin-bos-tickets-1297343271649?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Science & Tech Tours",
            "#designers",
            "#design",
            "#social_events",
            "#boston_events"
        ]
    },
    {
        "title": "Antibody Drug Conjugates",
        "date_time": "Friday, June 27 · 9am - 4:35pm EDT",
        "location": "Massachusetts Institute of Technology, Huntington Hall 10-250 77 Massachusetts Avenue Cambridge, MA 02139 Show map",
        "about": "The 23rd Annual Koch Institute Symposium on Antibody Drug Conjugates: Targeted Cancer Therapies at the Intersection of Chemistry, Biology, and Engineering will take place on Friday, June 27, 2025. Kicking off with 2022 Nobel Prize winner Carolyn Bertozzi, our speaker lineup features an array of industry and academic leaders who will discuss current advancements and challenges in deploying antibody drug conjugates as anti-cancer agents. We cordially invite scientists, oncologists, and any other member of the biomedical community to join us in a day of engaging talks, stimulating conversations with colleagues, and of course camaraderie in our collective fight against cancer. The keynote speaker will be Stanford University's Carolyn Bertozzi . She will be joined by: Peter Senter, Fred Hutchinson Cancer Center Gerold Meinhardt, Daiichi Sankyo Alison Betts, T akeda Pharmaceuticals Timothy Lowinger , Mersana Therapeutics Laurie Boyer , MIT Koch Institute Dane Wittrup , MIT Koch Institute Jeremiah Johnson, MIT Koch Institute Daša Lipovšek , Aktis Oncology Greg Thurber, University of Michigan Puja Sapra , AstraZeneca Michael Seganish , Merck See the Koch Institute website for more information on the agenda.",
        "event_link": "https://www.eventbrite.com/e/antibody-drug-conjugates-tickets-1274320259199?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#research",
            "#symposium",
            "#cancer",
            "#kendall",
            "#mit",
            "#antibody",
            "#drugdevelopment",
            "#cancer_research",
            "#mit_research"
        ]
    },
    {
        "title": "Innovations in pDNA, mRNA, LNP: Expert Insights & Networking Opportunities",
        "date_time": "Monday, May 12 · 9am - 6:30pm EDT.Doors at 8:30am",
        "location": "Le Méridien Boston Cambridge 20 Sidney Street Cambridge, MA 02139 Show map",
        "about": "Welcome to Innovations in pDNA | mRNA | LNP Development and Manufacturing: Expert Perspectives and Networking Opportunities with Dan Peer, Tristan Kovačič, and Aleš Štrancar ! Join us in Boston on May 12 at Le Méridien Boston Cambridge to experience the full spectrum of advancements in pDNA, mRNA, and LNP. This unique gathering features industry leaders sharing their expertise on the plug-and-play process. As a boutique VIP event, it offers limited space, ensuring an intimate setting for networking and learning.",
        "event_link": "https://www.eventbrite.com/e/innovations-in-pdna-mrna-lnp-expert-insights-networking-opportunities-tickets-1296493560139?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Seminars",
            "Cambridge Science & Tech Seminars",
            "#networking",
            "#biotechnology",
            "#innovations",
            "#chromatography",
            "#purification",
            "#lnp",
            "#manufacturing_technology",
            "#process_optimization",
            "#mrna",
            "#pdna"
        ]
    },
    {
        "title": "Engineering with Early Learners: Wee Engineer (PreK) and Sun Hats (K)",
        "date_time": "Wednesday, May 14 · 8:30am - 3pm EDT",
        "location": "Museum of Science 1 Museum Of Science Driveway Boston, MA 02114 Show map",
        "about": "Join the professional learning team for an engaging workshop designed for educators of young learners. Dive into hands-on activities and strategies that make engineering concepts accessible and exciting for children in preschool and kindergarten. The day includes interactive sessions, reflective opportunities, and exploration of our Wee Engineer unit designed for preschoolers and our Engineering Sun Hats unit designed for kindergarteners. Morning Session: The morning section will be focused on our preschool Wee Engineer curriculum and will take place from 8:30am-11:00am. A light breakfast will be provided. We will validate parking if you choose to drive to the Museum. Full Day Session: Stay for the full day to explore the trajectory of engineering learning for our youngest learners. Explore both Wee Engineer and our YES Engineering Sun Hats kindergarten unit. A light breakfast and lunch will be provided. We will validate parking if you choose to drive to the Museum.",
        "event_link": "https://www.eventbrite.com/e/engineering-with-early-learners-wee-engineer-prek-and-sun-hats-k-tickets-1274316778789?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Science & Tech Classes",
            "#engineering",
            "#prek",
            "#early_learners",
            "#wee_engineer",
            "#sun_hats"
        ]
    },
    {
        "title": "Layer 8 Conference",
        "date_time": "Saturday, June 14 · 9am - 5pm EDT.Doors at 8am",
        "location": "775 Commonwealth Ave 775 Commonwealth Avenue Boston, MA 02215 Show map",
        "about": "Layer 8 Conference Welcome to the fifth Layer 8 Conference ! Join us for a day filled with engaging discussions, workshops, and networking opportunities. This in-person event will be held at George Sherman Union on the campus of Boston University. The address is 775 Commonwealth Ave . Connect with social engineerings and OSINT investigators, learn about the latest trends in the field, and expand your professional network. Don't miss out on this exciting opportunity to enhance your knowledge and skills in the field of cybersecurity. Mark your calendars and secure your spot today! We also offer three training classes: OSINT, Elicitation Toolbox Training and Tactical Pretexting. For more information on these classes: https://layer8conference.com/training-at-layer-8-conference-2025/",
        "event_link": "https://www.eventbrite.com/e/layer-8-conference-tickets-1053670560009?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#social",
            "#conference",
            "#engineering",
            "#security",
            "#layer8"
        ]
    },
    {
        "title": "NEEP Summit 2025",
        "date_time": "N/A",
        "location": "Courtyard Boston Downtown 275 Tremont Street Boston, MA 02116 Show map",
        "about": "It’s time to get back to the basics of energy efficiency. Join us at Summit 2025 to explore how collaboration between state and local government, businesses, and communities will be key in addressing the growing challenges of energy affordability, load growth, and climate impacts. By leveraging innovative technologies, policies, and partnerships for more efficient homes, buildings, and industries, we can scale solutions and drive transformational change. With an interactive program, NEEP Summit 2025 will examine the multiple benefits of energy efficiency. Our agenda will feature voices and models highlighting how we must scale and transform efficiency solutions to save energy and money for all, lower harmful pollution, create high-quality jobs, and promote modern and resilient technologies and practices. Bringing together energy practitioners, state and local policymakers, utility experts, industry leaders, consumer and community representatives, and problem solvers, Summit 2025 is designed to inspire attendees and advance energy efficiency. Highlighting tangible, actionable solutions in interactive sessions and engagement opportunities, this conference will deliver the strategies, and most importantly the relationships needed to advance a more efficient regional economy together.",
        "event_link": "https://www.eventbrite.com/e/neep-summit-2025-tickets-1228513830939?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#sustainability",
            "#policy",
            "#energyefficiency",
            "#decarbonization",
            "#workforce_development"
        ]
    },
    {
        "title": "ODSC East 2025 Conference | Open Data Science Conference",
        "date_time": "May 13 · 9am - May 15 · 6pm EDT",
        "location": "Boston Convention and Exhibition Center 415 Summer Street Boston, MA 02210 Show map",
        "about": "Are you ready to experience the leading technical AI conference? THE must-attend event for AI and data science practitioners, ODSC East, offers cutting-edge workshops, hands-on training sessions, and insights from industry leaders, ensuring that attendees stay at the forefront of AI. On its 10th anniversary, ODSC East will feature 250+ speakers, instructors, and practitioners, 2,500 of your fellow data and AI practitioners, and hands-on instruction for world-class experts in: AI Agents | Generative AI | Large Language Models | AI Engineering | Machine Learning | Deep Learning | MLOps and LLMOps | AI for Biotech, Pharma, and Life Sciences | Data Engineering | Data Visualization and Analysis | and much more .",
        "event_link": "https://www.eventbrite.com/e/odsc-east-2025-conference-open-data-science-conference-tickets-951374094527",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#ai",
            "#data",
            "#machinelearning",
            "#nlp",
            "#mlops",
            "#data_analytics",
            "#machine_learning",
            "#data_science",
            "#artificial_intelligence",
            "#deep_learning"
        ]
    },
    {
        "title": "MIT Sustainability Summit 2025: Adapting for tomorrow",
        "date_time": "Friday, May 2 · 8:30am - 5:30pm EDT",
        "location": "MIT Samberg Conference Center 50 Memorial Drive Cambridge, MA 02142 Show map",
        "about": "The MIT Sustainability Summit 2025 is one of the largest student-run conferences in the world, bringing together industry leaders, policymakers, academics, and students to tackle the most pressing challenges in sustainability. This year, as climate change accelerates, we shift our focus to adaptation and climate resilience —how businesses, governments, and communities can prepare for and thrive in an uncertain future. From infrastructure to policy, finance to technology, we’ll explore the strategies and innovations that will shape a more resilient world. For more information including a full agenda and speaker list, checkout our website .",
        "event_link": "https://www.eventbrite.com/e/mit-sustainability-summit-2025-adapting-for-tomorrow-tickets-1226552233749",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#innovation",
            "#sustainability",
            "#2025",
            "#mit_sustainability_summit",
            "#adapting_for_tomorrow"
        ]
    },
    {
        "title": "2025 MIT Sloan CIO Symposium",
        "date_time": "Tuesday, May 20 · 7:30am - 6:30pm EDT",
        "location": "Royal Sonesta Hotel 40 Edwin H Land Blvd Cambridge, MA 02142 Show map",
        "about": "The 2025 MIT Sloan CIO Symposium (May 20) will be an in-person event at the Royal Sonesta Hotel, Cambridge, MA. The 2025 theme is CIO Leadership in an AI-Driven World . The MIT Sloan CIO Symposium is the nation’s premier CIO event bringing together information technology executives from around the world and leading faculty from MIT. The annual event offers interactive learning and thought-provoking discourse on the future of technology, best practices, and business that is not available anywhere else. It includes presentations, panels, networking and a closing reception. The annual MIT Sloan CIO Symposium began in 2004 and continues to adapt to changing times. Paid subscribers to our online community (Innovators) are entitled to discount tickets, access to the VIP-only pre-event on May 19, and access to exclusive online content. Innovator Membership Fee: $75/year Visit https://mitcio.info/register for details. DAY BEFORE NETWORKING (MAY 19) VIPs (Panelists, Sponsors, Showcase Finalists, Organizing Team and Innovators) are invited to join us on May 19, the day before the CIO Symposium. The pre-event will be packed with new opportunities to engage with the MIT Sloan CIO Symposium community. The afternoon agenda includes lunch, an inspirational talk, roundtable discussions on unresolved technology topics, and a formal debate. Next, you’ll enjoy a reception with the Innovation Showcase finalists followed by the CIO Leadership Award dinner. Join our online community as an Innovator to attend. SENIOR LEVEL ATTENDEES Our attendees are senior-level IT decision-makers. In 2024, 54% were involved in purchasing decisions for IT projects, products, and platforms; 62% had over 20 years of experience; 36% came from companies with revenue over $100M; and 6% came from countries outside of the United States. Also, 95% were satisfied or very satisfied with the event resulting in a net promoter score (NPS) of 65, the highest for the past 6 years. SAVE THE DATES: May 18 & 19, 2026",
        "event_link": "https://www.eventbrite.com/e/2025-mit-sloan-cio-symposium-tickets-1101160293079",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#leadership",
            "#digital",
            "#executive",
            "#security",
            "#transformation",
            "#cio",
            "#cdo",
            "#mit",
            "#sloan",
            "#mitcio"
        ]
    },
    {
        "title": "2025 MIMO Symposium",
        "date_time": "Tuesday, May 6 · 8:30am - 6:30pm EDT",
        "location": "MIT Wong Auditorium, Amherst Street, Cambridge, MA, USA 2 Amherst Street Cambridge, MA 02142 Show map",
        "about": "2025 MIT MIMO Symposium Join MIT Machine Intelligence for Manufacturing & Operations (MIT MIMO) and MIT CSAIL for the fourth annual MIMO Symposium, a thrilling event that brings together industry leaders, researchers, and students to explore the latest trends in AI and Generative AI for manufacturing and operations. This in-person event will be held at the MIT Wong Auditorium in Cambridge, MA, USA . Get ready for keynote sessions and panels featuring industry experts, a research poster expo, and more. Don't miss out on this incredible chance to connect with like-minded individuals and discover how intelligent technologies are transforming manufacturing and operations. Mark your calendars and be part of this exciting event! Visit our website for more information and updates about the 2025 symposium agenda and speakers, as well as content videos from past years: https://mimo.mit.edu/symposium/",
        "event_link": "https://www.eventbrite.com/e/2025-mimo-symposium-tickets-1256489175949",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#manufacturing",
            "#symposium",
            "#annual",
            "#mit",
            "#2024",
            "#artificialin"
        ]
    },
    {
        "title": "Adam Becker at the Harvard Science Center",
        "date_time": "Starts on Monday, April 28 · 6pm EDT",
        "location": "Science Center 1 Oxford Street Cambridge, MA 02138 Show map",
        "about": "Harvard Book Store, the Harvard University Division of Science, and the Harvard Library welcome Adam Becker —science journalist with a PhD in astrophysics and author of the New York Times Book Review Editor’s Choice What Is Real? —for a discussion of his new book More Everything Forever: AI Overlords, Space Empires, and Silicon Valley's Crusade to Control the Fate of Humanity . He will be joined in conversation by Moira Weigel —Assistant Professor of Comparative Literature and Faculty Associate of the Berkman Klein Center and the Fairbank Center at Harvard, and the author of Voices from the Valley and Labor of Love —and Max Gladstone —Hugo Award-winning author of This is How You Lose the Time War . This event will take place at the Harvard Science Center Hall D, located at 1 Oxford St, Cambridge. Ticketing There are two ticket options available for this event. Following the presentation will be a reception and book signing in the Cabot Science Library across the hall from the presentation room. Free General Admission Ticket: Includes admission for one. Book-Included Ticket: Includes admission for one and one hardcover copy of More Everything Forever. Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event. About More Everything Forever This \"wild and utterly engaging narrative\" (Melanie Mitchell) shows why Silicon Valley’s heartless, baseless, and foolish obsessions—with escaping death, building AI tyrants, and creating limitless growth—are about oligarchic power, not preparing for the future Tech billionaires have decided that they should determine our futures for us. According to Elon Musk, Jeff Bezos, Sam Altman, and more, the only good future for humanity is one powered by technology: trillions of humans living in space, functionally immortal, served by superintelligent AIs. In More Everything Forever , science journalist Adam Becker investigates these wildly implausible and often profoundly immoral visions of tomorrow—and shows why, in reality, there is no good evidence that they will, or should, come to pass. Nevertheless, these obsessions fuel fears that overwhelm reason—for example, that a rogue AI will exterminate humanity—at the expense of essential work on solving crucial problems like climate change. What’s more, these futuristic visions cloak a hunger for power under dreams of space colonies and digital immortality. The giants of Silicon Valley claim that their ideas are based on science, but the reality is darker: they come from a jumbled mix of shallow futurism and racist pseudoscience. More Everything Forever exposes the powerful and sinister ideas that dominate Silicon Valley, challenging us to see how foolish, and dangerous, these visions of the future are. Bios Adam Becker is a science journalist with a PhD in astrophysics. He has written for the New York Times , the BBC, NPR, Scientific American , New Scientist , Quanta, and other publications. His first book, What Is Real? , was a New York Times Book Review Editor’s Choice and was long-listed for the PEN Literary Science Writing Award. He has been a science journalism fellow at the Santa Fe Institute and a science communicator in residence at the Simons Institute for the Theory of Computing. He lives in California. Moira Weigel is the Assistant Professor of Comparative Literature, Faculty Associate of the Berkman Klein Center for Internet and Society, and Faculty Associate of the Fairbank Center for Chinese Studies at Harvard University. She has a PhD from Yale University, 2018 a MPhil from Cambridge University, 2008, and a BA, Harvard University, 2007. Her first book, Labor of Love: the Invention of Dating (2016) has been translated into six languages and appeared in dozens of outlets including The New Yorker , The New York Times , The Economist , The Washington Post , The Atlantic , The Guardian , The Wall Street Journal , NPR , CNN , and HBO. Her second book, co-edited with Ben Tarnoff, Voices from the Valley: Tech Workers Talk About What They Do and How They Do It (2020) has received positive reviews from The New York Times, Wired, The Nation, and the Los Angeles Review of Books , among other outlets, and was named one of Wired‘s “8 Best Books About Artificial Intelligence to Read Now”. Hugo-, Nebula-, and Locus Award winning author Max Gladstone has been thrown from a horse in Mongolia and once wrecked a bicycle in Angkor Wat. He is the author of many books, including Empress of Forever, the Craft Sequence of fantasy novels, and, with Amal El-Mohtar, the internationally bestselling This is How You Lose the Time War . His dreams are much nicer than you'd expect. Masking Policy Masks are encouraged but not required for this event.",
        "event_link": "https://www.eventbrite.com/e/adam-becker-at-the-harvard-science-center-tickets-1258689156149",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Appearances",
            "Cambridge Science & Tech Appearances",
            "#sciences",
            "#scientific",
            "#scientist",
            "#science_communication",
            "#science_education",
            "#science_and_technology",
            "#harvardsquare"
        ]
    },
    {
        "title": "Lab Automators: Free Headshots",
        "date_time": "Tuesday, April 29 · 6 - 9pm EDT",
        "location": "Lamplighter Brewing Co. - CX 110 North First Street Cambridge, MA 02141 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/lab-automators-free-headshots-tickets-1321659381789",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Science & Tech Networking",
            "#technology",
            "#collaboration",
            "#automation",
            "#welcome_back",
            "#lab_automators"
        ]
    },
    {
        "title": "MIT Water, Food, & Agriculture Innovation Prize 2025",
        "date_time": "Wednesday, April 30 · 5 - 9pm EDT",
        "location": "MIT Media Lab 75 Amherst Street Cambridge, MA 02139 Show map",
        "about": "MIT Water, Food, & Agriculture Innovation Prize Welcome to the MIT Water, Food, & Agriculture Innovation Prize event! Join us at the MIT Media Lab for an evening filled with groundbreaking ideas and solutions in the fields of water, food, and agriculture. After a dinner mingling with experts, entrepreneurs, and enthusiasts, hear from our innovative startup finalists. Don't miss this opportunity to be part of a community dedicated to driving positive change in these crucial industries. See you there!",
        "event_link": "https://www.eventbrite.com/e/mit-water-food-agriculture-innovation-prize-2025-tickets-1263994544709",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Networking",
            "Cambridge Science & Tech Networking",
            "#food",
            "#innovation",
            "#water",
            "#agriculture",
            "#mit"
        ]
    },
    {
        "title": "AI Community Conference - Boston",
        "date_time": "May 1 · 10am - May 2 · 5pm EDT",
        "location": "Microsoft New England Research and Development Center 1 Memorial Drive Cambridge, MA 02142 Show map",
        "about": "🚀 Exciting Announcement: Join Us for a Cutting-Edge AI Community Event in Boston! 🤖 Are you ready to dive into the thrilling world of Artificial Intelligence (AI)? Look no further! We're thrilled to invite you to a dynamic and engaging community event focused on AI, set to take place right in the heart of Boston. 📅 Pre-Day Workshop: May 1st, 2025 🕒 Time: 10 a.m. EST 🏢 Venue: Microsoft New England Research and Development Center 📅 Main Conference: May 2nd, 2025 🕒 Time: 9 a.m. EST 🏢 Venue: Microsoft New England Research and Development Center Pre-Day Workshop: Hands-On AI Training Kickstart your AI experience with an exclusive pre-day workshops designed for professionals, developers, and enthusiasts looking to gain hands-on experience with AI tools and techniques. Led by industry experts, these interactive sessions cover both low-code / no-code approaches as well as a fully customized approach to building agents. Morning Session: Beyond Chatbots: Building Automous Agents with Copilot Studio Learn to orchestrate multi-step workflows and connect to real-world data with a no-code/low-code approach. Build solutions that think and act independently—way beyond basic bots. Walk away with a working prototype and a framework for deploying agents that make a real impact. Afternoon Session: From Code to Intelligence – Building NextGen AI Agents Understand Agentic AI – Break down the architecture behind intelligent, adaptive AI agents. Orchestrate AI with Semantic-Aware Functions – Use dynamic, context-driven functions to optimize agent orchestration and workflows. Manage Semantic App State – Enable AI systems to retain memory, adapt to interactions, and evolve in real-time. Apply Microsoft Research Insights – Leverage breakthroughs from AutoGen and Magentic-One to build enterprise-grade AI agents. Here's a sneak peek of what's in store at the Main Conference: 🎤 Inspiring Keynote + Speaker Presentations – Gain insights from renowned AI experts as they share their vision for the future of AI and its impact across various industries. 💡 Thought-Provoking Panel Discussions – Engage in discussions on AI ethics, diversity, and the societal implications of AI adoption. Your perspective matters, so join the conversation! 🚀 Sponsor Showcases – Discover groundbreaking AI startups and their innovative solutions shaping the future of technology. 🤝 Networking Opportunities – Connect with like-minded individuals, forge valuable connections, and expand your professional network within the vibrant Boston AI Community. 🎉 Fun and Entertainment – Enjoy live demonstrations, AI-powered activities, and interactive exhibits that promise to entertain and inspire attendees. Don't miss out on this incredible opportunity to immerse yourself in the fascinating world of AI and connect with fellow enthusiasts and experts. Please reserve your spot today and get ready to embark on an unforgettable AI journey with us! Stay tuned for more updates and surprises. We can't wait to welcome you to the AI event of the year in Boston! 🌟 Reach out if you would like to be a Sponsor at this year's conference.",
        "event_link": "https://www.eventbrite.com/e/ai-community-conference-boston-tickets-1274004524829",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#community",
            "#event",
            "#ai",
            "#conference",
            "#newyork"
        ]
    },
    {
        "title": "MedTech Ahead: May 2025",
        "date_time": "Thursday, May 1 · 1 - 5pm EDT",
        "location": "FOLEY HOAG LLP Seaport World Trade Center West 155 Seaport Boulevard Boston, MA MA02210 Show map",
        "about": "Join an exclusive community of MedTech enterprise managers, investors, and startup founders. Enjoy a dynamic afternoon featuring: Panel discussion Innovation Showcase Networking Opportunities 📅 Date : Thursday, May 1, 2025 ⏰ Time : 01:00 PM – 05:00 PM EDT 📍 Location : FOLEY HOAG LLP Seaport World Trade Center West, 155 Seaport Boulevard Boston, Massachusetts 02210 🅿️ Parking: We recommend using public transport or walking to reach the venue. If you arrive by car, there are several options—such as paid parking lots—available near the event for parking. 🖋️ Registration info: We kindly ask all participants to complete their registration by April 29th, 12:00 PM EST , to meet venue security requirements—thank you for your understanding and cooperation!",
        "event_link": "https://www.eventbrite.com/e/medtech-ahead-may-2025-tickets-1301992617969?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#boston",
            "#happyhour",
            "#medtech",
            "#healthtech",
            "#digitalhealth",
            "#digital_health",
            "#healthcare_professionals",
            "#healthtechnology",
            "#healthcare_leadership",
            "#healthcare_technology"
        ]
    },
    {
        "title": "Sartorius Process Intensification Forum",
        "date_time": "June 24 · 12pm - June 26 · 1pm EDT",
        "location": "The Royal Sonesta Boston 40 Edwin H Land Boulevard Cambridge, MA 02142 Show map",
        "about": "Join us at the Sartorius PI Forum from June 24-26, 2025 at the Royal Sonesta Boston, where industry leaders will meet to discuss the latest advancements and future needs in process intensification (PI) for proteins and new modalities. This exclusive event will explore key topics like flexible manufacturing, digitalization, automation, and sustainability — as well as new solutions that are driving more efficient, scalable, and sustainable biomanufacturing. Engage in data-driven presentations, hands-on workshops, and interactive demonstrations to gain valuable insights into cutting-edge technologies and successful PI strategies that are shaping the future of the biopharmaceutical industry.",
        "event_link": "https://www.eventbrite.com/e/sartorius-process-intensification-forum-tickets-1254709442719?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#technology",
            "#event",
            "#forum",
            "#process_intensification",
            "#sartorius"
        ]
    },
    {
        "title": "STEM Enrichment for Young Learners",
        "date_time": "Thursday, May 15 · 8:30 - 11am EDT",
        "location": "Museum of Science 1 Museum Of Science Driveway Boston, MA 02114 Show map",
        "about": "During this workshop, participants will engage with our professional learning team in a hands-on workshop focused on our Youth Engineering Solutions (YES) enrichment curriculum designed for our young (K-2) learners. This 2.5-hour, learner-driven workshop introduces participants to the concepts of engineering through our YES “Engineering Bandages” unit and prepares them to facilitate high-quality STEM activities with students. The workshop will take place from 8:30am-11:00am. A light breakfast will be provided. We will validate parking if you choose to drive to the Museum.",
        "event_link": "https://www.eventbrite.com/e/stem-enrichment-for-young-learners-tickets-1274323950239?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Science & Tech Classes",
            "#hands_on_activities",
            "#young_learners",
            "#learning_opportunities",
            "#stem_enrichment",
            "#innovative_curriculum"
        ]
    },
    {
        "title": "2025 Battery Research Summer School",
        "date_time": "June 3 · 9am - June 6 · 5pm EDT",
        "location": "Science and Technology Center 4 Colby Street Medford, MA 02155 Show map",
        "about": "Battery Research Summer School: A Hands-On Introduction to Battery Science & Engineering Are you an advanced undergraduate or early graduate student interested in batteries, energy storage, and electrochemistry? Want to gain real-world lab skills to set yourself apart in research or industry? Join us for an intensive four-day program that goes beyond traditional lectures. You’ll build and test real batteries , interpret electrochemical data, and develop the troubleshooting skills essential for cutting-edge battery research. Why Attend? ✅ Hands-on Learning – Assemble, cycle, and analyze lithium-ion batteries using safe, non-toxic materials. ✅ Build Practical Intuition – Learn how thermodynamics, transport, and kinetics shape battery performance. ✅ Solve Real-World Problems – Diagnose battery issues, optimize designs, and troubleshoot like a pro. ✅ Learn from Experts – Engage with leading battery researchers in interactive lectures and guest talks. ✅ Get Certified – Earn a certificate of completion and take home valuable learning materials. What You’ll Do 🔹 Set up and cycle Li-ion cells safely and effectively 🔹 Measure capacity, voltage, and performance trade-offs 🔹 Troubleshoot real electrochemical problems 🔹 Explore redox flow batteries through interactive simulations 🔹 Gain hands-on experience without needing a full wet lab Who Should Apply? This program is designed for later-stage undergraduates and early graduate students in engineering, physics, chemistry, and related fields . Whether you're looking to break into battery research or enhance your experimental skills for an internship, this experience will give you a head start in the field .",
        "event_link": "https://www.eventbrite.com/e/2025-battery-research-summer-school-registration-1234043610659?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Medford, MA",
            "Medford Conferences",
            "Medford Science & Tech Conferences",
            "#research",
            "#battery",
            "#electrochemistry"
        ]
    },
    {
        "title": "Gardening in a Changing Climate",
        "date_time": "Wednesday, May 21 · 6 - 7:15pm EDT",
        "location": "Story Chapel Visitor Center Central Ave Watertown, MA 02138 Show map",
        "about": "Every one of us is affected by the changing climate. What do professional and hobby gardeners need to think about when planning and managing our gardens in these conditions? Come hear from Rie Macchiarolo, Director of Gardens & Landscapes talk about some strategies they are working with at Mount Auburn Cemetery. This event will be a 30-minute presentation inside followed by a 45 minute session outside to look at some of the plantings and methods in the landscape. Check-in outside Story Chapel. Capacity: 30 people ... Experience a deeper connection to Mount Auburn Cemetery with free or discounted access to all our public programs and special events by joining the Friends of Mount Auburn . Our robust roster of programs each year is made possible by the generous support of our donors and in part by the Massachusetts Cultural Council . For inquiries about accessibility, to request an accommodation, or if you have any questions about your membership, please contact friends@mountauburn.org .",
        "event_link": "https://www.eventbrite.com/e/gardening-in-a-changing-climate-tickets-1331124642639?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Watertown Town, MA",
            "Watertown Town Seminars",
            "Watertown Town Science & Tech Seminars",
            "#gardening",
            "#sustainability",
            "#climate_change"
        ]
    },
    {
        "title": "Techstars Startup Weekend Boston 2025",
        "date_time": "May 30 · 5pm - June 1 · 8pm EDT.Doors at 4:30pm",
        "location": "120 Tremont St 120 Tremont Street Boston, MA 02108 Show map",
        "about": "✋ Have an idea? Ready to build something incredible? 🌟 Startup Weekend Boston 2025 is here! 🌟 Are you ready to turn an idea into a startup in just 54 hours ? This is your chance to collaborate with brilliant minds, learn from industry mentors, and build the foundation for your next big venture—all in one high-energy weekend! 💡 How It Works : ✅ Friday Night – Pitch your idea (or join another team), form groups, and start brainstorming. ✅ Saturday – Work alongside mentors to develop your product, validate your market, and build your MVP. ✅ Sunday – Finalize your pitch, present to expert judges, and compete for prizes! 🎯 Why Attend? 🚀 Hands-on experience in startup development 🎤 Work with top mentors & investors 🤝 Expand your network with 200+ like-minded innovators 🏆 Get feedback from industry leaders & compete for prizes 📅 Date : May 30 – June 1, 2025 📍 Location : Suffolk University, Boston, MA 🎟 Tickets : Get Yours Here Don’t miss your chance to turn your vision into reality ! Limited spots available—secure your ticket now! 👉 Register Now",
        "event_link": "https://www.eventbrite.com/e/techstars-startup-weekend-boston-2025-tickets-1263184712479?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#networking",
            "#innovation",
            "#entrepreneurship",
            "#pitching"
        ]
    },
    {
        "title": "Workshop: Video Editing with Adobe Premiere",
        "date_time": "Tuesday, May 20 · 6:30 - 9:30pm EDT",
        "location": "Artisans Asylum 96 Holton Street Boston, MA 02135 Show map",
        "about": "Everything you need to know about editing (almost) in one class! This intensive workshop is designed for people who want to learn, or would like a refresher with, Adobe Premiere. No past experience is required. Note: The computer lab has PC computers. You can bring your own laptop to work with if preferred. You can get a 7-day free Adobe Premiere trial here. Prerequisites - Basic computer knowledge. Experience with Adobe programs is a plus but not required. - Have video footage to work with We will cover: - Digital workflow - Timecode - Importing video and audio footage - Video and audio editing techniques, including transitions, and audio levels - Basic titles and exporting video. - Color correction and other video and audio effects will be covered as time permits Outcome Students will leave with either a short finished video and/or a \"rough cut\" of a video which they can finish at home. Bring Digital Files on a Hard Drive - Collect video and copyright free audio files to work with.* - IMPORTANT: Have these files on a PORTABLE HARD DRIVE (portable hard drive or thumb drive). Do NOT plan to download things from your phone or online - do that ahead of time and bring it in on your portable drive . * Note: If you have something specific you want to work on, shoot accordingly and bring in all the files. Otherwise you can just work with a collection of your videos and leave with a draft/test project. Optional but encourage: Readings/screenings with editing strategies and tips about filming for special editing techniques will be sent out ahead of time.",
        "event_link": "https://www.eventbrite.com/e/workshop-video-editing-with-adobe-premiere-tickets-1319500313959?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#workshop",
            "#creative",
            "#learning",
            "#video_editing",
            "#adobe_premiere"
        ]
    },
    {
        "title": "IEEE PES BOSTON CHAPTER'S 2025 ANNUAL BANQUET",
        "date_time": "Tuesday, May 13 · 6 - 9pm EDT",
        "location": "Four Points by Sheraton Boston-Newton 320 Washington St Newton, MA 02458 Show map",
        "about": "IEEE Power and Energy Society - Boston Chapter 2025 ANNUAL BANQUET Featuring a talk from Ben Byboth, Director of Commercial Strategy and Business Development at Commonwealth Fusion Systems (CFS) The Boston Chapter of IEEE PES welcomes you to our yearly celebration of our chapter and it's engineers. We will hear a talk from Ben Byboth from Commonwealth Fusion Systems detailing why fusion energy may be closer than we think! Speaker: Ben Byboth is the head of commercial strategy and business development at Commonwealth Fusion Systems (CFS). With a strong background in the energy sector, he previously held leadership positions at Eversource, Entergy, and NextEra, where he was responsible for launching new energy ventures, leading grid modernization efforts, operating power plants and creating innovative regulatory strategies. Drawing upon his eight years of service as a US Navy submariner, Ben is now focused on driving the commercialization of fusion energy at CFS. Ben earned an MBA from Tulane University and a B.S. in Nuclear Engineering Technologies. Abstract: Fusion Energy : Closer than you think Fusion energy offers the potential for a transformative shift in how we power our world: clean, abundant, and inherently safe. Recent progress in fusion energy research, particularly in areas like high-temperature superconductors, suggests that commercially viable fusion power may be achievable sooner than previously thought. This talk will argue that fusion energy is \"closer than you think\" by showcasing the rapid pace of innovation in fusion research and technology, with a focus on the progress of CFS, the world's largest private fusion company. We'll discuss the potential impact of fusion on addressing climate change and energy security, and outline the key steps needed to bring this game-changing energy source to reality. This presentation will provide an overview of the current state of the fusion industry that is accelerating progress towards net energy gain and sustainable fusion power plants. Includes: Buffet style dinner, cash bar and live jazz from Beacon Street Band Date: Tuesday, May 13, 2025 Time: Pre-dinner drinks at 6:00 pm, program commences at 6:30 pm Location: Four Points by Sheraton Boston Newton 320 Washington Street Newton, MA 02468 Sponsorship opportunities available! Please contact amsa.mangga@eversource.com for more details. Garage Parking: $10 (please bring cash or venmo to the event and buy at check-in from PES volunteers) Registration Details: Price: $70* per member or $80 per non-member, $30 per student, $600 per table of 8 *Please email amivyas@bu.edu with your IEEE PES member number for $10 member discount code **Eventbrite fees are not included. To pay by check instead, please reach out to John.W.Martin@nationalgrid.com Visit IEEE PES Boston Chapter’s website for more details! https://site.ieee.org/boston-pes",
        "event_link": "https://www.eventbrite.com/e/ieee-pes-boston-chapters-2025-annual-banquet-tickets-1325863997909?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Newton, MA",
            "Newton Galas",
            "Newton Science & Tech Galas",
            "#boston",
            "#energy",
            "#engineering",
            "#power",
            "#electricity",
            "#ieee",
            "#renewable_energy"
        ]
    },
    {
        "title": "Healthier Innovation Conference 2025",
        "date_time": "Saturday, June 14 · 12 - 5pm EDT.Doors at 11:30am",
        "location": "MGH Institute of Health Professions 36 1st Avenue Boston, MA 02129 Show map",
        "about": "The Healthier Innovation conference is an exciting event that brings together students passionate about healthcare and technology. Here, we strive to foster collaboration across diverse disciplines, from nursing to tech fields such as software development and AI. Healthier Innovation is dedicated to equipping students with the knowledge and hands-on experience needed to push the boundaries of healthcare data analytics and technological advancement. A key highlight of the conference is the Hackathon, where students can come together to explore real-world healthcare challenges. Participants, along with anyone in the broader field, are invited to submit research abstracts to be published in our indexed proceedings , ensuring their work gains visibility and recognition. The conference will open with expert-led presentations on emerging trends and critical issues in healthcare. These talks will set the stage for the Hackathon, where student teams will tackle specific healthcare challenges, brainstorming, collaborating, and creating prototype solutions. Following their creative development sessions, teams will present their solutions to a panel of judges, who will recognize the top teams for their innovative contributions. First and second place winners will receive awards to honor their outstanding approaches to advancing healthcare solutions. Healthier Innovation will also feature its own journal , open for submissions from all professionals in the field, amplifying the conference’s impact and fostering ongoing contributions to healthcare innovation. Join us in creating a healthier tomorrow through collaboration, creativity, and technology-driven solutions!",
        "event_link": "https://www.eventbrite.com/e/healthier-innovation-conference-2025-tickets-1276236891899?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#innovative_solutions",
            "#wellness_technology",
            "#conference_2025",
            "#future_healthcare",
            "#healthier_innovation"
        ]
    },
    {
        "title": "2025 USTC Alumni Life Science Forum",
        "date_time": "Sunday, June 15 · 8:30am - 5pm EDT",
        "location": "MIT Building 10 Room 250 222 Memorial Drive Cambridge, MA 02139 Show map",
        "about": "Welcome to the 2025 USTC Alumni Life Science Forum! Opportunities in Healthcare Innovation during Global Reorganization The life sciences sector faces unprecedented challenges and opportunities as the world undergoes profound transformations in technology, economy, and policy. With a new U.S. administration in place, shifts in academic institutions, industry regulations, and international collaborations are reshaping the landscape. How can Chinese and U.S. biotech companies, researchers, and entrepreneurs navigate this changing environment? How should we adapt to policy shifts and market fluctuations to drive scientific breakthroughs and industry innovations? On June 15, 2025 , the USTC Alumni Life Science Forum returns to Boston —one of the world's most influential biotech hubs—bringing together top scholars, industry leaders, and investors from around the globe to explore new opportunities and challenges in healthcare innovation. Join us for a day filled with insightful discussions, networking opportunities, and reconnecting with old friends. The event will be held at MIT building 10 Room 250, 222 Memorial Dr , Cambridge 02139 , where experts in the field will share their knowledge and experiences. Don't miss out on this chance to engage with fellow alumni and learn about the latest advancements in life science. Mark your calendars and be a part of this exciting event!",
        "event_link": "https://www.eventbrite.com/e/2025-ustc-alumni-life-science-forum-tickets-1325567180119?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#life",
            "#science",
            "#alumni",
            "#forum",
            "#ustc"
        ]
    },
    {
        "title": "BioTech, Life Sciences & Healthcare Networking Event",
        "date_time": "Wednesday, May 14 · 6 - 8pm EDT",
        "location": "345 Harrison Ave 345 Harrison Avenue Boston, MA 02118 Show map",
        "about": "N/A",
        "event_link": "https://www.eventbrite.com/e/biotech-life-sciences-healthcare-networking-event-tickets-1334920746889?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Networking",
            "Boston Science & Tech Networking",
            "#networking",
            "#biotech",
            "#healthcare",
            "#biotechnology",
            "#lifesciences",
            "#meet_up",
            "#science_and_technology",
            "#stem_education",
            "#nsa_boston"
        ]
    },
    {
        "title": "Harnessing AI for Marketing Innovation | Boston",
        "date_time": "Thursday, May 8 · 10am - 12pm EDT",
        "location": "Boston Online Event Boston, MA 0 Show map",
        "about": "Welcome to Harnessing AI for Marketing Innovation! Are you ready to revolutionize your marketing strategy with the power of AI? In today’s data-driven world, artificial intelligence is transforming the way businesses approach marketing, enabling personalized customer experiences, automation, and advanced analytics. In this workshop, you'll gain practical insights into how AI can enhance your marketing efforts and drive results. Participants will explore AI-driven tools for customer targeting, content personalization, and campaign optimization. You’ll learn how businesses are leveraging AI to streamline processes, improve ROI, and stay ahead of the competition in a fast-evolving digital landscape. Whether you’re a marketing professional or a business owner, this workshop provides the knowledge and strategies to successfully implement AI in your marketing efforts. Join us and discover how AI can take your marketing to the next level! Claim a 5% Discount on this workshop, click here to access! Why Learn About AI for Marketing? Artificial intelligence (AI) is becoming a game-changer for marketers in a rapidly evolving digital landscape. Understanding how to harness AI allows you to personalize customer experiences, automate repetitive tasks, and analyze vast amounts of data to optimize your campaigns for better results. AI-driven marketing enables more precise targeting, greater efficiency, and improved ROI, making it essential for businesses looking to stay competitive. By learning about AI for marketing, you will: 01) Boost Campaign Effectiveness : Use AI to enhance customer targeting, content personalization, and overall campaign performance. 02) Streamline Marketing Operations : Automate repetitive tasks and free up time for more strategic initiatives. 03) Gain Actionable Insights : Analyze customer behaviour and marketing data in real-time to make data-driven decisions that increase ROI. With AI transforming marketing strategies across industries, gaining expertise in this area ensures you stay ahead of the curve and maximize your marketing potential. What You'll Gain from this Workshop 01) AI Tools and Technologies for Marketing Discover the latest AI-driven tools and platforms that are revolutionizing marketing, including automation, predictive analytics, and machine learning. 02) Personalization and Customer Targeting with AI Learn how to use AI to create personalized marketing campaigns that enhance customer engagement and boost conversions. 03) Optimizing Marketing Campaigns Using AI Gain practical insights into how AI can improve campaign performance, streamline processes, and optimize marketing strategies for better ROI. 04) Real-World Case Studies Explore examples of how leading companies are leveraging AI to transform their marketing efforts, inspiring your own business. This workshop equips participants with the tools, strategies, and knowledge to start implementing AI into their marketing strategies for increased efficiency and success. Who Should Attend 01) Marketing Professionals and Strategists Individuals looking to stay ahead of the curve by integrating AI into their marketing efforts to enhance personalization, automation, and analytics. 02) Business Owners and Entrepreneurs Professionals seeking to leverage AI to streamline marketing operations, improve customer engagement, and boost ROI for their business. 03) Digital Marketers and Data Analysts Those interested in learning how AI-driven insights and predictive analytics can optimize their marketing campaigns and improve data-driven decision-making. This workshop is ideal for anyone eager to explore the power of AI to drive innovation and efficiency in their marketing strategies.",
        "event_link": "https://www.eventbrite.com/e/harnessing-ai-for-marketing-innovation-boston-tickets-1048458185657?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#business",
            "#marketing",
            "#technology",
            "#ai",
            "#digital",
            "#artificialintelligence",
            "#martech",
            "#digital_marketing",
            "#artificial_intelligence",
            "#marketing_strategy"
        ]
    },
    {
        "title": "38th Pharmacovigilance USA 2025",
        "date_time": "Wednesday, May 7 · 7 - 10pm EDT",
        "location": "The Inn At Longwood Medical 342 Longwood Avenue Boston, MA 02115 Show map",
        "about": "38th Pharmacovigilance USA 2025 “Ensuring safer drugs to market. Latest developments in PV” 07 th & 8 th May 2025, The Inn at Longwood Medical, Boston, Massachusetts, USA 38th Pharmacovigilance USA 2025 will bring together top pharmaceutical, biotechnology and regulatory, vendor representatives under one roof that will address the key issues of the industry. Get more from the event, with a broader scope bringing the whole communications value chain together. Please contact me for Sponsor / Exhibit / Booth / Delegate at E-mail - kavitha@virtueinsight.co.in or Call - +44 20 3509 3779 SPONSORS: Platinum Sponsor: Arisglobal Gold Sponsors: Cencora, Arisglobal Silver Sponsors: Veeva Systems, HMGlobal Pharmacovigilance Consulting, Biologit Bronze Sponsor: 4c Pharma Solutions, Vitrana Networking & Drink Sponsor - Tepsivo We have more sponsorship opportunities available for the event, which gives you an opportunity to exhibit/booth/speak and create brand awareness. Please email to kavitha@virtueinsight.co.in for more details. DELEGATE REGISTRATION: Registration for this conference through any third party site will involve VAT or TAX. If you would like to register without Tax please register through site https://virtueinsight.com/event/pharmacovigilance-usa-2025/ Standard Price 01 Delegate - $1599 4 Delegates for the price of 2 - $3198 KEY SPEAKERS: · KHAUDEJA BANO, VP - Global Head of Device Quality, Roche - Genentech MARIETTE BOERSTOEL-STREEFLAND, SVP, Worldwide Patient Safety Officer, Bristol-Myers Squibb MILIND SARDESAI, Senior Director, Safety Surveillance, Global Patient Safety, Novo Nordisk NINA KOLA, VP, Head Medical Safety Assessment Hematology and Oncology, Bristol-Myers Squibb VISHNUVARDHAN REDDY PEDDAGALI, VP, Global Head of PV & Risk Management, Sumitomo Pharma ANUJ A PARIKH, Associate Medical Director, Medical Safety, Jazz Pharmaceuticals E. ALTON SARTOR, Medical Director, Patient Safety Physician Digital & Devices, AstraZeneca JESSICA CHINAULT-JALBOOT, Exec Dir, Regulatory and PV Compliance, Jazz Pharmaceuticals KARTHIK MUTHUSAMI, Head of Expedited Safety Reporting, Bristol-Myers Squibb WILLIAM A. BLUMENTALS, Head of Pharmacoepidemiology, Specialty Care, Sanofi SHARON REID, Director of Risk Management Center of Excellence, Pfizer KSHITIJA BAPAT, Dir, Compliance Operations, Jazz Pharmaceuticals VIKALP KHARE, Director, Otsuka Pharmaceutical ABIMBOLA COLE, Scientific Director, Team Lead- GSK Vaccines Safety, GSK RAM VEMPATI, Senior Safety Physician, BioNTech SE BEENA WOOD, Head of Innovation & Technology, CSL Behring MATT DORMARUNNO, Head, Global Safety Sciences, CSL Behring NAMITA JOSHI, Regional PV Head, North America, Sanofi REEM YASIN, Quality Assurance & PV Manager, Kawkab group (Iraq) ABBEY GOW, QA & Deviation Management Expert, Sanofi MANDY GERVASIO, Vice President QA & Compliance, Comanche Biopharma SIVA KUMAR BUDDHA, Director - PV (Head of Signal & Risk Management), Indegene ANKA EHRHARDT, Director, Cell-Based Assays / Analytical Research & Development, Merck JASON BRYANT, VP Data & AI, ArisGlobal KARTHIK BABU, CHC Global PV Operations Head, Sanofi HEATHER MURPHY, Founder and CEO, HMGlobal Pharmacovigilance Consulting NICOLE BAKER, CEO, Biologit YILONG JIA, Sr. Manager Pharmacovigilance Informatics, Sumitomo Pharma America ASHISH JAIN, Sr, Director, Clinical Safety & Pharmacovigilance , Curis MEERA NAGARIA, Senior Data Scientist, Johnson & Johnson KAPIL BHUTADA, Head of PV Safety Operation & Compliance, Asklepios BioPharmaceutical HEATHER LEIGH FLANNERY, CEO & Co-Founder, AI MINDSystems Foundation BEN LOCWIN, VP, Project Solutions, Black Diamond Networks ANKIT LODAYA, Sr. Director, Pharmacovigilance, Bluebird Bio Plus more joining soon FOCUS AREAS: · Market Trends - Critique & Ways Forward · Challenges / Opportunities · Patient Safety / Patient Centricity · Impact of Technology - AI, ML, DA · RMP / REMS · Quality, Safety & Signal Detection · Automation in PV · Regulatory · Audits & Inspection · RWE / RWD · Outsourcing WHO SHOULD ATTEND: CEO’s, CTO’s, CIO’s, Presidents, VPs, Directors, Heads, Managers, Scientific Advisors, Consultants of: Pharmacovigilance, Pharmacoepidemiology, Pharmacogenomics, Drug/Product Safety, Drug Development, Information and Clinical Data Management, Clinical Pharmacology, Clinical Safety, Periodical safety update Reports, Risk Management, Research & Development, Quality Assurance, Patient Safety, Signal Detection, Safety Surveillance, Outcomes Research, Data Analysis, Epidemiology, Medical Affairs, Regulatory Affairs and Compliance, Information technology, Sales and Marketing. Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, and meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies at the high-levelconference.",
        "event_link": "https://www.eventbrite.com/e/38th-pharmacovigilance-usa-2025-tickets-1260483563269?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#event",
            "#conference",
            "#usa",
            "#pharmacovigilance",
            "#2025"
        ]
    },
    {
        "title": "Plankton Painting",
        "date_time": "Saturday, May 10 · 1 - 3:30pm EDT",
        "location": "Artisan's Asylum 96 Holton Street Boston, MA 02135 Show map",
        "about": "Instructor - Jess Holz Jess Holz (b. 1985) creates artworks which give the viewer a peek into invisible worlds, as well as a chance to reflect on the influence of scientific visual culture on our collective imagination. She received an MFA in Art+Technology at the University of Wisconsin-Milwaukee; and has worked in several labs and imaging facilities, gaining valuable technical experience with a number of microscopic imaging techniques. She currently works as an electron microscopy research fellow at a Boston University lab which investigates the neural circuitry underlying thought and emotion. The discrepancy between what can be perceived by eye and what is imaged by the microscope has fostered her fascination with perceptual systems along with the optical properties of materials. Jess actively exploits this in photography and installation. Class Description Taught by artist/scientist Jess Holz, this experimental photography workshop explores and celebrates plankton biodiversity through hands-on interactive ‘Plankton Painting’ or chronophotography of plankton (pond critters) collected from local waterways such as Chandler Pond and Boston Harbor, in which you will use a microscope along with special software Jess wrote to create beautiful artworks of plankton motion and behavior as they swim on the microscope slide. Chronophotography visualizes dynamic behaviors and strange movements, such as the helical paths of flagellates and the microscopic water currents rotifers generate when they filter feed. Jess considers these images like automatic drawings or paintings, the plankton create the marks and composition, all happening at the millimeter scale. This workshop primarily uses darkfield and fluorescence microscopy, but participants also get to play with other advanced microscopy techniques using Jess’ high-end Leica DMRB microscope equipped with a number of advanced upgrades. Students will leave the class with a print of their favorite ‘painting,’ all photos from the class will be uploaded to: https://www.flickr.com/photos/planktonpainting Material Fee The materials fee for this class is $10. This is separate from the ticket price and is to reimburse the instructor for any tools or materials used in this class. This will be paid once, directly to the instructor at the start of the first class meeting. This instructor accepts payments in cash or through Venmo or PayPal. Class Goals - Make visible what exactly lives in our local waterways—the vibrant and dynamic life we cannot see. - Instruction and introduction to basic plankton identification and ecology. - Knowledge of the distinct forms of life between different nearby ponds, as well as contrasting the composition of plankton in marine water vs. pond water. - Students will learn fascinating facts about plankton behavior and gain an intimate knowledge of how they move using this unique timelapse technique. - Students will learn tips for composing photos using chronophotography, and may inquire with Jess about using her software with their own microscope. Material Supplied Materials fee includes one sheet of Hahnemuhle photo rag metallic archival inkjet paper for a print of your favorite photo taken during the class. Jess will provide water samples collected from Boston Harbor and Chandler pond. Students Should Bring Pen/paper/notebook for taking notes. You are welcome to bring your own water samples, but it is not guaranteed we will have time to look at them. Prerequisites Students must be 13 years or older, all students under 18 years old must be accompanied by and under the direct supervision of an adult. Class Policies Learn more about our class and ticket cancelation policies Here . Please email education@artisansasylum.com with any questions.",
        "event_link": "https://www.eventbrite.com/e/plankton-painting-tickets-1284437560319?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#biology",
            "#makerspace",
            "#microscopy",
            "#science_and_art",
            "#makerspace_classes"
        ]
    },
    {
        "title": "Generative AI for Society and Workplace | Boston",
        "date_time": "Thursday, May 1 · 10am - 12pm EDT",
        "location": "Boston Online Event Boston, MA 0 Show map",
        "about": "Welcome to Generative AI for Society and Workplace! Dive into the transformative world of Generative AI with this workshop, designed to empower professionals to harness the latest AI technologies for both societal and workplace innovation. Through a series of engaging modules, participants will explore foundational concepts, and advanced applications, with real-world use cases. This workshop will provide the tools and knowledge needed to effectively integrate Generative AI into various business processes, navigate ethical considerations, and lead AI-driven initiatives. Join us to become a pivotal force in shaping the future of your industry with Generative AI. Claim a 5% Discount on this workshop, click here to access! Why Learn About Generative AI Generative AI stands at the forefront of technological innovation, reshaping industries by enabling new ways to create content, automate processes, and analyze data. This knowledge empowers professionals to lead in the adoption of cutting-edge tools that enhance decision-making and operational efficiency, prepare for future challenges, and drive sustainable growth in an increasingly AI-integrated world. 01) Innovation and Creativity Generative AI opens new avenues for creativity and innovation, allowing for the generation of novel ideas, designs, and solutions that can transform industries. 02) Efficiency and Automation It significantly enhances efficiency, automating routine tasks and analyzing complex data sets quickly, freeing up human resources for more strategic activities. 03) Competitive Advantage Understanding and implementing Generative AI technologies provides a significant competitive edge, helping organizations stay ahead in a rapidly evolving digital landscape. What You'll Gain from this Workshop 01) Comprehensive Skill Development Develop a deep understanding of Generative AI, mastering foundational concepts, and advanced applications to implement AI solutions effectively in their organizations. 02) Practical Application and Automation Strategies Gain practical insights and experience through real-world use cases and exercises, learning to integrate Generative AI into business processes to boost efficiency and drive innovation. 03) Ethical Understanding and Risk Management Explore AI's ethical implications, understand potential risks, and learn strategies for responsible deployment to meet industry standards. 04) Leadership and Innovation Preparation Learn how to lead AI-driven projects and foster innovation within their teams, positioning themselves as forward-thinking leaders in their respective fields. Who Should Attend 01) Business Leaders & Executives Senior professionals exploring strategic AI integrations for operational and competitive advancements. 02) HR Professionals and Policy Makers Ideal for those keen to navigate the ethical, regulatory, and workforce challenges presented by AI technologies. 03) Innovators and Technologists Entrepreneurs and tech enthusiasts seeking to leverage AI for new business solutions and societal impact.",
        "event_link": "https://www.eventbrite.com/e/generative-ai-for-society-and-workplace-boston-tickets-1137743343969?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#business",
            "#technology",
            "#innovation",
            "#ai",
            "#artificialintelligence",
            "#aibootcamp",
            "#artificial_intelligence",
            "#ai_training",
            "#generative_ai",
            "#generativeai"
        ]
    },
    {
        "title": "Boston Area Robotics Fiasco (BARF)",
        "date_time": "Sunday, July 13 · 11am - 5pm EDT",
        "location": "Artisan's Asylum 96 Holton Street Boston, MA 02135 Show map",
        "about": "Who: Robot Enthusiasts, BattleBots Competitors, RC Hobbyists, & You What: A non-combat, double-elimination tournament of Capture the Cubes. Randomly paired teams of two will test their robots in five-minute matches. Each robot may weigh up to 3lbs. Refer to Capture The Cube Rules 2.0 for further explanation of the rules. Where: Artisan’s Asylum When: Date: Sunday, July 13th, 2024 Time: 11 AM - 5 PM Why: Because it’s fun! *Competitor registration ends November 30th. Note For Competitors: After registration closes, we will send you an email requesting the following: Do you have a teammate in mind? If so, what is their or their robot's name? If you are an inexperienced bot builder, do you want to be paired with a Mentor? If you are an experienced bot builder and want to help show someone the ropes, do you want to be a Mentor? If so, you will be entered into our mentorship pairing pool. *If you want to compete but don’t have a teammate and don’t want to be a Mentor or Mentee, a teammate will be randomly selected for you. Check out videos from last season's BARF Here Please click the following link for the New Builders Guide. https://docs.google.com/document/d/1eIxehOBmTmB__IW6fhkVHnKgeFyU6suDXebZhSPjJEs/edit?usp=sharing",
        "event_link": "https://www.eventbrite.com/e/boston-area-robotics-fiasco-barf-tickets-1321551308539?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Games",
            "Boston Science & Tech Games",
            "#boston",
            "#programming",
            "#robotics",
            "#robots",
            "#makerspace",
            "#fiasco",
            "#battlebots",
            "#boston_events",
            "#maker_space",
            "#robotics_education"
        ]
    },
    {
        "title": "Sartorius Process Intensification Forum",
        "date_time": "June 24 · 12pm - June 26 · 1pm EDT",
        "location": "The Royal Sonesta Boston 40 Edwin H Land Boulevard Cambridge, MA 02142 Show map",
        "about": "Join us at the Sartorius PI Forum from June 24-26, 2025 at the Royal Sonesta Boston, where industry leaders will meet to discuss the latest advancements and future needs in process intensification (PI) for proteins and new modalities. This exclusive event will explore key topics like flexible manufacturing, digitalization, automation, and sustainability — as well as new solutions that are driving more efficient, scalable, and sustainable biomanufacturing. Engage in data-driven presentations, hands-on workshops, and interactive demonstrations to gain valuable insights into cutting-edge technologies and successful PI strategies that are shaping the future of the biopharmaceutical industry.",
        "event_link": "https://www.eventbrite.com/e/sartorius-process-intensification-forum-tickets-1254709442719",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Conferences",
            "Cambridge Science & Tech Conferences",
            "#technology",
            "#event",
            "#forum",
            "#process_intensification",
            "#sartorius"
        ]
    },
    {
        "title": "STEM Enrichment for Young Learners",
        "date_time": "Thursday, May 15 · 8:30 - 11am EDT",
        "location": "Museum of Science 1 Museum Of Science Driveway Boston, MA 02114 Show map",
        "about": "During this workshop, participants will engage with our professional learning team in a hands-on workshop focused on our Youth Engineering Solutions (YES) enrichment curriculum designed for our young (K-2) learners. This 2.5-hour, learner-driven workshop introduces participants to the concepts of engineering through our YES “Engineering Bandages” unit and prepares them to facilitate high-quality STEM activities with students. The workshop will take place from 8:30am-11:00am. A light breakfast will be provided. We will validate parking if you choose to drive to the Museum.",
        "event_link": "https://www.eventbrite.com/e/stem-enrichment-for-young-learners-tickets-1274323950239",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Science & Tech Classes",
            "#hands_on_activities",
            "#young_learners",
            "#learning_opportunities",
            "#stem_enrichment",
            "#innovative_curriculum"
        ]
    },
    {
        "title": "2025 Battery Research Summer School",
        "date_time": "June 3 · 9am - June 6 · 5pm EDT",
        "location": "Science and Technology Center 4 Colby Street Medford, MA 02155 Show map",
        "about": "Battery Research Summer School: A Hands-On Introduction to Battery Science & Engineering Are you an advanced undergraduate or early graduate student interested in batteries, energy storage, and electrochemistry? Want to gain real-world lab skills to set yourself apart in research or industry? Join us for an intensive four-day program that goes beyond traditional lectures. You’ll build and test real batteries , interpret electrochemical data, and develop the troubleshooting skills essential for cutting-edge battery research. Why Attend? ✅ Hands-on Learning – Assemble, cycle, and analyze lithium-ion batteries using safe, non-toxic materials. ✅ Build Practical Intuition – Learn how thermodynamics, transport, and kinetics shape battery performance. ✅ Solve Real-World Problems – Diagnose battery issues, optimize designs, and troubleshoot like a pro. ✅ Learn from Experts – Engage with leading battery researchers in interactive lectures and guest talks. ✅ Get Certified – Earn a certificate of completion and take home valuable learning materials. What You’ll Do 🔹 Set up and cycle Li-ion cells safely and effectively 🔹 Measure capacity, voltage, and performance trade-offs 🔹 Troubleshoot real electrochemical problems 🔹 Explore redox flow batteries through interactive simulations 🔹 Gain hands-on experience without needing a full wet lab Who Should Apply? This program is designed for later-stage undergraduates and early graduate students in engineering, physics, chemistry, and related fields . Whether you're looking to break into battery research or enhance your experimental skills for an internship, this experience will give you a head start in the field .",
        "event_link": "https://www.eventbrite.com/e/2025-battery-research-summer-school-registration-1234043610659",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Medford, MA",
            "Medford Conferences",
            "Medford Science & Tech Conferences",
            "#research",
            "#battery",
            "#electrochemistry"
        ]
    },
    {
        "title": "Generative AI for Society and Workplace | Boston",
        "date_time": "Thursday, May 1 · 10am - 12pm EDT",
        "location": "Boston Online Event Boston, MA 0 Show map",
        "about": "Welcome to Generative AI for Society and Workplace! Dive into the transformative world of Generative AI with this workshop, designed to empower professionals to harness the latest AI technologies for both societal and workplace innovation. Through a series of engaging modules, participants will explore foundational concepts, and advanced applications, with real-world use cases. This workshop will provide the tools and knowledge needed to effectively integrate Generative AI into various business processes, navigate ethical considerations, and lead AI-driven initiatives. Join us to become a pivotal force in shaping the future of your industry with Generative AI. Claim a 5% Discount on this workshop, click here to access! Why Learn About Generative AI Generative AI stands at the forefront of technological innovation, reshaping industries by enabling new ways to create content, automate processes, and analyze data. This knowledge empowers professionals to lead in the adoption of cutting-edge tools that enhance decision-making and operational efficiency, prepare for future challenges, and drive sustainable growth in an increasingly AI-integrated world. 01) Innovation and Creativity Generative AI opens new avenues for creativity and innovation, allowing for the generation of novel ideas, designs, and solutions that can transform industries. 02) Efficiency and Automation It significantly enhances efficiency, automating routine tasks and analyzing complex data sets quickly, freeing up human resources for more strategic activities. 03) Competitive Advantage Understanding and implementing Generative AI technologies provides a significant competitive edge, helping organizations stay ahead in a rapidly evolving digital landscape. What You'll Gain from this Workshop 01) Comprehensive Skill Development Develop a deep understanding of Generative AI, mastering foundational concepts, and advanced applications to implement AI solutions effectively in their organizations. 02) Practical Application and Automation Strategies Gain practical insights and experience through real-world use cases and exercises, learning to integrate Generative AI into business processes to boost efficiency and drive innovation. 03) Ethical Understanding and Risk Management Explore AI's ethical implications, understand potential risks, and learn strategies for responsible deployment to meet industry standards. 04) Leadership and Innovation Preparation Learn how to lead AI-driven projects and foster innovation within their teams, positioning themselves as forward-thinking leaders in their respective fields. Who Should Attend 01) Business Leaders & Executives Senior professionals exploring strategic AI integrations for operational and competitive advancements. 02) HR Professionals and Policy Makers Ideal for those keen to navigate the ethical, regulatory, and workforce challenges presented by AI technologies. 03) Innovators and Technologists Entrepreneurs and tech enthusiasts seeking to leverage AI for new business solutions and societal impact.",
        "event_link": "https://www.eventbrite.com/e/generative-ai-for-society-and-workplace-boston-tickets-1137743343969",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#business",
            "#technology",
            "#innovation",
            "#ai",
            "#artificialintelligence",
            "#aibootcamp",
            "#artificial_intelligence",
            "#ai_training",
            "#generative_ai",
            "#generativeai"
        ]
    },
    {
        "title": "MedTech Ahead: May 2025",
        "date_time": "Thursday, May 1 · 1 - 5pm EDT",
        "location": "FOLEY HOAG LLP Seaport World Trade Center West 155 Seaport Boulevard Boston, MA MA02210 Show map",
        "about": "Join an exclusive community of MedTech enterprise managers, investors, and startup founders. Enjoy a dynamic afternoon featuring: Panel discussion Innovation Showcase Networking Opportunities 📅 Date : Thursday, May 1, 2025 ⏰ Time : 01:00 PM – 05:00 PM EDT 📍 Location : FOLEY HOAG LLP Seaport World Trade Center West, 155 Seaport Boulevard Boston, Massachusetts 02210 🅿️ Parking: We recommend using public transport or walking to reach the venue. If you arrive by car, there are several options—such as paid parking lots—available near the event for parking. 🖋️ Registration info: We kindly ask all participants to complete their registration by April 29th, 12:00 PM EST , to meet venue security requirements—thank you for your understanding and cooperation!",
        "event_link": "https://www.eventbrite.com/e/medtech-ahead-may-2025-tickets-1301992617969",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Conferences",
            "Boston Science & Tech Conferences",
            "#boston",
            "#happyhour",
            "#medtech",
            "#healthtech",
            "#digitalhealth",
            "#digital_health",
            "#healthcare_professionals",
            "#healthtechnology",
            "#healthcare_leadership",
            "#healthcare_technology"
        ]
    },
    {
        "title": "Leveraging Robotics for Success | Boston",
        "date_time": "Thursday, May 15 · 10am - 12pm EDT",
        "location": "Boston Online Event Boston, MA 0 Show map",
        "about": "Welcome to Leveraging Robotics for Success! Are you ready to leverage robotics for success in your business? Unlock the transformative potential of robotics by diving into cutting-edge technologies, real-world applications, and the profound impact robotics has across industries. In this workshop, Leveraging Robotics for Success , you'll gain practical insights into how robotics revolutionises workflows, improves efficiency, and drives innovation in both industrial and service sectors. Participants will explore the fundamentals of robotics, from automation and machine learning integration to the design of autonomous systems. Real-world case studies will demonstrate how businesses have successfully leveraged robotics to enhance productivity, streamline operations, and gain a competitive edge in the market. Join us to discover how robotics can open new doors for your career or business! Claim a 5% Discount on this workshop, click here to access! Why Learn About Robotics In an era where automation and intelligent systems are becoming essential across industries, understanding robotics is no longer a luxury—it’s a necessity. Robotics knowledge empowers you to stay competitive and foster innovation, equipping you with the skills needed to harness its capabilities for optimizing processes, reducing operational costs, and enhancing productivity. Learning about robotics positions you at the forefront of technological advancements, making you a valuable asset in any organization. Whether you're aiming to advance your career or drive your business forward, expertise in robotics opens up a world of opportunities in today's increasingly automated landscape. 01) Drive Innovation and Efficiency Leverage robotics to create groundbreaking solutions, automate complex tasks, and streamline workflows with precision. Robotics enhances both creativity and operational productivity, reducing errors and optimizing business processes. 02) Boost Productivity and Accuracy Robotics enables you to perform tasks with unparalleled speed and accuracy, minimizing inefficiencies, reducing costs, and improving overall workflow precision. It is a key tool for enhancing operational performance. 03) Gain a Competitive Edge Mastering robotics not only positions you ahead of the curve in automation-driven industries but also makes you a valuable asset in any organization. With robotics expertise, you gain strategic advantage and unlock new career opportunities in a rapidly evolving market. What You'll Gain from this Workshop 01) Comprehensive Understanding of Robotics Acquire in-depth knowledge of robotics fundamentals and explore how this technology is transforming industries through automation and innovation. 02) Hands-On Experience Participate in interactive sessions focused on real-world robotics applications, enabling you to build practical skills in automation and robotics technologies. 03) Strategic Implementation Learn actionable strategies for incorporating robotics into your business processes, driving efficiency, innovation, and significant cost savings. 04) Optimized Operations Develop the ability to leverage robotics for streamlined operations, enhanced precision, and smarter decision-making within your organization. Who Should Attend 01) Business Leaders and Executives Professionals looking to integrate cutting-edge robotics technology to drive efficiency, innovation, and growth within their organizations. 02) Entrepreneurs & Innovators Individuals seeking to explore new opportunities in automation and robotics to gain a competitive edge and scale their ventures. 03) Operations and Technology Managers Those responsible for streamlining processes and optimizing workflows and want to leverage robotics to enhance productivity and decision-making.",
        "event_link": "https://www.eventbrite.com/e/leveraging-robotics-for-success-boston-tickets-1047742846057?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#business",
            "#ai"
        ]
    },
    {
        "title": "STEM Leader Institute: Bringing Engineering to Elementary Classrooms",
        "date_time": "July 15 · 8:30am - July 16 · 3:30pm EDT",
        "location": "Museum of Science 1 Museum Of Science Driveway Boston, MA 02114 Show map",
        "about": "Get ready to inspire your students and fellow educators with this interactive workshop designed for elementary STEM Leaders and educators. Not only will you engage in the Engineering Nightlights (Grade 1) and Engineering Magnetic Dog Doors (Grade 3) units, but you’ll also gain the tools and confidence to facilitate your own professional learning workshop and support colleagues using the YES curriculum. This workshop goes beyond learning the curriculum. You’ll gain the skills and resources to lead professional learning workshops of your own. We’ll provide you with facilitation tips, strategies, and support to confidently share these units and engineering learning frameworks with other educators. Who Should Attend? This workshop is perfect for elementary educators looking to enhance their STEM teaching and expand their role as a leader within their school or district. It is also perfect for STEM Leaders, Coaches, Administrators, and more, who are looking to train their educators on the YES and EiE curriculum. Breakfast and lunch are included in the registration fee and will be provided for all 2 days of the workshop. Special Offer for MA Educators: Enjoy discounted registration and FREE Engineering & Computer Science Kits after the workshop! (Use promo code: MAEducator) Do you also teach middle school students or engage with middle school educators? Make your trip to the Museum of Science worthwhile and stay for one more day of learning! On July 17, immediately following this STEM Leader Institute, join us for a one-day workshop, Engineering Eco-Friendly Slippers in Middle School. Learn more and register here .",
        "event_link": "https://www.eventbrite.com/e/stem-leader-institute-bringing-engineering-to-elementary-classrooms-tickets-1082411194019?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Science & Tech Classes",
            "#education",
            "#innovation",
            "#engineering",
            "#stem_leader_institute",
            "#pk_8"
        ]
    },
    {
        "title": "AI Implementation in Business | Boston",
        "date_time": "Thursday, May 22 · 10am - 12pm EDT",
        "location": "Boston Online Event Boston, MA 0 Show map",
        "about": "Welcome to AI Implementation in Business! Are you curious about how artificial intelligence can revolutionize your business operations? In today’s rapidly evolving digital landscape, businesses that harness the power of AI are leading the way in innovation, efficiency, and growth. This workshop is designed to give you the tools and insights to integrate AI into your business strategy, transforming how you operate and make decisions. Whether you’re looking to stay ahead of the competition or explore the full potential of AI, this training will help you take that crucial next step. Whether you're a small startup or a large corporation, this event is perfect for anyone looking to stay ahead in the digital age. Don't miss out on this opportunity to learn from the best in the field! Why Learn About AI In a world where technology is rapidly advancing, understanding AI is crucial for staying competitive and driving innovation. Learning about AI equips you with the knowledge to leverage its capabilities effectively, making you a valuable asset in any organization. 01) Drive Innovation AI opens doors to new possibilities, enabling you to create innovative solutions and improve existing processes. 02) Enhance Decision-Making By analyzing data more efficiently, AI provides valuable insights that lead to better, data-driven decisions. 03) Gain a Competitive Edge Mastering AI technology positions you ahead of the curve, giving you an advantage in a technology-driven market. What You'll Gain from this Workshop 01) In-Depth Knowledge Understand the core concepts of AI and its strategic importance in modern business. 02) Hands-On Experience Acquire practical skills through interactive sessions and real-world AI applications. 03) Strategic Integration Learn how to effectively integrate AI into your business strategy to drive growth and innovation. 04) Enhanced Decision-Making Develop the ability to leverage AI for improved data analysis and informed decision-making Who Should Attend 01) Business Leaders & Managers Those seeking to understand how AI can optimize operations and drive strategic growth 02) Entrepreneurs & Innovators Individuals looking to leverage AI for innovative solutions in startups or small businesses 03) Technology Enthusiasts Individuals eager to explore AI’s potential and its transformative impact across different sectors.",
        "event_link": "https://www.eventbrite.com/e/ai-implementation-in-business-boston-tickets-1026632865537?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#business",
            "#technology",
            "#ai",
            "#artificialintelligence",
            "#aibootcamp",
            "#artificial_intelligence",
            "#technology_innovation",
            "#ai_training",
            "#ai_for_business"
        ]
    },
    {
        "title": "Salesforce Platform App Builder Certification Training in Boston, MA",
        "date_time": "Wednesday, May 28 · 9am - 5pm EDT",
        "location": "Boston, MA Regus Business Center Boston, MA 02111 Show map",
        "about": "The Salesforce Platform App Builder credential is designed for individuals who would like to demonstrate their skills and knowledge in designing, building, and deploying custom applications using the declarative customization capabilities of the Lightning Platform. The candidate can create, manage, and update data models, application security, business logic, and process automation. Here are some examples of the concepts you will understand Design the data model, user interface, business logic, and security for custom applications Customize applications for mobile use Design reports and dashboards Deploy custom applications Key Features: 24 hours of Interactive Classroom/Online Instructor-led training Group Activities for better reinforcement Real-world examples from various industries Industry-based case studies Trainers’ Notes, Sample Question Paper & Case Studies 24/7 customer support What you'll learn Understand all of the core concepts on the Platform App Builder Comprehensive understanding of the principles and functionalities of Salesforce. Master Salesforce's security measures and automation tools to build robust CRM solutions. Learn to create dynamic and user-friendly interfaces effortlessly using the Lightning App Builder. Develop skills in creating detailed reports and dynamic dashboards and executing seamless Salesforce deployments. Create Workflow Automation Procedures in Salesforce Customize the Salesforce Mobile App User Interface, Navigation, and Actions Create Permission Sets Requirements No prior experience is expected or required It is ideal if you have some familiarity and background in the Salesforce platform, but it is not mandatory No coding experience required Who should attend App Builders System Administrators Developers IT Managers Product Managers Sales Representatives Topics: What is Cloud Computing Service and Deployment models in the Cloud Market situation Cloud Ownership Introduction to SF1 and Force.com Platform Declarative & Programmatic Options in Force.com Meta-data Driven Architecture Multi-tenant Architecture Business and IT benefits Use of SF1 Why global corporates prefer Learning Zone Inc. as their training partner An Enterprise Learning Solutions (ELS) provider, Learning Zone Inc. creates industry-fit talents through training, coaching, and consulting by globally acclaimed trainers. Much of Learning Zone’s repute in co-creating business value stems from: Training delivered in 45+ countries. 250+ industry-relevant courses. Customized course curriculum as per your team's specific needs Consulting and coaching to transform organizations. Trainers with experience in Retail, E-commerce, Energy & Utilities, etc. Best value for time & money invested. Get trained at the best fee compared to other vendors Discounted fee offered for five or more attendees *We provide corporate training at your preferred locations and dates at no additional charge. Contact us for more information: Name: Debbie Riel Email: debbie.riel@learninzone.com Phone: +1 (302) 251-9769",
        "event_link": "https://www.eventbrite.com/e/salesforce-platform-app-builder-certification-training-in-boston-ma-tickets-1320597545809?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#salesforce_app_builder",
            "#learningzone_salesforce",
            "#salesforce_platform_class",
            "#salesforce_online_event",
            "#app_salesforce_classroom",
            "#salesforce_live_training",
            "#salesforce_exam_course",
            "#salesforce_certifi_onsite",
            "#salesforce_cloud_training",
            "#lightning_salesforce_prep"
        ]
    },
    {
        "title": "Vibe Coding for Fun & Profit",
        "date_time": "Friday, May 30 · 5 - 7pm EDT",
        "location": "Staples Studio Boston 1 Washington Mall Boston, MA 02108 Show map",
        "about": "Why Learn Vibe Coding? Whether you want to launch your first portfolio site, start a business, build a sass, or simply learn a valuable skill, AI-assisted software development (aka vibe coding) can help you build faster, smarter, and more effectively. This course is perfect for beginners curious about coding, entrepreneurs, or creatives looking to expand their toolkit. Small Group Experience, Social, and Supportive Work with a passionate technologist and creative guide in a collaborative group. Share ideas, learn from each other, and enjoy the journey as you bring your website to life. About the Instructor Casey Armstrong, former Curriculum Manager at XR Terra (an AR & VR developer bootcamp), is a VR developer and technical writer with a deep passion for teaching and making emerging technologies accessible. Casey specializes in breaking down complex concepts and guiding learners toward creative and professional success.",
        "event_link": "https://www.eventbrite.com/e/vibe-coding-for-fun-profit-tickets-1305694119259?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#technology",
            "#fun",
            "#event",
            "#ai",
            "#coding",
            "#profit",
            "#vibe",
            "#vibe_coding"
        ]
    },
    {
        "title": "InnoXpo BIO Roadshow 2025: Global Pharma Licensing Forum & Networking",
        "date_time": "Sunday, June 15 · 1 - 7pm EDT",
        "location": "The Engine 750 Main Street Cambridge, MA 02139 Show map",
        "about": "InnoXpo BIO Roadshow 2025: Global Pharma Licensing Forum & Networking 📅 Date & Time: June 15th, 2025, 1-7 PM, EST 📍 Venue: The Engine, 750 Main St, Cambridge, MA About the Event: Hosted by bioSeedin, the InnoXpo BIO Roadshow 2025 will connect global biopharma leaders to discuss licensing trends and showcase innovative companies in oncology, autoimmune, metabolic disorders, CNS, and more. The event features panel discussions, roadshow presentations, and a networking dinner. Agenda Highlights: Panel Discussion: Global Licensing Trends Roadshow Presentations: Featuring novel mechanisms, BIC potential, bsADC, RDC, small molecules (PCC to Phase 1/2). Networking Dinner: Connect with industry leaders and innovators. Why Attend? This exclusive event offers a unique opportunity to explore licensing opportunities , form partnerships , and gain insights into the future of drug development . Don’t miss out on connecting with leading experts and exploring innovative assets from China's rapidly growing biopharma sector. Meet the Esteemed Judges of InnoXpo BIO Roadshow 2025: Nicola La Monica, PhD Senior Director, Strategic Search & Evaluation Johnson & Johnson Al exandria (Alex) Cogdill, MEng, PhD Head of Strategic Initiatives, Global Business Development Daiichi Sankyo Dan Zheng Senior Director, Oncology Business Development Takeda | Center for External Innovation *Biopharma BD/C-level executives and investors can register for free! Click this link to get the free pass : https://www.bioseedin.com/conference-detail?id=35",
        "event_link": "https://www.eventbrite.com/e/innoxpo-bio-roadshow-2025-global-pharma-licensing-forum-networking-tickets-1291018333589?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Expos",
            "Cambridge Science & Tech Expos",
            "#networking",
            "#2025",
            "#innexpo_bio_roadshow",
            "#global_pharma",
            "#licensing_forum"
        ]
    },
    {
        "title": "Engineering Eco-Friendly Slippers in Middle School",
        "date_time": "Thursday, July 17 · 8:30am - 3:30pm EDT",
        "location": "Museum of Science 1 Museum Of Science Driveway Boston, MA 02114 Show map",
        "about": "Join us for an interactive workshop designed for middle school educators interested in incorporating engineering and computer science into their classrooms. Gain insights into integrating engineering and computational thinking to create cross-disciplinary learning experiences. This workshop focuses on YES’s middle school unit, Engineering Eco-Friendly Slippers, which challenges learners to design sustainable slippers using eco-friendly materials. Learn how to guide your students through the engineering design process to address real-world environmental issues. You will also experience one of the companion computer science modules using MATLAB, powered by MathWorks, User Reviews. This module asks students to analyze user review data to improve their designs and consider how to increase computer accuracy. Learn how these modules deepen learners’ understanding of not only engineering, but also the real-world impacts of designed solutions. Special Offer for MA Educators: Enjoy discounted registration and FREE Engineering & Computer Science Kits after the workshop! (Use promo code: MAEducator)",
        "event_link": "https://www.eventbrite.com/e/engineering-eco-friendly-slippers-in-middle-school-tickets-1242024702319?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Science & Tech Classes",
            "#innovation",
            "#engineering",
            "#slippers",
            "#eco_friendly",
            "#middle_school"
        ]
    },
    {
        "title": "Metaverse 101 | Boston",
        "date_time": "Friday, May 2 · 10am - 12pm EDT",
        "location": "Boston Online Event Boston, MA 02112 Show map",
        "about": "Blockchain Smart Solutions offers a 2-hours webinar on the latest hype in the crypto space - Metaverse. The workshop is an opportunity to introduce yourself to the concept of Metaverse in the decentralized world. Find out why it's being called the 'Next-big-thing', what is the potential of the digital world and how it can potentially shape the future. Would you like a 5% discount on this training? Click here to get the discount code. Learning Objectives: Understand the basics of the Metaverse in decentralized and centralized environments. Discover Use Cases applied to various industries. Explore a few real-world projects. Identify and understand the near-future trends in this space. Agenda: Understand the basics of the Metaverse Metaverse in decentralized and centralized environments. Crypto coins/tokens and Metaverse. Discover Metaverse Use Cases applied to various industries. What is next in Metaverse space? Explore a few real-world projects. Investments in Metaverse. Real world projects. Questions & Answers Prerequisite: No prior knowledge of blockchain or metaverse is required. Who can participate: Anyone with an interest in virtual reality, cryptocurrencies, or an appreciation of technology evolution. By the end of this course, you will have: Sound understanding of various aspects of this growing technology. Ability to make informed decisions about choosing your next investment opportunities in metaverse space. Certificate of attainment. Note: Subject to Terms & Conditions. Individual pricing only, for corporates, please contact us via our website or drop an email at contact@blocksmartsol.com. If you are looking for alternate payment options, please contact us via our website or drop an email at contact@blocksmartsol.com. Any advice or suggestion shared during the workshop is not financial advice. You should consider your circumstances before making an investment. Trading digital currencies is a high-risk investment, and due consideration should be taken before making any investment decision. It will be a live online event. The link will be shared after you register for the event. FAQs What can I bring to the event? A curious mind. :) How can I contact the organiser with any questions? You can contact us via our website or drop an email at contact@blocksmartsol.com Will I get any documents for attending this workshop? Yes. You will receive a BSS attainment certificate after the workshop. Is the certificate shareable on social media (e.g. LinkedIn)? Yes. It is a digital certificate and you can share it with your peers/colleagues via social media (e.g. LinkedIn). Is there any group discount? Yes. Please reach out via our website or drop an email at contact@blocksmartsol.com What's the refund policy? Upto 2 weeks before the event. Please contact us in case you need to make any changes. Do I have to bring my printed ticket to the event? No need. It is a webinar and all you would need is a working computer and internet connection. Is my registration fee or ticket transferrable? Yes. Please let us know up until 48 hours before the event. Is it ok if the name on my ticket or registration doesn't match the person who attends? Yes. Please let us know up until 48 hours before the event.",
        "event_link": "https://www.eventbrite.com/e/metaverse-101-boston-tickets-334135537387?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#blockchain",
            "#cryptocurrency",
            "#crypto",
            "#metaverse",
            "#nft",
            "#blockchain_training",
            "#cryptocurrency_training",
            "#cryptocurrency_class"
        ]
    },
    {
        "title": "Unravelling NFTs (Non Fungible Tokens)| Boston",
        "date_time": "Friday, May 9 · 10am - 12pm EDT",
        "location": "Boston Online Event Boston, MA 02112 Show map",
        "about": "The workshop presents you with an opportunity to understand the basic concepts of NFT’s (Non-Fungible Tokens), and what makes them so special in today’s technologically advanced world. We aim to empower you with concrete knowledge and understanding of various dynamics of NFT’s and enable you to get started with the decentralized new economy and its benefits over centralized finance. Would you like a 5% discount on this training? Click here to get the discount code. Learning Objectives: Understand the basics of NFT's (Non-Fungible Tokens). Discover Use Cases applied to various industries. Learn about getting into NFT's Understanding the risks and benefits of investing in NFT. Agenda: Blockchain Fundamentals The decentralized Layer Blockchain-based NFT's History of NFT's NFT's market Busting the myths around NFT's The future of NFT's Questions & Answers Prerequisite: No prior knowledge of blockchain or NFT's (Non-Fungible Tokens) is required. Who can participate: Anyone with an interest in NFT's (Non-Fungible Tokens), new economy, generation of bankless, cryptocurrency, and trading. By the end of this course, you will have: Sound understanding of various aspects of NFTs (Non Fungible Tokens). Ability to make informed decisions about choosing your next investment opportunities in NFT space. Certificate of attainment. Note: Subject to Terms & Conditions. Individual pricing only, for corporates, please contact us via our website or drop an email at contact@blocksmartsol.com. If you are looking for alternate payment options, please contact us via our website or drop an email at contact@blocksmartsol.com. Any advice or suggestion shared during the workshop is not financial advice. You should consider your circumstances before making an investment. Trading digital currencies is a high-risk investment, and due consideration should be taken before making any investment decision. It will be a live online event. The link will be shared after you register for the event. FAQs What can I bring to the event? A curious mind. :) How can I contact the organizer with any questions? You can contact us via our website or drop an email at contact@blocksmartsol.com Will I get any documents for attending this workshop? Yes. You will receive a BSS attainment certificate after the workshop. Is the certificate shareable on social media (e.g. LinkedIn)? Yes. It is a digital certificate and you can share it with your peers/colleagues via social media (e.g. LinkedIn). Is there any group discount? Yes. Please reach out via our website or drop an email at contact@blocksmartsol.com What's the refund policy? Upto 2 weeks before the event. Please contact us in case you need to make any changes. Do I have to bring my printed ticket to the event? No need. It is a webinar and all you would need is a working computer and internet connection. Is my registration fee or ticket transferrable? Yes. Please let us know up until 48 hours before the event. Is it ok if the name on my ticket or registration doesn't match the person who attends? Yes. Please let us know up until 48 hours before the event.",
        "event_link": "https://www.eventbrite.com/e/unravelling-nfts-non-fungible-tokens-boston-tickets-334199077437?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#blockchain",
            "#cryptocurrency",
            "#crypto",
            "#metaverse",
            "#nft",
            "#blockchain_training",
            "#cryptocurrency_training",
            "#cryptocurrency_class"
        ]
    },
    {
        "title": "Waterworks Museum:  SPECIAL ACCESS TOUR",
        "date_time": "Friday, May 2 · 2:45 - 4pm EDT",
        "location": "Metropolitan Waterworks Museum 2450 Beacon Street Boston, MA 02467 Show map",
        "about": "Special Access ticket holders will receive an in depth guided tour and be permitted access to the sub-basement two stories below ground to view the massive Allis pumps that delivered 30 million gallons of water per day to the citizens of Boston. Participants will also have the exclusive opportunity to climb either the Allis Engine or the Leavitt engine for an up-close look at these mammoth machines. This tour is recommended for ages 10 and up and all participants must be at least 46 inches tall due to the height of the safety rails. All participants will be required to sign an accident and liability waiver acknowledging the risks associated with climbing the high and narrow pathways before being permitted to engage in the Special Access Tour. This waiver will be provided on your arrival. If you would like to review it ahead of time, please email us at info@waterworksmuseum.org. Please make sure to double check the date of your tickets before purchasing as, in the event the tour is sold out, Eventbrite will automatically reschedule you for the next available date. Tours leave PROMPTLY at the scheduled start time, so please plan to arrive 10 to 15 minutes before your tour starts to give yourself plenty of time to sign your waiver and get settled. Remember that space is limited on our Special Access Tours and demand is high, so if you are unable to attend your scheduled tour date, please reach out to us ASAP about rescheduling or cancelling your tickets. While we will make every effort to accommodate late arrivals, if you have not checked in for your tour by fifteen minutes after the scheduled start time you will forfeit your spot and other museum visitors will be able to purchase tickets for available spaces. To avoid missing out, make sure to reach out to us if you are running late so we will know to hold your place. PLEASE NOTE: Wearing a face covering while inside the museum is recommended but not required. If you have any symptoms of illness, please do not visit the museum at this time. We look forward to welcoming you back when you are well. For your safety, and the safety of our staff, please adhere to posted signage at the museum and the instruction of staff members. The Waterworks Museum reserves the right to refuse service to ticket holders who do not adhere to the posted safety standards. Though the Waterworks Museum is working hard to minimize risk, an inherent risk of exposure to COVID-19 exists in any public place where people are present. COVID-19 is an extremely contagious disease that can lead to severe illness and death. By booking this ticket, you voluntarily assume all risks related to exposure to COVID-19. The Waterworks Museum is pleased to be participating in the Mass Cultural Council’s Card to Culture program by extending a discounted rate on Special Access tours to EBT, WIC, and ConnectorCare cardholders. This program would not be possible without the collaboration of the Mass Cultural Council and the Executive Office of Health and Human Services' Department of Transitional Assistance, the Department of Public Health’s WIC, and the Massachusetts Health Connector respectively. Check out the full list of organizations offering EBT, WIC, and ConnectorCare discounts.",
        "event_link": "https://www.eventbrite.com/e/waterworks-museum-special-access-tour-tickets-167096124005?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Science & Tech Tours",
            "#history",
            "#tour",
            "#museum",
            "#water",
            "#engineering",
            "#industrial",
            "#vip",
            "#steam",
            "#engines"
        ]
    },
    {
        "title": "Intro to the Metal Lathe",
        "date_time": "Starts on Tuesday, May 6 · 6pm EDT",
        "location": "Artisan's Asylum 96 Holton Street Boston, MA 02135 Show map",
        "about": "This course meets two times per class session. Please check the Agenda above for the dates included in each session. By purchasing a ticket, you are committing to attend all meetings included in that session. The title of the Agenda page will indicate which ticket to purchase for that session. Instructor - Alex Bernstein Software engineer by day and machinist by night, Alex is a regular at A2. He helps build tooling and parts to service the equipment in the machine shop and has provided informal instruction to other members. He enjoys a good brisket sandwich, and spending time with his girlfriend, their cat, Meow Mix and dog, Queenie. He’s excited to share his passion of machining with you all! Class Description If you’ve ever been interested in machining and metal fabrication this class is for you! Learn how to operate the iconic Southbend lathe. It will provide a great jumping off point to begin your machining journey and you will leave confident in your understanding and operation of metal lathes. Material Fee The materials fee for this class is $20. This is separate from the ticket price and is to reimburse the instructor for any tools or materials used in this class. This will be paid once, directly to the instructor at the start of the first class meeting. This instructor accepts payments in cash or through Venmo. Class Goals - Safety, machine shop & lathe specific - Changing belt settings and back gear - Setup tools, tool holders, and tool post for correct height and angle. - Facing and turning down to diameter - Understanding backlash and zeroing dials - Demonstrate chatter - How to use the tailstock, center drilling, centers - Metrology-> use of calipers - Using power feed (clutch, gearbox, selectors) - Parting off - Proper cleanup procedure - Simple maintenance - About the A2 community Material Supplied Aluminum round bar stock Students Should Bring Closed toed shoes (preferably boots), no loose fitting clothes, ideally short sleeves, remove all jewelry, and hair longer than shoulder length MUST be tied up. Prerequisites All students must be 18 years old or older. Class Policies Learn more about our class and ticket cancelation policies Here . Please email education@artisansasylum.com with any questions. *Sales end 2 hours before the start of the class to allow the instructor and staff time to prep.",
        "event_link": "https://www.eventbrite.com/e/intro-to-the-metal-lathe-tickets-1263053670529?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#makerspace",
            "#machining",
            "#lathe",
            "#metal_lathe",
            "#makerspace_classes"
        ]
    },
    {
        "title": "Symphony for Science",
        "date_time": "Sunday, May 11 · 3 - 5:30pm EDT",
        "location": "Symphony Hall 301 Massachusetts Avenue Boston, MA 02115 Show map",
        "about": "Symphony for Science invites you into an unforgettable afternoon of music and shared humanity at Boston’s historic Symphony Hall. Presented by the Kendall Square Orchestra , this special Mother’s Day concert brings together musicians from Boston’s science, tech, and healthcare communities to perform music with heart and purpose. This year’s program features: – Dvořák’s Symphony No. 9 “From the New World” – Works by Mozart , Schubert , and Reena Esmail – A powerful performance by The Women’s Chorus , a vocal ensemble of women who have experienced homelessness – Reflections from Dr. Howard Koh (Harvard T.H. Chan School of Public Health), Kevin F. Adler (Miracle Messages), and Julie Leven (Shelter Music Boston) All proceeds benefit Boston Health Care for the Homeless Program , which delivers life-saving medical care, dignity, and compassion to more than 11,000 individuals across Greater Boston each year. Whether you’re honoring a mother, bringing family, or looking for a meaningful way to give back — this concert offers a powerful way to be present, together. Get tickets at symphonyforscience.org",
        "event_link": "https://www.eventbrite.com/e/symphony-for-science-tickets-1338647503719?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Performances",
            "Boston Science & Tech Performances",
            "#music",
            "#science",
            "#event",
            "#orchestra",
            "#symphony_for_science"
        ]
    },
    {
        "title": "Intro to 3D Printing/Additive Manufacturing",
        "date_time": "Monday, May 19 · 6 - 8:30pm EDT",
        "location": "Artisan's Asylum 96 Holton Street Boston, MA 02135 Show map",
        "about": "Instructors: Eric Wong (He/Him) Eric is a dedicated repair technician with a strong passion for 3D printing. He is committed to inspiring others to transform their creative ideas into tangible realities. Quantum Wei (He/Him) Quantum has over a decade of experience with 3d printing. Back in college, he and a friend constructed a Prusa Mendel from scratch. Since then he has used 3d printing in various capacities: to make 3d printer parts, reverse osmosis membrane spacers, and art pieces. Quantum has three degrees in mechanical engineering from MIT and has extensive teaching experience. Class Description This introductory course is for anyone who wants to get into 3D printing, a type of additive manufacturing. Specifically, you will learn how to use the Prusa printers in the Digifab lab, a type of fused deposition modeling printer. By the end of the class, you'll learn about designing parts for 3D printing, slicing parts, and exporting GCode to the printers so they know where to move. The class will also include testing on the machines so that you can start printing whatever you like within the constraints of these machines. Material Fee The materials fee for this class is $10. This is separate from the ticket price and is to reimburse the instructor for any tools or materials used in this class. This will be paid once, directly to the instructor at the start of the first class meeting. This instructor accepts payments in cash or through Venmo or Paypal. Class Goals Introduction to 3d printing/additive manufacturings and when to use it *Brief* introduction to 3d modeling and designing for fused deposition modeling Overview of where to find shape files, how to slice them, Gcode, and printer settings If time allows, brief discussion of other 3d printing techniques like stereolithography or metal 3d printing By the end of the class, you will be able to take your own 3d print home. Material Supplied 3d printer filament (PLA) Students Should Bring paper and pen(cil), to take notes if you like Suggest students to bring their own 3d model (.stl) on USB thumb drive or download one during the class. - an .STL file of a small object downloaded from Thingiverse (thingiverse.com) Prerequisites Students must be 12 years old or older. All students under 18 years old must be accompanied by and under the direct supervision of a responsible adult. Class Policies Learn more about our class and ticket cancelation policies here . Please email education@artisansasylum.com with any questions. *Sales end 24 hours before the start of the class to allow the instructor and staff time to prep.",
        "event_link": "https://www.eventbrite.com/e/intro-to-3d-printingadditive-manufacturing-tickets-726143503767?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#makers",
            "#3dprinting",
            "#makerspace",
            "#3dprint",
            "#3dprinter",
            "#3d_printing",
            "#makerspace_classes",
            "#makers_and_creators",
            "#3dprintingcourse",
            "#3dprintingactivities"
        ]
    },
    {
        "title": "Hands On Basic Electronics",
        "date_time": "Starts on Tuesday, June 3 · 7pm EDT",
        "location": "Artisan's Asylum 96 Holton Street Boston, MA 02135 Show map",
        "about": "This course meets four times per class session. Please check the Agenda above for the dates included in each session. By purchasing a ticket, you are committing to attend all meetings included in that session. The title of the Agenda page will indicate which ticket to purchase for that session. Instructors - Mike Beach and Andrew Anselmo Andrew Anselmo In addition to his regular engineering work, Andrew also volunteers as a shop lead and instructor at Artisan's Asylum in the Electronics and Robotics Shop. Integrating controls, sensors, actuators, and associated hardware is incredibly fun and always interesting. He also helps artists with kinetic art and sculpture projects and has taught them a few tricks for keeping their projects documented and easy to work on. He does a bit of origami and has been a street performer and instructor for many years. He’s designed a few novel and original origami models and made classic moving (kinetic) origami pieces out of metal. Origami is generally considered an art, but there is quite a bit of mathematics behind it. Mike Beach Mike Beach is an Electrical Engineer, Asylum member since 2012, has taught and co-taught several courses, cares more about how the electrons are feeling than programming, really likes learning about and using all kinds of sensors, and just can’t stop showing how to use that oscilloscope to help you debug (just ask Kevin), and is an active participant and mentor at the Circuit Hacking night held at the Asylum every Wednesday. Class Description Have you been interested in learning to work with electronics but haven’t known where to start? This class is for you! It will be a hands-on, practical crash course that will give you the skills to do simple electronic projects. You will walk away knowing the basics of circuit theory, how to prototype circuits on a breadboard, how to troubleshoot them, and how to solder them together. The class consists of four two-hour classes. In each class, we will complete at least one project, and you’ll go home with some fun things you have created. Students who want more time at Artisan's Asylum to work on their projects can attend Artisans Asylum’s weekly Circuit Hacking Night on Wednesday Nights. Material Fee The materials fee for this class is $30. This is separate from the ticket price and is to reimburse the instructor for any tools or materials used in this class. This will be paid once, directly to the instructor at the start of the first class meeting. This instructor accepts cash or payments through Venmo. Class Goals Learn an overview of electronic terminology - and build some stuff! Learn how to make use of the E&R shop. Learn how to use a multimeter to measure voltage, current, and resistance. How to use a multimeter (DMM) to help solve your circuit problems. How to test and debug a circuit. What components look like and why we use them. Learn fundamental concepts pertaining to electricity and electrical components. Leave with basic skills that will enable you to take on independent projects. You’ll build and take home your own blinky light circuit, Drawdio noisemaker, Joule Thief battery vampire. Learn how to read basic schematics, proper use of a multimeter and oscilloscope, and various electron wrangling skills. Material Supplied Small breadboard, following electronic components: 2N3904 NPN transistor, Various Ohm ¼ W resistors 3x LEDs of random colors, blue, red, green, or yellow, one white LED (with clear lens) Momentary push button switch small diodes Small potentiometer 100uF capacitor DC motor with brushes Bundle of breadboard wires AA battery holder with wires, 2x AA battery, Fresh 9V battery and holder Velleman Flashing LED kit, MK102 All the parts to build a Drawdio (based on a ‘555 timer, small speaker, a pencil, etc) Students Should Bring Their curiosity, a little patience, and something to take notes with. Prerequisites Students must be 12 years old or older. All students under 18 must be accompanied by and under the direct supervision of a responsible adult. Class Policies Learn more about our class and ticket cancelation policies here . Please email education@artisansasylum.com with any questions. *Sales end 24 hours before the start of the class to allow the instructor and staff time to prep.",
        "event_link": "https://www.eventbrite.com/e/hands-on-basic-electronics-tickets-692018053627?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#robotics",
            "#makers",
            "#makerspace",
            "#electronics",
            "#soldering",
            "#hands_on_workshops",
            "#robotics_education"
        ]
    },
    {
        "title": "The Automation Lab | Boston",
        "date_time": "Tuesday, July 22 · 9am - 4pm EDT",
        "location": "Boston TBD Boston, MA 02108 Show map",
        "about": "Become an Automation Pro In this class, you’ll see smart & effective automations that inspire before diving into the automation tool where you’ll get a simple planning process you can steal, plus uncover advanced actions. You’ll plan and build during guided work time with 1:1 help available from the ActiveCampaign team. This class is for you, if… You enjoy building automations You’ve been tasked with building automations You want to revamp your automations You’d like some automation inspiration Suggested Prerequisites: All are welcome (seriously!) but if you’re brand new to ActiveCampaign, we highly recommend you learn the platform basics before coming to this class. Attend the Getting Started webinar series or a regular Study Hall class , first, for the best experience. What to bring: An ActiveCampaign account Your laptop and charger What's included: Coffee, light breakfast and lunch ActiveCampaign giveaways Time with ActiveCampaign experts Due to venue capacity limits, Study Hall requires one ticket per person.",
        "event_link": "https://www.eventbrite.com/e/the-automation-lab-boston-tickets-1339036256489?aff=ebdssbdestsearch",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#technology",
            "#innovation",
            "#workshops",
            "#digital_transformation",
            "#automation_lab"
        ]
    },
    {
        "title": "Leveraging Robotics for Success | Boston",
        "date_time": "Thursday, May 15 · 10am - 12pm EDT",
        "location": "Boston Online Event Boston, MA 0 Show map",
        "about": "Welcome to Leveraging Robotics for Success! Are you ready to leverage robotics for success in your business? Unlock the transformative potential of robotics by diving into cutting-edge technologies, real-world applications, and the profound impact robotics has across industries. In this workshop, Leveraging Robotics for Success , you'll gain practical insights into how robotics revolutionises workflows, improves efficiency, and drives innovation in both industrial and service sectors. Participants will explore the fundamentals of robotics, from automation and machine learning integration to the design of autonomous systems. Real-world case studies will demonstrate how businesses have successfully leveraged robotics to enhance productivity, streamline operations, and gain a competitive edge in the market. Join us to discover how robotics can open new doors for your career or business! Claim a 5% Discount on this workshop, click here to access! Why Learn About Robotics In an era where automation and intelligent systems are becoming essential across industries, understanding robotics is no longer a luxury—it’s a necessity. Robotics knowledge empowers you to stay competitive and foster innovation, equipping you with the skills needed to harness its capabilities for optimizing processes, reducing operational costs, and enhancing productivity. Learning about robotics positions you at the forefront of technological advancements, making you a valuable asset in any organization. Whether you're aiming to advance your career or drive your business forward, expertise in robotics opens up a world of opportunities in today's increasingly automated landscape. 01) Drive Innovation and Efficiency Leverage robotics to create groundbreaking solutions, automate complex tasks, and streamline workflows with precision. Robotics enhances both creativity and operational productivity, reducing errors and optimizing business processes. 02) Boost Productivity and Accuracy Robotics enables you to perform tasks with unparalleled speed and accuracy, minimizing inefficiencies, reducing costs, and improving overall workflow precision. It is a key tool for enhancing operational performance. 03) Gain a Competitive Edge Mastering robotics not only positions you ahead of the curve in automation-driven industries but also makes you a valuable asset in any organization. With robotics expertise, you gain strategic advantage and unlock new career opportunities in a rapidly evolving market. What You'll Gain from this Workshop 01) Comprehensive Understanding of Robotics Acquire in-depth knowledge of robotics fundamentals and explore how this technology is transforming industries through automation and innovation. 02) Hands-On Experience Participate in interactive sessions focused on real-world robotics applications, enabling you to build practical skills in automation and robotics technologies. 03) Strategic Implementation Learn actionable strategies for incorporating robotics into your business processes, driving efficiency, innovation, and significant cost savings. 04) Optimized Operations Develop the ability to leverage robotics for streamlined operations, enhanced precision, and smarter decision-making within your organization. Who Should Attend 01) Business Leaders and Executives Professionals looking to integrate cutting-edge robotics technology to drive efficiency, innovation, and growth within their organizations. 02) Entrepreneurs & Innovators Individuals seeking to explore new opportunities in automation and robotics to gain a competitive edge and scale their ventures. 03) Operations and Technology Managers Those responsible for streamlining processes and optimizing workflows and want to leverage robotics to enhance productivity and decision-making.",
        "event_link": "https://www.eventbrite.com/e/leveraging-robotics-for-success-boston-tickets-1047742846057",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#business",
            "#ai"
        ]
    },
    {
        "title": "STEM Leader Institute: Bringing Engineering to Elementary Classrooms",
        "date_time": "July 15 · 8:30am - July 16 · 3:30pm EDT",
        "location": "Museum of Science 1 Museum Of Science Driveway Boston, MA 02114 Show map",
        "about": "Get ready to inspire your students and fellow educators with this interactive workshop designed for elementary STEM Leaders and educators. Not only will you engage in the Engineering Nightlights (Grade 1) and Engineering Magnetic Dog Doors (Grade 3) units, but you’ll also gain the tools and confidence to facilitate your own professional learning workshop and support colleagues using the YES curriculum. This workshop goes beyond learning the curriculum. You’ll gain the skills and resources to lead professional learning workshops of your own. We’ll provide you with facilitation tips, strategies, and support to confidently share these units and engineering learning frameworks with other educators. Who Should Attend? This workshop is perfect for elementary educators looking to enhance their STEM teaching and expand their role as a leader within their school or district. It is also perfect for STEM Leaders, Coaches, Administrators, and more, who are looking to train their educators on the YES and EiE curriculum. Breakfast and lunch are included in the registration fee and will be provided for all 2 days of the workshop. Special Offer for MA Educators: Enjoy discounted registration and FREE Engineering & Computer Science Kits after the workshop! (Use promo code: MAEducator) Do you also teach middle school students or engage with middle school educators? Make your trip to the Museum of Science worthwhile and stay for one more day of learning! On July 17, immediately following this STEM Leader Institute, join us for a one-day workshop, Engineering Eco-Friendly Slippers in Middle School. Learn more and register here .",
        "event_link": "https://www.eventbrite.com/e/stem-leader-institute-bringing-engineering-to-elementary-classrooms-tickets-1082411194019",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Cambridge, MA",
            "Cambridge Classes",
            "Cambridge Science & Tech Classes",
            "#education",
            "#innovation",
            "#engineering",
            "#stem_leader_institute",
            "#pk_8"
        ]
    },
    {
        "title": "AI Implementation in Business | Boston",
        "date_time": "Thursday, May 22 · 10am - 12pm EDT",
        "location": "Boston Online Event Boston, MA 0 Show map",
        "about": "Welcome to AI Implementation in Business! Are you curious about how artificial intelligence can revolutionize your business operations? In today’s rapidly evolving digital landscape, businesses that harness the power of AI are leading the way in innovation, efficiency, and growth. This workshop is designed to give you the tools and insights to integrate AI into your business strategy, transforming how you operate and make decisions. Whether you’re looking to stay ahead of the competition or explore the full potential of AI, this training will help you take that crucial next step. Whether you're a small startup or a large corporation, this event is perfect for anyone looking to stay ahead in the digital age. Don't miss out on this opportunity to learn from the best in the field! Why Learn About AI In a world where technology is rapidly advancing, understanding AI is crucial for staying competitive and driving innovation. Learning about AI equips you with the knowledge to leverage its capabilities effectively, making you a valuable asset in any organization. 01) Drive Innovation AI opens doors to new possibilities, enabling you to create innovative solutions and improve existing processes. 02) Enhance Decision-Making By analyzing data more efficiently, AI provides valuable insights that lead to better, data-driven decisions. 03) Gain a Competitive Edge Mastering AI technology positions you ahead of the curve, giving you an advantage in a technology-driven market. What You'll Gain from this Workshop 01) In-Depth Knowledge Understand the core concepts of AI and its strategic importance in modern business. 02) Hands-On Experience Acquire practical skills through interactive sessions and real-world AI applications. 03) Strategic Integration Learn how to effectively integrate AI into your business strategy to drive growth and innovation. 04) Enhanced Decision-Making Develop the ability to leverage AI for improved data analysis and informed decision-making Who Should Attend 01) Business Leaders & Managers Those seeking to understand how AI can optimize operations and drive strategic growth 02) Entrepreneurs & Innovators Individuals looking to leverage AI for innovative solutions in startups or small businesses 03) Technology Enthusiasts Individuals eager to explore AI’s potential and its transformative impact across different sectors.",
        "event_link": "https://www.eventbrite.com/e/ai-implementation-in-business-boston-tickets-1026632865537",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#business",
            "#technology",
            "#ai",
            "#artificialintelligence",
            "#aibootcamp",
            "#artificial_intelligence",
            "#technology_innovation",
            "#ai_training",
            "#ai_for_business"
        ]
    },
    {
        "title": "Salesforce Platform App Builder Certification Training in Boston, MA",
        "date_time": "Wednesday, May 28 · 9am - 5pm EDT",
        "location": "Boston, MA Regus Business Center Boston, MA 02111 Show map",
        "about": "The Salesforce Platform App Builder credential is designed for individuals who would like to demonstrate their skills and knowledge in designing, building, and deploying custom applications using the declarative customization capabilities of the Lightning Platform. The candidate can create, manage, and update data models, application security, business logic, and process automation. Here are some examples of the concepts you will understand Design the data model, user interface, business logic, and security for custom applications Customize applications for mobile use Design reports and dashboards Deploy custom applications Key Features: 24 hours of Interactive Classroom/Online Instructor-led training Group Activities for better reinforcement Real-world examples from various industries Industry-based case studies Trainers’ Notes, Sample Question Paper & Case Studies 24/7 customer support What you'll learn Understand all of the core concepts on the Platform App Builder Comprehensive understanding of the principles and functionalities of Salesforce. Master Salesforce's security measures and automation tools to build robust CRM solutions. Learn to create dynamic and user-friendly interfaces effortlessly using the Lightning App Builder. Develop skills in creating detailed reports and dynamic dashboards and executing seamless Salesforce deployments. Create Workflow Automation Procedures in Salesforce Customize the Salesforce Mobile App User Interface, Navigation, and Actions Create Permission Sets Requirements No prior experience is expected or required It is ideal if you have some familiarity and background in the Salesforce platform, but it is not mandatory No coding experience required Who should attend App Builders System Administrators Developers IT Managers Product Managers Sales Representatives Topics: What is Cloud Computing Service and Deployment models in the Cloud Market situation Cloud Ownership Introduction to SF1 and Force.com Platform Declarative & Programmatic Options in Force.com Meta-data Driven Architecture Multi-tenant Architecture Business and IT benefits Use of SF1 Why global corporates prefer Learning Zone Inc. as their training partner An Enterprise Learning Solutions (ELS) provider, Learning Zone Inc. creates industry-fit talents through training, coaching, and consulting by globally acclaimed trainers. Much of Learning Zone’s repute in co-creating business value stems from: Training delivered in 45+ countries. 250+ industry-relevant courses. Customized course curriculum as per your team's specific needs Consulting and coaching to transform organizations. Trainers with experience in Retail, E-commerce, Energy & Utilities, etc. Best value for time & money invested. Get trained at the best fee compared to other vendors Discounted fee offered for five or more attendees *We provide corporate training at your preferred locations and dates at no additional charge. Contact us for more information: Name: Debbie Riel Email: debbie.riel@learninzone.com Phone: +1 (302) 251-9769",
        "event_link": "https://www.eventbrite.com/e/salesforce-platform-app-builder-certification-training-in-boston-ma-tickets-1320597545809",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#salesforce_app_builder",
            "#learningzone_salesforce",
            "#salesforce_platform_class",
            "#salesforce_online_event",
            "#app_salesforce_classroom",
            "#salesforce_live_training",
            "#salesforce_exam_course",
            "#salesforce_certifi_onsite",
            "#salesforce_cloud_training",
            "#lightning_salesforce_prep"
        ]
    },
    {
        "title": "Metaverse 101 | Boston",
        "date_time": "Friday, May 2 · 10am - 12pm EDT",
        "location": "Boston Online Event Boston, MA 02112 Show map",
        "about": "Blockchain Smart Solutions offers a 2-hours webinar on the latest hype in the crypto space - Metaverse. The workshop is an opportunity to introduce yourself to the concept of Metaverse in the decentralized world. Find out why it's being called the 'Next-big-thing', what is the potential of the digital world and how it can potentially shape the future. Would you like a 5% discount on this training? Click here to get the discount code. Learning Objectives: Understand the basics of the Metaverse in decentralized and centralized environments. Discover Use Cases applied to various industries. Explore a few real-world projects. Identify and understand the near-future trends in this space. Agenda: Understand the basics of the Metaverse Metaverse in decentralized and centralized environments. Crypto coins/tokens and Metaverse. Discover Metaverse Use Cases applied to various industries. What is next in Metaverse space? Explore a few real-world projects. Investments in Metaverse. Real world projects. Questions & Answers Prerequisite: No prior knowledge of blockchain or metaverse is required. Who can participate: Anyone with an interest in virtual reality, cryptocurrencies, or an appreciation of technology evolution. By the end of this course, you will have: Sound understanding of various aspects of this growing technology. Ability to make informed decisions about choosing your next investment opportunities in metaverse space. Certificate of attainment. Note: Subject to Terms & Conditions. Individual pricing only, for corporates, please contact us via our website or drop an email at contact@blocksmartsol.com. If you are looking for alternate payment options, please contact us via our website or drop an email at contact@blocksmartsol.com. Any advice or suggestion shared during the workshop is not financial advice. You should consider your circumstances before making an investment. Trading digital currencies is a high-risk investment, and due consideration should be taken before making any investment decision. It will be a live online event. The link will be shared after you register for the event. FAQs What can I bring to the event? A curious mind. :) How can I contact the organiser with any questions? You can contact us via our website or drop an email at contact@blocksmartsol.com Will I get any documents for attending this workshop? Yes. You will receive a BSS attainment certificate after the workshop. Is the certificate shareable on social media (e.g. LinkedIn)? Yes. It is a digital certificate and you can share it with your peers/colleagues via social media (e.g. LinkedIn). Is there any group discount? Yes. Please reach out via our website or drop an email at contact@blocksmartsol.com What's the refund policy? Upto 2 weeks before the event. Please contact us in case you need to make any changes. Do I have to bring my printed ticket to the event? No need. It is a webinar and all you would need is a working computer and internet connection. Is my registration fee or ticket transferrable? Yes. Please let us know up until 48 hours before the event. Is it ok if the name on my ticket or registration doesn't match the person who attends? Yes. Please let us know up until 48 hours before the event.",
        "event_link": "https://www.eventbrite.com/e/metaverse-101-boston-tickets-334135537387",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#blockchain",
            "#cryptocurrency",
            "#crypto",
            "#metaverse",
            "#nft",
            "#blockchain_training",
            "#cryptocurrency_training",
            "#cryptocurrency_class"
        ]
    },
    {
        "title": "Waterworks Museum:  SPECIAL ACCESS TOUR",
        "date_time": "Friday, May 2 · 2:45 - 4pm EDT",
        "location": "Metropolitan Waterworks Museum 2450 Beacon Street Boston, MA 02467 Show map",
        "about": "Special Access ticket holders will receive an in depth guided tour and be permitted access to the sub-basement two stories below ground to view the massive Allis pumps that delivered 30 million gallons of water per day to the citizens of Boston. Participants will also have the exclusive opportunity to climb either the Allis Engine or the Leavitt engine for an up-close look at these mammoth machines. This tour is recommended for ages 10 and up and all participants must be at least 46 inches tall due to the height of the safety rails. All participants will be required to sign an accident and liability waiver acknowledging the risks associated with climbing the high and narrow pathways before being permitted to engage in the Special Access Tour. This waiver will be provided on your arrival. If you would like to review it ahead of time, please email us at info@waterworksmuseum.org. Please make sure to double check the date of your tickets before purchasing as, in the event the tour is sold out, Eventbrite will automatically reschedule you for the next available date. Tours leave PROMPTLY at the scheduled start time, so please plan to arrive 10 to 15 minutes before your tour starts to give yourself plenty of time to sign your waiver and get settled. Remember that space is limited on our Special Access Tours and demand is high, so if you are unable to attend your scheduled tour date, please reach out to us ASAP about rescheduling or cancelling your tickets. While we will make every effort to accommodate late arrivals, if you have not checked in for your tour by fifteen minutes after the scheduled start time you will forfeit your spot and other museum visitors will be able to purchase tickets for available spaces. To avoid missing out, make sure to reach out to us if you are running late so we will know to hold your place. PLEASE NOTE: Wearing a face covering while inside the museum is recommended but not required. If you have any symptoms of illness, please do not visit the museum at this time. We look forward to welcoming you back when you are well. For your safety, and the safety of our staff, please adhere to posted signage at the museum and the instruction of staff members. The Waterworks Museum reserves the right to refuse service to ticket holders who do not adhere to the posted safety standards. Though the Waterworks Museum is working hard to minimize risk, an inherent risk of exposure to COVID-19 exists in any public place where people are present. COVID-19 is an extremely contagious disease that can lead to severe illness and death. By booking this ticket, you voluntarily assume all risks related to exposure to COVID-19. The Waterworks Museum is pleased to be participating in the Mass Cultural Council’s Card to Culture program by extending a discounted rate on Special Access tours to EBT, WIC, and ConnectorCare cardholders. This program would not be possible without the collaboration of the Mass Cultural Council and the Executive Office of Health and Human Services' Department of Transitional Assistance, the Department of Public Health’s WIC, and the Massachusetts Health Connector respectively. Check out the full list of organizations offering EBT, WIC, and ConnectorCare discounts.",
        "event_link": "https://www.eventbrite.com/e/waterworks-museum-special-access-tour-tickets-167096124005",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Tours",
            "Boston Science & Tech Tours",
            "#history",
            "#tour",
            "#museum",
            "#water",
            "#engineering",
            "#industrial",
            "#vip",
            "#steam",
            "#engines"
        ]
    },
    {
        "title": "Intro to the Metal Lathe",
        "date_time": "Starts on Tuesday, May 6 · 6pm EDT",
        "location": "Artisan's Asylum 96 Holton Street Boston, MA 02135 Show map",
        "about": "This course meets two times per class session. Please check the Agenda above for the dates included in each session. By purchasing a ticket, you are committing to attend all meetings included in that session. The title of the Agenda page will indicate which ticket to purchase for that session. Instructor - Alex Bernstein Software engineer by day and machinist by night, Alex is a regular at A2. He helps build tooling and parts to service the equipment in the machine shop and has provided informal instruction to other members. He enjoys a good brisket sandwich, and spending time with his girlfriend, their cat, Meow Mix and dog, Queenie. He’s excited to share his passion of machining with you all! Class Description If you’ve ever been interested in machining and metal fabrication this class is for you! Learn how to operate the iconic Southbend lathe. It will provide a great jumping off point to begin your machining journey and you will leave confident in your understanding and operation of metal lathes. Material Fee The materials fee for this class is $20. This is separate from the ticket price and is to reimburse the instructor for any tools or materials used in this class. This will be paid once, directly to the instructor at the start of the first class meeting. This instructor accepts payments in cash or through Venmo. Class Goals - Safety, machine shop & lathe specific - Changing belt settings and back gear - Setup tools, tool holders, and tool post for correct height and angle. - Facing and turning down to diameter - Understanding backlash and zeroing dials - Demonstrate chatter - How to use the tailstock, center drilling, centers - Metrology-> use of calipers - Using power feed (clutch, gearbox, selectors) - Parting off - Proper cleanup procedure - Simple maintenance - About the A2 community Material Supplied Aluminum round bar stock Students Should Bring Closed toed shoes (preferably boots), no loose fitting clothes, ideally short sleeves, remove all jewelry, and hair longer than shoulder length MUST be tied up. Prerequisites All students must be 18 years old or older. Class Policies Learn more about our class and ticket cancelation policies Here . Please email education@artisansasylum.com with any questions. *Sales end 2 hours before the start of the class to allow the instructor and staff time to prep.",
        "event_link": "https://www.eventbrite.com/e/intro-to-the-metal-lathe-tickets-1263053670529",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#makerspace",
            "#machining",
            "#lathe",
            "#metal_lathe",
            "#makerspace_classes"
        ]
    },
    {
        "title": "Unravelling NFTs (Non Fungible Tokens)| Boston",
        "date_time": "Friday, May 9 · 10am - 12pm EDT",
        "location": "Boston Online Event Boston, MA 02112 Show map",
        "about": "The workshop presents you with an opportunity to understand the basic concepts of NFT’s (Non-Fungible Tokens), and what makes them so special in today’s technologically advanced world. We aim to empower you with concrete knowledge and understanding of various dynamics of NFT’s and enable you to get started with the decentralized new economy and its benefits over centralized finance. Would you like a 5% discount on this training? Click here to get the discount code. Learning Objectives: Understand the basics of NFT's (Non-Fungible Tokens). Discover Use Cases applied to various industries. Learn about getting into NFT's Understanding the risks and benefits of investing in NFT. Agenda: Blockchain Fundamentals The decentralized Layer Blockchain-based NFT's History of NFT's NFT's market Busting the myths around NFT's The future of NFT's Questions & Answers Prerequisite: No prior knowledge of blockchain or NFT's (Non-Fungible Tokens) is required. Who can participate: Anyone with an interest in NFT's (Non-Fungible Tokens), new economy, generation of bankless, cryptocurrency, and trading. By the end of this course, you will have: Sound understanding of various aspects of NFTs (Non Fungible Tokens). Ability to make informed decisions about choosing your next investment opportunities in NFT space. Certificate of attainment. Note: Subject to Terms & Conditions. Individual pricing only, for corporates, please contact us via our website or drop an email at contact@blocksmartsol.com. If you are looking for alternate payment options, please contact us via our website or drop an email at contact@blocksmartsol.com. Any advice or suggestion shared during the workshop is not financial advice. You should consider your circumstances before making an investment. Trading digital currencies is a high-risk investment, and due consideration should be taken before making any investment decision. It will be a live online event. The link will be shared after you register for the event. FAQs What can I bring to the event? A curious mind. :) How can I contact the organizer with any questions? You can contact us via our website or drop an email at contact@blocksmartsol.com Will I get any documents for attending this workshop? Yes. You will receive a BSS attainment certificate after the workshop. Is the certificate shareable on social media (e.g. LinkedIn)? Yes. It is a digital certificate and you can share it with your peers/colleagues via social media (e.g. LinkedIn). Is there any group discount? Yes. Please reach out via our website or drop an email at contact@blocksmartsol.com What's the refund policy? Upto 2 weeks before the event. Please contact us in case you need to make any changes. Do I have to bring my printed ticket to the event? No need. It is a webinar and all you would need is a working computer and internet connection. Is my registration fee or ticket transferrable? Yes. Please let us know up until 48 hours before the event. Is it ok if the name on my ticket or registration doesn't match the person who attends? Yes. Please let us know up until 48 hours before the event.",
        "event_link": "https://www.eventbrite.com/e/unravelling-nfts-non-fungible-tokens-boston-tickets-334199077437",
        "tags": [
            "United States Events",
            "Massachusetts Events",
            "Things to do in Boston, MA",
            "Boston Classes",
            "Boston Science & Tech Classes",
            "#blockchain",
            "#cryptocurrency",
            "#crypto",
            "#metaverse",
            "#nft",
            "#blockchain_training",
            "#cryptocurrency_training",
            "#cryptocurrency_class"
        ]
    }
]